{"id":103134,"date":"2019-09-17T11:56:51","date_gmt":"2019-09-17T09:56:51","guid":{"rendered":"https:\/\/ftmo.com\/?p=103134"},"modified":"2023-09-21T10:44:48","modified_gmt":"2023-09-21T08:44:48","slug":"forex-strength-meter","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/forex-strength-meter\/","title":{"rendered":"Forex Strength Meter &#8211; How to pick the best trade!"},"content":{"rendered":"<p><em>We have received this very interesting article from one of our followers. The article starts with a brief explanation of FX movements, which serves as a good reminder to all. The main part of this article is dedicated to the analysis of a strength \/ weakness of any individual pair. This approach can be used for smaller and higher time frames, giving traders a possible idea of how to add a meaningful confirmation to their trading system.<\/em><\/p>\n<h3><span lang=\"EN-US\">Currency and Currency Pair<\/span><\/h3>\n<p><span lang=\"EN-US\"><br \/>\nIn this article, we will talk about currencies and currency pairs, so let&#8217;s first define what do we mean by them. As we all know, currency pairs such as EURUSD, USDJPY and many others &#8211; a currency pair is the quotation of two different currencies, with the value of one currency being quoted against the other. In the pair EURUSD there are two currencies involved the Euro (EUR) and the US Dollar (USD). The price\/quote of EURUSD represents the value of the Euro (EUR) against the US Dollar (USD). This article is about individual currency strength, to understand the movement of the currency pairs involving that particular currency.<\/span><\/p>\n<h3><span lang=\"EN-US\">Why It Is Important?<\/span><\/h3>\n<p><span lang=\"EN-US\"><br \/>\nThe movement of a currency pair depends on the relative state of two individual currencies. EURUSD price 1.1500 means that 1 Euro (EUR) is now trading at 1.15 US Dollar (USD). This price goes up and down for many reasons. The price may rise if the EUR gets relatively stronger than USD and can fall if the EUR gets relatively weaker than USD. That can happen in many ways. For a price rise of EURUSD the EUR has to get stronger while the USD strength remains unchanged, or the USD has to get weaker while the EUR strength remains unchanged. For a price fall, the situation will be vice versa.<\/span><\/p>\n<div id=\"attachment_103145\" style=\"width: 1040px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-103145\" class=\"size-large wp-image-103145\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/EUR_1-1030x303.png\" alt=\"\" width=\"1030\" height=\"303\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/EUR_1-1030x303.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/EUR_1-300x88.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/EUR_1-768x226.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/EUR_1-705x207.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/EUR_1-450x132.png 450w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/EUR_1.png 1101w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><p id=\"caption-attachment-103145\" class=\"wp-caption-text\">Currency table<\/p><\/div>\n<p>&nbsp;<\/p>\n<p><span lang=\"EN-US\">The table above is showing the most common scenarios that happen to a currency pair price when individual currency strength shifts from a stronger to the weaker stage. If we can understand the individual strength and weakness of a currency, we will get an edge on trading the currency pairs of that currency. We will be able to decide on continuation or reversal forecasts. We will be able to take advantage of the pullbacks of a trend, slope lines of a channel and volatility\/spikes of a range.<br \/>\nIt is not possible to understand the strength and weakness of an individual currency by looking at one of its pair&#8217;s price. But it is possible to understand the strength\/weakness standpoint of a currency when we look at it with a holistic view. In the next paragraphs, we will discuss about the methods of understanding currency strength\/weakness.<\/span><\/p>\n<h3><span lang=\"EN-US\">Strength &amp; Weakness<\/span><\/h3>\n<p><span lang=\"EN-US\"><br \/>\nHow can we measure the strength and weakness of an individual currency? There are several methods of doing this. We should choose a method according to our objective because some methods are very complex and suggest the use of expensive software and services. Our objective here is simple &#8211; to add an extra edge with our existing trading systems. We will go the easy way for this analysis, though it may not be mathematically accurate but will give us the required understanding. This will be a visual process.<\/span><\/p>\n<p><span lang=\"EN-US\"><br \/>\nWe always observe price moves with higher highs and higher lows in the upward direction and lower highs and lower lows in the downward direction. Of course, sometimes the price makes a range while no new high or low is registered for a long time. In this analysis, we will look for highs and lows of different pairs of currencies and will try to understand the synchronization of the movements.<br \/>\nLet&#8217;s take the Pound Starling (GBP) as an example of our analysis. It is a major currency pair and it is a heavily traded pair. It has minor and cross pairs will all the major currencies. Most brokers offer at least 11 pairs of currency pairs involving GBP.<\/span><\/p>\n<p>As of 2019-08-16 below are the rates of the common GBP pairs:<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-103166\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/table_2.png\" alt=\"\" width=\"733\" height=\"418\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/table_2.png 733w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/table_2-300x171.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/table_2-705x402.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/table_2-450x257.png 450w\" sizes=\"(max-width: 733px) 100vw, 733px\" \/><\/p>\n<p><span lang=\"EN-US\">Now, if our existing system or our existing analytical method produces an opportunity of going long or short on any of the GBP pairs, a holistic view can help us to make more confident decisions. The image below is showing charts of 8 GBP pairs. The charts are of daily (1D or D) timeframe and are showing the period from mid-July to mid-August. The 2nd chart from left is showing EURGBP. We have to consider the chart as reverse to compare it with other pairs as there GBP is the quote currency.<\/span><\/p>\n<div id=\"attachment_103171\" style=\"width: 1799px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-1.png\"><img loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-103171\" class=\"wp-image-103171 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-1.png\" alt=\"\" width=\"1789\" height=\"929\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-1.png 1789w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-1-300x156.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-1-768x399.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-1-1030x535.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-1-1500x779.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-1-705x366.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-1-450x234.png 450w\" sizes=\"(max-width: 1789px) 100vw, 1789px\" \/><\/a><p id=\"caption-attachment-103171\" class=\"wp-caption-text\">GBP Pairs<\/p><\/div>\n<p>In these charts, we can see the pairs marked several new highs and lows. It is visible in almost all the GBP pairs in the charts that are flowing downward movement with lower highs and lower lows (EURGBP upward because GBP is the quote currency there). It can mean GBP is getting weaker or all the other currencies are getting stronger for different reasons at the same time. It takes just common sense to understand that GBP as an individual currency is getting weaker according to these charts. Surely, different charts are showing different levels of weakness. The GBPCHF fall was too sharp with no pullback, GBPCAD offered two tiny pullbacks while GBPNZD is ranging and attempting to break a very recent high. Though the overall direction of GBP is downward in these charts, the very recent movement of last 7 days is showing either a pause, a pullback or a reversal of the downward move.<\/p>\n<p>The dashed horizontal lines on the chart show the last high attempts or the last highs the pairs made. We can see the distance from the last high is not similar in the pairs. In GBPUSD and GBPJPY the gap seems too large while in GBPAUD and GBPNZD the gap is very low. From a broad view, until all price stays under the dashed line, we can assume GBP as a currency is weak. If our system or method generates any signal that tells us to go long in any GBPXXX pair for a prolonged time and the profit target is above the dashed lines, <strong>w<\/strong><strong>e know that will not be a very good idea.<\/strong> When 3 or more pairs will break the lower- high lower-low sequence and will start the higher-high higher-low sequence, that time we will look for a reversal movement in other pairs and target profits in the upward direction. But there is no clear higher high sequence there and the lower lows are under progression. Now as GBPAUD and GBPNZD are showing a range movement, it means they are quite equal in terms of relative strength with GBP. Let’s see the charts of the AUD pairs.<\/p>\n<div id=\"attachment_103172\" style=\"width: 1798px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-2.png\"><img loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-103172\" class=\"wp-image-103172 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-2.png\" alt=\"\" width=\"1788\" height=\"929\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-2.png 1788w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-2-300x156.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-2-768x399.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-2-1030x535.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-2-1500x779.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-2-705x366.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/picture-2-450x234.png 450w\" sizes=\"(max-width: 1788px) 100vw, 1788px\" \/><\/a><p id=\"caption-attachment-103172\" class=\"wp-caption-text\">AUD Pairs<\/p><\/div>\n<p>The AUD pairs are showing weakness in overall view but the weakness is not similar to the GBP pairs. It was more like a rise at the starting of the chart and a fall started from the mid area of the chart. Unlike the little pullback of last 7 days\/candles of the GBP pairs, AUD is showing stagnation. Just looking at 2 setups we can now see that GBP and AUD are showing weakness in respect of the other currencies. And surprisingly by analyzing these, we can clearly see that the USD, JPY and CHF are the strong currencies, at least against GBP, AUD and NZD. <strong>This can open the window of opportunity for us as well. Let&#8217;s see the charts of JPY for instance.<\/strong><\/p>\n<div id=\"attachment_103173\" style=\"width: 1799px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/image-3.png\"><img loading=\"lazy\" decoding=\"async\" aria-describedby=\"caption-attachment-103173\" class=\"wp-image-103173 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/image-3.png\" alt=\"\" width=\"1789\" height=\"930\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/image-3.png 1789w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/image-3-300x156.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/image-3-768x399.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/image-3-1030x535.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/image-3-1500x780.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/image-3-705x366.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/09\/image-3-450x234.png 450w\" sizes=\"(max-width: 1789px) 100vw, 1789px\" \/><\/a><p id=\"caption-attachment-103173\" class=\"wp-caption-text\">JPY Pairs<\/p><\/div>\n<p>&nbsp;<\/p>\n<p>The JPY pairs are clearly indicating that it is maybe the strongest of the major currencies, equaling with CHF JPY has created a strong and sharp move throughout the charts.<\/p>\n<p>So far with a holistic view in small time, we got to know which currency has the upper hand and which has the lower hand in the market in our analytical time period.<\/p>\n<p>&nbsp;<\/p>\n<h2>How This Analysis Can Help<\/h2>\n<p>This analysis can be helpful in many ways. Before making the points here, let&#8217;s be clear that this model of analysis is fractal in nature just like the timeframes. As we know, the chart creates meaningful patterns with highs and lows in every timeframe, the main principle of analysis is the same in every timeframe. Though the accuracy of forecasts and results may vary from the longer to shorter timeframes. We can actually apply this analysis to any timeframe. <strong>Now let’s discuss the ways we can use this analytical method.<\/strong><\/p>\n<ol>\n<li>Confirmation: This strength measuring visual method can act as a confirmation tool for any trade. Suppose our system suggests a short on GBPCAD pair where the estimated holding period will be 10 to 15 days with an expectation that GBPCAD will create a new low or at least will test the recent low. We know the overall strength of GBP is weak and we know where to put our stop loss and we will also look for GBP reversals on the other charts. If we see 3 or more charts have been reversed and our trade still didn’t hit the stop loss or profit target, we can think of taking profit before hitting the take profit level or cut the losses before hitting the stop loss level. If our system suggests short on GBPAUD and GBPNZD, we will be able to choose disparately because we also know the relative strength of AUD and NZD, and that will tell us how much weight we should put on each pair. That will enable us to size our positions more wisely and diversely.<\/li>\n<li>Spotting Trading Opportunity: Though it is not recommended to use this analytical method as a standalone tool, but it can be used to search and spot good trading opportunities. From the visual analysis of our example charts, we know JPY is a strong currency and GBP is a weak currency in our study time period. So according to the example charts and our model GBPJPY can be a good trading opportunity. Usually, this kind of strength\/weakness match makes large pips differences. But usually the volatility and the decision speed become a problem if we fail to spot them very early. Generally, the pairs involving one significantly strong or weak and one neutral\/ranging currency often give us some wonderful trades. And they are easy to trade than the strong &amp; weak matches. Again, this analysis is to see the market from a holistic view, the opportunity spotting process should become with proper experience with this method. The most successful outcome from this analysis is long term price movement forecasts.<\/li>\n<\/ol>\n","protected":false},"excerpt":{"rendered":"<p>We have received this very interesting article from one of our followers. The article starts with a brief explanation of FX movements, which serves as a good reminder to all. The main part of this article is dedicated to the analysis of a strength \/ weakness of any individual pair. This approach can be used [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":406481,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/103134"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=103134"}],"version-history":[{"count":2,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/103134\/revisions"}],"predecessor-version":[{"id":609832,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/103134\/revisions\/609832"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/406481"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=103134"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=103134"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=103134"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}