{"id":24049,"date":"2018-08-31T08:15:02","date_gmt":"2018-08-31T06:15:02","guid":{"rendered":"https:\/\/ftmo.com\/?p=24049"},"modified":"2024-01-26T17:00:54","modified_gmt":"2024-01-26T16:00:54","slug":"how-to-save-while-you-hedge","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/how-to-save-while-you-hedge\/","title":{"rendered":"How to save while you hedge?"},"content":{"rendered":"<p><em>Do you practice hedging in your trading? If yes, then you are the right person who might be interested in the article we’ve prepared for you today. The article will describe how to save money if you have some hedged positions. We know about the MT4 function that many traders are unfamiliar with or haven’t explored it yet and that’s why they pay double the amount of commissions and spreads to the broker.<\/em><\/p>\n<h2>What is hedging<\/h2>\n<p>For the beginners, we will now explain the term “<strong>hedging<\/strong>”. It is a situation, where we have a position open in both directions. In other words, we have a buy (long) and sell (short) position with the same volume. By doing this, our trade is secured against the future price development. The typical hedged position in your MT4 terminal looks like this:<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2018\/08\/hedge.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-24050 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2018\/08\/hedge.png\" alt=\"\" width=\"1902\" height=\"84\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2018\/08\/hedge.png 1902w, https:\/\/ftmo.com\/wp-content\/uploads\/2018\/08\/hedge-300x13.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2018\/08\/hedge-768x34.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2018\/08\/hedge-1030x45.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2018\/08\/hedge-1500x66.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2018\/08\/hedge-705x31.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2018\/08\/hedge-450x20.png 450w\" sizes=\"(max-width: 1902px) 100vw, 1902px\" \/><\/a><\/p>\n<p>As you can see, the result of both positions equals to -$12. We often hear the opinions that if our positions are <strong>hedged<\/strong>, the result of the positions doesn’t change. However, <strong>that is not true nowadays<\/strong>. Let’s not forget that spreads are floating. If the spread widens, the cumulative result of our positions will be worse, even if these positions are hedged! While trading higher volumes, the spread movements can be absolutely crucial so we recommend being aware of this.<\/p>\n<h2>How to save on hedging?<\/h2>\n<p>Let’s finally get to the core of this article and learn how to save while hedging. <strong>A common practice to close the hedged position<\/strong> is that we close both open positions. <strong>Beware of such a wrong practice!<\/strong> You end up paying the costs (spreads and commissions) for both positions. On the other hand, <strong>if you close one position by the other hedged position, you will save money as the broker will only charge you the cost for one position<\/strong>. Why is that? Simply because you close your long trade with your short trade and you don’t open any new position that anybody would charge you for.<\/p>\n<h2>Technical hedging execution in MT4<\/h2>\n<p>In your MT4 Terminal, simply right-click on one of your open positions and choose „Modify or Delete order“. Then the dialog window will open where we head over to “Type: Close by” and we select the offered counter-positions. When you look into the Account history of your Terminal, you can see that one position is closed with a proper result and the second counter-trade is printed with a volume result of 0.<\/p>\n<p>For a better understanding of the situation, we have made the following short video which takes you step-by-step on how to practice the proper hedging.<\/p>\n<p style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/vGKy2Ms_uOg\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n<p>Video transcript:<\/p>\n<p><em>Hello traders from the FTMO, the project where we are looking for experienced traders.<\/em><\/p>\n<p><em>In today&#8217;s video, we&#8217;ll look at how to hedge properly and, above all, ending the hedge position so we do not pay unnecessary commissions and spreads.<\/em><\/p>\n<p><em>We will open two positions, one buy and one sell. The result is -$37 because we pay commissions and spreads.<\/em><\/p>\n<p><em>Normally, as we can see from traders, they end the hedged positions by closing both trades. This means that you will pay commissions and spreads for both positions. When we look at the trade history, we actually paid -$37.<\/em><\/p>\n<p><em>Let&#8217;s try it now in a different way in order to save money. We have two positions again and again we have a loss of -$37.  Now, let’s have a look at how to properly close the positions and save. In your platform terminal, make a right-click on the position and choose „Modify or Delete order“.   A dialog window opens where we can edit the trade. We select &#8220;Type: Close by&#8221; and choose from the trades that are recognized by the platform as counter-positions.<\/em><\/p>\n<p><em>What are we going to do? We will close one position by the second hedged position. As you know, when we buy, closing a buying position is a sell, so now we tell Metatrader to pair our two positions, so we do not open any new ones and we should only pay one spread and commission. So we close our position and we see that both have disappeared and now let&#8217;s have look at the trading journal history on what happened here. You can see that we have two new lines, each representing one closed trade. We have one for -$18 and the other one for 0. This one was actually closed by a hedged counterposition. The volume of the trade is also 0, which means that the second trade does not seem to have taken place because we have used it to close the first deal. The result of these two positions is, therefore -$18, compared to the previous situation when we paid for two trades -$37. This way, you can close your hedge position with much lower fees.<\/em><\/p>\n<p><em>Thanks for your attention and remember to trade safe. You can find more interesting content on our FTMO blog and on our social media channels as well. Cheers!<\/em><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Do you practice hedging in your trading? If yes, then you are the right person who might be interested in the article we’ve prepared for you today. The article will describe how to save money if you have some hedged positions. We know about the MT4 function that many traders are unfamiliar with or haven’t [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":406400,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/24049"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=24049"}],"version-history":[{"count":6,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/24049\/revisions"}],"predecessor-version":[{"id":606016,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/24049\/revisions\/606016"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/406400"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=24049"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=24049"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=24049"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}