{"id":324066,"date":"2020-04-17T12:21:34","date_gmt":"2020-04-17T10:21:34","guid":{"rendered":"https:\/\/ftmo.com\/?p=324066"},"modified":"2022-01-11T18:00:27","modified_gmt":"2022-01-11T17:00:27","slug":"attachment-to-money","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/attachment-to-money\/","title":{"rendered":"Attachment to Money"},"content":{"rendered":"<p><em>This week, our trader Richard talks about attachment to money and how we as traders should focus more on actual trading instead of the money part of it. Enjoy the article!<\/em><\/p>\n<h3>How bad is your Attachment to Money?<\/h3>\n<p>Do you have trouble pushing the button when executing trades?<\/p>\n<p>Do you freeze when currency pairs retrace… causing you to get out of trades… only to observe them bolt back into the direction you had from the start?<\/p>\n<p>How many profitable trades have you missed because you allow fear, self-doubt, or emotions to control your choices?<\/p>\n<p>Every trade executed has risk.<\/p>\n<p>Every human takes some risk on a daily basis.<\/p>\n<p>Those with a strong attachment to money fear risk.<\/p>\n<p>They want to hold onto every dime they have instead of understanding the laws of abundance and how money is a tool used to barter for goods and services.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-324164 size-large\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/7191-1030x687.jpg\" alt=\"\" width=\"1030\" height=\"687\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/7191-1030x687.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/7191-300x200.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/7191-768x512.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/7191-1500x1000.jpg 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/7191-705x470.jpg 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/7191-450x300.jpg 450w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<p><strong>Overcoming attachment to money is what every trader has to do<\/strong>… and continues to face… when executing trades. The key is recognizing your human limitations… as if every trade executed turned out to be profitable, you would never hesitate.<\/p>\n<p>I tell myself: <em>“If trading was a job and we offered 100 positions with a guaranteed five year, million dollars per year contract to work for a Forex firm, we would have millions of people banging down the doors or flooding the internet attempting to hit their lottery ticket seeking their shot at championship gold.”<\/em><\/p>\n<p>You would have nothing to fear and you would take decisive action.<\/p>\n<p>Unfortunately, you&#8217;ve probably learned the hard way that professional traders aren’t seeking employees, yet they are always looking for championship quality people trained to prosper in the most liquid market on earth… the recession-proof business of the 21st century known as the Forex.<\/p>\n<p>Attachment to money will begin to subside when you retrain your subconscious mind how to react to winning trades. Bottom line, you must learn how to accept the losers before you ever understand the winners.<\/p>\n<p>Those with practice regimen accounts execute trades in LIVE current market conditions as an exercise to build confidence in markets before trading their money.<\/p>\n<p>During your apprenticeship, you learn that you could have done all your work before executing a trade… and still end up losing pips. The possibility of being wrong and losing money shakes your confidence and stays with you.<\/p>\n<p>Major League Baseball players (like traders) must exhibit short term memory loss when facing failure. MLB players play 162 games over the course of a six month regular season, and if they’re talented enough… they fail on an average of seven out of every ten times they step up to the plate.<\/p>\n<p>Their minds are focused. Traders have about 240 trading sessions per year and must remain focused… breaking down failure to understand success.<\/p>\n<p>So… Do you have a problem with hesitation in pushing the button when executing trades?<\/p>\n<p>Do you have a predetermined game plan in advance for each trade executed?<\/p>\n<p>Do you follow your trading strategy in practice accounts… and yet find you change your rules of engagement in LIVE accounts?<\/p>\n<p>Do you procrastinate until you execute a trade… and then are unable to leave your computer because you have to watch every tick movement of the currency pair you just traded?<\/p>\n<p>Do you need a sense of direction?<\/p>\n<p>It’s okay. Everyone does, some more than others… and like keeping a luxury car running… we all need mental checkups from time to time.<\/p>\n<p>Everyone, including myself.<\/p>\n<p>Take a deep breath and know a tune-up is within reach, if you make the choice.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This week, our trader Richard talks about attachment to money and how we as traders should focus more on actual trading instead of the money part of it. Enjoy the article! How bad is your Attachment to Money? Do you have trouble pushing the button when executing trades? Do you freeze when currency pairs retrace… [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":407617,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/324066"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=324066"}],"version-history":[{"count":2,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/324066\/revisions"}],"predecessor-version":[{"id":567018,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/324066\/revisions\/567018"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/407617"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=324066"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=324066"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=324066"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}