{"id":390666,"date":"2020-07-24T21:54:05","date_gmt":"2020-07-24T19:54:05","guid":{"rendered":"https:\/\/ftmo.com\/?p=390666"},"modified":"2022-01-11T17:58:25","modified_gmt":"2022-01-11T16:58:25","slug":"brothers-from-other-mothers-investing-vs-trading","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/brothers-from-other-mothers-investing-vs-trading\/","title":{"rendered":"Brothers from other mothers: Investing vs Trading"},"content":{"rendered":"<p><em>Financial freedom is a very attractive goal for a lot of people. These days, options are limitless. In this article, our colleague Tung looks at the two most popular ways how to enter the world of finance &#8211; Trading and Investing. He compares these two models and provides pros and cons for both. <\/em><\/p>\n<p>Throughout your trading journey or the journey of life, you have certainly heard the word Investing and I am pretty sure that you have heard about Investing more than you&#8217;ve heard about trading.<\/p>\n<p>Although principally those two terms are very similar to each other, their approach is very different.<\/p>\n<p>Investing and trading are nothing more than just a calculated input of one’s capital with a hope for a capital increase in the output.<\/p>\n<p>The reason why I said ‘hope’, is because every investment or every trade carries a certain amount of risk. Since investing and trading nowadays involves currencies, they are considered as part of the financial world.<\/p>\n<h2>Investing<\/h2>\n<p>A &#8216;big brother investor&#8217; is an approach that is mostly risk-averse. Although it depends on the chosen investment portfolio, most investors are involved in stable-low-risk investment portfolios.<\/p>\n<p>Investing basically involves buying and holding an asset for a longer period of time for an investment to perform and gain its value which can potentially write off the short-term losses from the constant fluctuation of the markets.<\/p>\n<p>Investment instruments can be a portfolio of stocks, funds, bonds, or even real estate. Investors often care about the performance, fundamentals and the future outlook of an asset for consistent growth rather than entering and exiting short-term positions because often the fees to buy and to sell an investment are higher.<\/p>\n<p>In order to eliminate risk or to keep the risk at a minimal level, an investor will seek diversification of assets in the portfolio.<\/p>\n<p>For example, a diverse portfolio can be a portfolio where it governs assets of all financial components such as real estate, cash, bonds, stocks, and funds.<\/p>\n<p>When you invest, you basically spread yourself out, making sure that when one asset underperforms another, you will still take the winning edge.<\/p>\n<p>Nevertheless, every investment carries a certain amount of risk that could potentially hurt the value of the assets in the portfolio. This can be a financial crisis, a recession, a world pandemic, or any fundamentals related to the financial market directly and indirectly.<\/p>\n<h2>Trading<\/h2>\n<p>On the other hand, there is the other approach of capital gain in the financial markets and that is trading.<\/p>\n<p>Trading involves more frequent day-to-day transactions of buying and selling of stocks, commodities, currency pairs, cryptocurrencies, indices, and so on.<\/p>\n<p>Unlike investing, generating profit from trading can be achieved in both rising and falling markets and in most cases, it does not matter whether the market has entered a recession or that the world is currently suffering from the pandemic, trading is always there.<\/p>\n<p>Although investors are fine with 10%-15% of annual capital gain, traders usually aim for 10% per month, however, as we already know, with greater potential gain, there is a higher potential loss. One view in trading is buying low and selling high, and because trades can be highly leveraged, the potential for a loss is also significantly higher.<\/p>\n<p>Another difference between trading and investing is that it concerns more technical analysis and risk-to-reward ratios rather than fundamentals.<\/p>\n<h2>The final note<\/h2>\n<p>Investing and trading can be both highly profitable and as both involve entering and exiting a market position, a certain amount of risks is always in place.<\/p>\n<p>Although investing and trading are very similar to each other, trading is more about daily charts, and investing is more about monthly, quarterly, or even yearly charts.<\/p>\n<p>For me personally, I tend to call investing as the bigger brother of trading, because the capital required to start to properly invest and to establish a portfolio, usually needs to be much higher. Therefore, it is an approach to the financial markets in the bigger picture.<\/p>\n<p>Investors tend to spread themselves out to lower risks and ensure the stable growth of their assets in the long run.<\/p>\n<p>On the other hand, as trading involves day-to-day activities of getting in and getting out of a position, trader’s personality, experience, character, and risk tolerance are all projected in the particular style which determines whether a trader is profitable or not.<\/p>\n<p>With that being said, in order to start investing, you will need much larger capital and if you are starting from the scratch in building your wealth, trading is a great step towards serious investing and towards financial freedom. When it comes to trading, I like to use the term ‘hunt or be hunted’ and at FTMO, we are constantly looking for hunters that can make those profits consistently and systematically.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Financial freedom is a very attractive goal for a lot of people. These days, options are limitless. In this article, our colleague Tung looks at the two most popular ways how to enter the world of finance &#8211; Trading and Investing. He compares these two models and provides pros and cons for both.  Throughout your [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":407643,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[4809],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/390666"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=390666"}],"version-history":[{"count":5,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/390666\/revisions"}],"predecessor-version":[{"id":593558,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/390666\/revisions\/593558"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/407643"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=390666"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=390666"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=390666"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}