{"id":393271,"date":"2020-08-06T10:31:18","date_gmt":"2020-08-06T08:31:18","guid":{"rendered":"https:\/\/ftmo.com\/?p=393271"},"modified":"2023-10-26T16:06:22","modified_gmt":"2023-10-26T14:06:22","slug":"forex-gambling","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/forex-gambling\/","title":{"rendered":"Is Forex trading gambling? The answer might shock you!"},"content":{"rendered":"<p><em><span data-preserver-spaces=\"true\">In this new article, our colleague Tung writes about one of the most discussed and obvious topics of Forex Trading. Is it a Gambling or not? Throughout his professional career, he met many people with various opinions on trading and guess what the majority had said. Yes, the wide public considers trading as nothing else but a Casino and on a side note, the majority of traders lose money or give up shortly. Do you think there might be a correlation? Maybe.<\/span><\/em><\/p>\n<h2>The World’s Biggest Casino &#8211; Forex<\/h2>\n<p>I once met a professional investor with some decent academic background and experience in the financial industry and when I raised the topic of Forex Trading because I had mentioned that I am very interested in it, his immediate answer was that Forex is a Casino and that he uses it only for “Diversification”.<\/p>\n<p>Later on, I realized that Investing and Trading are two completely different professions and even though they have the same principle, which is approaching the Financial Markets with an aim for a capital gain, their approach and systems are completely different which made me realize that an Investor is not the same as a Trader.<\/p>\n<p>In case you are interested, you can read my post about the <a href=\"https:\/\/ftmo.com\/brothers-from-other-mothers-investing-vs-trading\/\">differences between investing and trading<\/a>.<\/p>\n<p>Now getting back to the main topic of today’s post, I must honestly say that when I heard the opinion from that investor, I was crushed.<\/p>\n<p>I felt like my dreams of becoming a professional trader had just been shattered and I completely lost my hope thinking that trading is just a fancy name for gambling. Now every time I think back to those days I am laughing at the level of my ignorance and lack of research back then.<\/p>\n<p>Nevertheless, in this topic we will be discussing why trading resembles gambling so much, to what distinction is gambling the same as Forex Trading and then also, we will lay out the main reasons why it is not the same as gambling and how you can make money by trading in the long run.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-393580\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/Bez-názvu-1-1030x680.jpg\" alt=\"\" width=\"1030\" height=\"680\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/Bez-názvu-1-1030x680.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/Bez-názvu-1-300x198.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/Bez-názvu-1-768x507.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/Bez-názvu-1-705x465.jpg 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/Bez-názvu-1.jpg 1191w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<h2>Is Forex Trading gambling?<\/h2>\n<p>In this section, we will break down the key aspects of Forex trading that resemble gambling. When we look at at it in general, from the rookie point of view, we are able to see that the basic processes are very similar:<\/p>\n<h3>Money<\/h3>\n<p>This is clear and straightforward. You need money to start in both cases. You need capital to execute your first trade or to place your first bet and the reason why I have compared Forex as the world’s biggest casino is that the money that fluctuates in both industries is enormous. Both industries handle a large amount of money every day and even though the amount that is being handled in the casinos cannot compare to the number in Forex markets, it still is a significant number.<\/p>\n<h3>Risk<\/h3>\n<p>As the game goes on, the market or the spinning table of roulette performs itself and the outcome decides whether you lose money or you win money. This is called risk because nobody can precisely predict the outcome of the market or the game, therefore there is always an amount of uncertainty as nobody knows in advance what the results will be.<\/p>\n<h3>Profit\/Loss<\/h3>\n<p>Winning and losing is part of the game. This section is clear and straightforward as traders and players enter the market or the casino with the pure intention to win some money. There is a small percentage of people who say that they trade or play just for fun, however, we know that these people never last long because eventually the emotions will kick in and all starts to get downhill.<\/p>\n<h3>Emotions<\/h3>\n<p>Throughout the game or the trade as well as in the outcome there are a lot of emotions involved.<\/p>\n<p>When you win money you feel the euphoria, your heart beats faster and the joy from the profit is so loud that it is so undeniable. On the other hand, when you lose money, sadness, frustration, and anxiety take over.<\/p>\n<p>These emotions are so strong that they are so irresistible that a newbie trader can hardly control them and as we already know among the strongest sources of these emotions are Fear and Greed.<\/p>\n<p>These are obvious reasons why forex trading is so similar to gambling and the majority of people fall into the gambling side of trading because they treat trading as gambling and then they blame that trading is gambling because they have lost control and money.<\/p>\n<p>However, for us, the serious traders, the good news is that that&#8217;s just about it.<\/p>\n<p><span style=\"font-weight: 400;\">These are the only similarities. As there is more to gambling than just gambling so there is more to trading and with this mindset, we can educate ourselves and explore the ways to make a consistent profit. <\/span><\/p>\n<h2>Why is Forex trading more than gambling?<\/h2>\n<p>First things first, let’s talk about math.<\/p>\n<p>As casinos have a statistical edge over the players, that statistical edge always ensures that the house always wins.<\/p>\n<p>Taking the roulette as the classic example,  <span style=\"font-weight: 400;\">which you might have already seen somewhere online<\/span>, there are 36 numbers on the roulette table with red and black colours.<\/p>\n<p>Each time you place a bet on a red or black colour, you might think that you have a 50\/50 chance of winning or losing.<\/p>\n<p>However, casinos slide into the roulette the sneaky green zero number, also the green double zero depending on where you currently reside, and that does not make the 50\/50 chance of winning anymore but roughly 47\/53 and that is the statistical edge over a long time. So in the long run, let’s say in 100 bets, you will only win 47 bets and the casino will win 53 bets.<\/p>\n<p>The good thing about trading is that you can trade like a casino. Over 47 losing trades you can have 53 winning trades, <span style=\"font-weight: 400;\">assuming that every trade has the same amount of lots, however, it all depends on your system, psychology, and risk management, and finally, be profitable. <\/span><\/p>\n<p>More reading on <a href=\"https:\/\/ftmo.com\/en\/how-to-think-in-probabilities\/\">trading with a statistical edge<\/a>.<\/p>\n<p>Secondly, you are allowed to use any kind of tools and enhancements that will help your trading become consistently profitable.<\/p>\n<p>The tools that you can utilize in trading can be a set of Expert Advisors that can perform trading on your behalf so you do not have to deal with the emotional hassle while in a trade, or you can simply copy the trades from someone else, someone who is a professional trader.<\/p>\n<p>In order to enhance your trading, you can also use indicators for your technical analysis to gain an understanding of the characteristics of an instrument to get the trading edge. With the recent technological advancements, there are numerous advantages to trading.<\/p>\n<p>At FTMO, you have access to a wide range of applications that will enhance your trading such as Mentor Application that measures the flow of your Equity, Statistical Application that shows you a summary of your trades in charts and statistics, Trading Journal that can track your trades in case you want to add a description to your trades, Account MetriX to track the overall performance of your account, and so on.<\/p>\n<p><span style=\"font-weight: 400;\">Apart from the technological advancements and enhancements, you can also use a human mentor for your trading. Would the casino allow you to bring a mathematician with you on the casino floor to count the cards on Blackjack? While <a href=\"https:\/\/ftmo.com\/en\/\">trading a funded forex account<\/a>, there are almost no limitations to the way you trade, what tools you use, and how you behave. Moreover, on your trading journey, you can meet plenty of professionals, financial experts, etc. and these types of social groups will only educate you, which I am pretty sure will only take you forward in your career and life. <\/span><\/p>\n<p>Nevertheless, gambling can also be profitable. As I said, you can learn to count the cards to win the Blackjack, or you can learn how to develop a statistical edge to win the bets in horse races, however, in the long run, the casino always wins and even if you find a loophole in those casino games, you risk being kicked out and get banned from casinos.<\/p>\n<h2>The final note<\/h2>\n<p><span style=\"font-weight: 400;\">In conclusion, Forex Trading can be gambling if you treat it like gambling. If you have no plan, no strategy, or no systematic approach to the market, and you rely solely on luck, then the outcome will always be a loss because you are trading against the big guys. Those guys do not only have an overview of the market as such, but they also know the behaviour of the mass people and the big guys that I am talking about here are the big banks. So in order to win over those big guys, you have to think like the big guys. You have to be willing to take the small losses, to be able to take the big wins and thus ensure profitability in the long run. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It is a long and lonely road towards consistent long-term profitability, which demands a lot of consistency, discipline, and dedication. And just like any other occupation or profession, in order to be the best trader, you have to be willing to sacrifice the sweat, blood, and tears in terms of learning to control your psychology, manage your risk, planning, testing, re-strategizing and so on. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The process is long but the good thing is that you have all the available tools, resources, people, and companies that will support you along your journey and it is up to you how much of yourself you are willing to dedicate.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>In this new article, our colleague Tung writes about one of the most discussed and obvious topics of Forex Trading. Is it a Gambling or not? Throughout his professional career, he met many people with various opinions on trading and guess what the majority had said. Yes, the wide public considers trading as nothing else [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":406535,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[4809],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/393271"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=393271"}],"version-history":[{"count":13,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/393271\/revisions"}],"predecessor-version":[{"id":606594,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/393271\/revisions\/606594"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/406535"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=393271"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=393271"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=393271"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}