{"id":394352,"date":"2020-09-04T07:41:44","date_gmt":"2020-09-04T05:41:44","guid":{"rendered":"https:\/\/ftmo.com\/?p=394352"},"modified":"2023-09-12T13:46:50","modified_gmt":"2023-09-12T11:46:50","slug":"how-to-become-professional-trader","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/how-to-become-professional-trader\/","title":{"rendered":"Are you really a Professional Trader? &#8211; The ultimate guide to become one"},"content":{"rendered":"<p><em>Although trading is often portrayed as an easy job that you can do from your phone or laptop on the beach, this couldn&#8217;t be far from the truth. If you truly want to become a Professional Trader, there is a long and hard journey you have to take. In this comprehensive article, we are going to crunch through all the aspects you have to learn to master to become a Professional Trader.<\/em><\/p>\n<h2>Learning the basics<\/h2>\n<p>Everyone who wants to become a professional trader needs to have 100% understanding of the basics.<\/p>\n<p>These are topics such as: <strong><em>What is Trading? What is Forex Trading? What is traded in Forex Markets? Basics of technical and fundamental analysis and how brokers operate.<\/em><\/strong><\/p>\n<p>All of these topics were covered in exhausting details on the internet before so it won&#8217;t take you long to grasp the basics, just be careful to not being stuck with one source only.<\/p>\n<p>Always compare different resources to find so you will get the best information.<\/p>\n<p>You can also buy books or courses on trading basics but it is not necessary as all of these things can be found for free.<\/p>\n<p>One more alternative for you on learning the basics is our <a href=\"https:\/\/trader.ftmo.com\/trading-academy\" target=\"_blank\" rel=\"noopener noreferrer\">FTMO Academy<\/a>.<\/p>\n<p>All you have to do to gain access is to make a free registration at <a href=\"https:\/\/trader.ftmo.com\" target=\"_blank\" rel=\"noopener noreferrer\">https:\/\/trader.ftmo.com<\/a> and you will have unlimited access to our FTMO Academy.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-394355\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/Screenshot_3.jpg\" alt=\"\" width=\"914\" height=\"808\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/Screenshot_3.jpg 914w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/Screenshot_3-300x265.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/Screenshot_3-768x679.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/Screenshot_3-705x623.jpg 705w\" sizes=\"(max-width: 914px) 100vw, 914px\" \/><\/p>\n<p>After you learn the basics, there is a lot of things that you have to decide based on your own discretion before you are ready to build your trading plan and trading system.<\/p>\n<h2>What type of trader are you?<\/h2>\n<p>Even before you start building any advanced trading system, you have to decide on what type of trader you want to be.<\/p>\n<p>This is not only about what would you like to do, but also what personality type you are, and what your schedule allows you to do.<\/p>\n<h3>So what type of traders are there?<\/h3>\n<h4>Scalpers<\/h4>\n<p>This is probably the hardest one you can pick. Why?<\/p>\n<p>Scalpers are in and out of the markets very quickly, their trades last from minutes to sometimes just a few seconds.<\/p>\n<p>Because of that, you are required to focus 100% during the whole trading session.<\/p>\n<p>Scalpers also miss a lot of trading opportunities and rely solely on the big winner they are able to catch once in a while.<\/p>\n<p>This is something that can be very demanding on your psychology as you lose a lot and no one likes losing.<\/p>\n<p>So why do people choose to be scalpers if it is so hard?<\/p>\n<p>There are two major reasons for that.<\/p>\n<p>The first one is the returns. Being in and out of the market means that you are getting a lot of opportunities in the markets every day.<\/p>\n<p>Swing traders, for example, have to wait several days for the right opportunity and they quite often just sit at their hands and wait.<\/p>\n<p>Scalpers do the exact opposite.<\/p>\n<p>Even though their win rate is usually lower, they can easily compensate it with R: R ratio and a number of opportunities they get.<\/p>\n<p>The second reason which is not often talked about is freedom.<\/p>\n<p>Scalpers and daytraders whom we are going to talk about next don&#8217;t really care about long term movements in the market.<\/p>\n<p>Because of that, they trade during their currently active session, which can be 4, 8 or 10 hours long. Once they are done, they don&#8217;t have to care about the market until their next trading session.<\/p>\n<p>This reduces the stress of babysitting any long term positions which could disrupt your sleep and generally stress you out.<\/p>\n<h4>Day Traders<\/h4>\n<p>Daytraders are similar to scalpers in a lot of things.<\/p>\n<p>They also watch markets in their predetermined sessions, but usually, they want to watch the market whole day.<\/p>\n<p>They are not interested in being in and out of the trades quickly, but they much rather capture a bigger intraday move.<\/p>\n<p>For that reason, they only open a handful of positions, yet sometimes they even stay flat for a whole day.<\/p>\n<p>Although daytraders are required to watch the market for a longer period, the approach tends to be more relaxed with high focus only required when the market trades around their desired level.<\/p>\n<p>Daytraders usually hold trades for a few hours.<\/p>\n<p>As they try to capture the bigger moves, they know that they have to give a market some room to breathe.<\/p>\n<p>They generally do not hold positions overnight but sometimes they do as they try to capture even bigger intra-week moves.<\/p>\n<h4>Swing Traders<\/h4>\n<p>Swing traders are looking to capture intra-week moves.<\/p>\n<p>They hold positions for a couple of days, sometimes weeks.<\/p>\n<p>Swing trading is very popular among beginner traders, mostly because it doesn&#8217;t require a lot of chart time and analysis.<\/p>\n<p>You can prepare for you trades in the morning and thanks to alerts and limit orders, you let the market do its thing with very low input.<\/p>\n<p>This sounds like a piece of cake, right? Are there any downfalls?<\/p>\n<p>Yes, there are. Swing trading requires an extreme amount of patience as you often have to wait for several days for the market do give you your desired setup.<\/p>\n<p>And the real work begins once you enter into the position.<\/p>\n<p>Because you are holding the position for a longer time, you must be ready for swings in price and sometimes disrupted sleep.<\/p>\n<p>Also, since you are taking a lot fewer trades, it will take much longer to build your track record.<\/p>\n<h4>Position Traders<\/h4>\n<p>You will hardly become a position trader early in your trading career.<\/p>\n<p>Position traders are also called investors.<\/p>\n<p>They hold their trades for weeks, months or years and they usually follow large fundamental sentiments.<\/p>\n<p>A big amount of capital is required to become a position trader.<\/p>\n<h2>Choosing the right market<\/h2>\n<p>So now you probably know what type of trader you want to become.<\/p>\n<p>The next thing to decide is what markets you will be trading.<\/p>\n<p>This will differ a lot on the type of trader you are.<\/p>\n<p>Swing traders trade usually 5, 10 or 20 markets at once.<\/p>\n<p>Daytraders, on the other hand, only watch one or two.<\/p>\n<p>A lot of traders will tell you that every market is the same, but this is not true.<\/p>\n<p>Every market has its own characteristics and behaviour you need to know.<\/p>\n<p>Also, the different markets move at a different time.<\/p>\n<p>If you live in Asia, there is not that big of a reason for you to trade EUR\/GBP which is a cross of Euro and Great British Pound.<\/p>\n<p>Why? Simply because the most volatility happens during a London session which is the evening time in Asia.<\/p>\n<p>These different nuances have to be well thought off.<\/p>\n<p>Nowadays you can also trade Commodities and Indices with most of the Forex brokers, and this gives you even more choices.<\/p>\n<p>Try to study different markets, how they move and also when they move.<\/p>\n<p>Even if you are a swing trader and plan to trade 10, or 20 markets, you can start slow.<\/p>\n<p>There is no reason to rush things, you can start watching forex majors first, then add some crosses and maybe some indices or commodities.<\/p>\n<p>Once you gain some experience, you can get rid of markets that you don&#8217;t like and stick to those you do.<\/p>\n<p>Also, once you have your own trading system, you can backtest different setups through the markets to increase your probability of success.<\/p>\n<h2>Trading Capital<\/h2>\n<p>Before we jump into the trading system and trading plan, we have to talk about trading capital.<\/p>\n<p>You can have the best strategy in the world, but you will hardly make anything if you are undercapitalized.<\/p>\n<p>A lot of traders think they can start trading with $1000 and make a fortune.<\/p>\n<p>Making 10% every single month with $1000 starting capital, you will end up with approx $3100 at the end of the 12-month cycle, and that&#8217;s clearly not enough.<\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/09\/tabulkaen.png\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-412643\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/09\/tabulkaen.png\" alt=\"\" width=\"3604\" height=\"3904\" \/><\/a><\/p>\n<p>That&#8217;s why we started FTMO.<\/p>\n<p>Our primary vision was to help traders with the problem of undercapitalization and connect them to investors.<\/p>\n<p>Once you pass our evaluation process, you can get funded with up to $300,000.<\/p>\n<p>As you can see, the trading capital cannot be taken lightly.<\/p>\n<p>Trading is an expensive business and it can be very costly, especially at the beginnings.<\/p>\n<p>If you want to start trading full time, $10,000 is the bare minimum and even with that, you will have a very hard time to cover living expenses and also being able to grow your account.<\/p>\n<p>Luckily, FTMO is here and if you don&#8217;t want to risk your money, we are more than happy to provide you with the necessary capital.<\/p>\n<h2>Trading Strategy<\/h2>\n<p>So now you know how much money you need, what type of trader you want to be and what markets you want to trade.<\/p>\n<p>So what is the last and one of the most important aspects to make you a professional forex trader?<\/p>\n<p><strong>A robust trading strategy.<\/strong><\/p>\n<p>There are pretty much two paths you can choose, <strong>technical or fundamental trading<\/strong>.<\/p>\n<p>If you like to watch the news, look in-depth to the economy of each major country, and speculate on high impact news that move the market, then fundamental trading is for you.<\/p>\n<p>Technical analysis is probably more popular among retail traders, but it doesn&#8217;t make it less popular in professional traders crowd.<\/p>\n<p>If you decide to become a technical trader, there are a few ways and strategies to consider.<\/p>\n<h3>Discretionary vs Systematic Trading<\/h3>\n<p>Discretionary trading puts all the decisions on you, entries, stop losses and exits solely differ on your destruction.<\/p>\n<p>Systematic trading is built upon a system that has a rule-based approach, most often with a clearly defined stop loss, entry and take profit.<\/p>\n<p>Which one is better?<\/p>\n<p>Trading like a robot with a systematic approach can sound more appealing as it removes all emotions. It is, however, extremely difficult to build a systematic approach or a trading bot that will be working in any type of market environment.<\/p>\n<p>It usually requires great programming skills and hours spent on backtesting different strategies, and even that doesn&#8217;t guarantee success. We have made a trading experiment based on Algorithmic intelligence. <a href=\"https:\/\/ftmo.com\/a-big-test-of-algo-trading-does-it-work\/\" target=\"_blank\" rel=\"noopener\">You can access it here<\/a>.<\/p>\n<p>Discretionary trading will always differ by the situation you are in and it requires your best judgement to enter on not to enter into a trade.<\/p>\n<p>One of the big positives of discretionary trading is the fact that you can quickly adjust to different market conditions and with enough experience and screen time, you will be able to adapt yourself to different opportunities which are worth pursuing.<\/p>\n<h3>Price action vs Indicators<\/h3>\n<p>Another lengthy discussion is about traders using either Indicators, Price Action or both.<\/p>\n<p>If you look at professional traders at proprietary trading firms or hedge funds, you won&#8217;t see many technical indicators on their screens.<\/p>\n<p>Does it mean that indicators have no value? Not at all.<\/p>\n<p>They can be used properly as an addition to price action trading and because they usually give straight forward buy or sells signals, their reliance can be easily backtested so you are going to be able to see if they are worth your time or not.<\/p>\n<h2>Trading strategy of a professional trader<\/h2>\n<p>So what is the conclusion here?<\/p>\n<p>Should you be using technicals or fundamentals? Price action or indicators? Discretion or systematic approach?<\/p>\n<p><strong>In the best scenario, you should be using all of it in your trading and configuring your own trading style based on these building blocks. <\/strong><\/p>\n<p>If you decide to be a technical trader, you still should pay some attention to world economic events and fundamentals that influence the market.<\/p>\n<p>You can build a robust price action system which will use one or two indicators as another factor of confluence for your setups.<\/p>\n<p>And you can have a system that has a strictly systematic entry, exit and stop-loss rules but you will still be in charge with your discretion so you can decide if you want to make a trade or not.<\/p>\n<p>We know this looks like a lot, but with time and experience, you will see a value in it.<\/p>\n<h2>Trading Plan<\/h2>\n<p>The last piece of the puzzle is going to be your trading plan.<\/p>\n<p>This is where you are going to lay everything out.<\/p>\n<p>Your trading approach, markets you trade, the strategy you are using, the risk profile for your trading, entries, exits, etc.<\/p>\n<p>This is your business plan and it needs to have a set of rules that keep you in the trading game for long enough.<\/p>\n<p>Your trading plan can look something like this:<\/p>\n<h3>Markets traded<\/h3>\n<p>only EUR\/USD<\/p>\n<h3>Timeframes<\/h3>\n<p>D1 and H1 for analysis<\/p>\n<p>5min for execution<\/p>\n<h3>Trading time<\/h3>\n<p>Trades are only executed during the London session, between 8 am and 2:30 pm GMT<\/p>\n<h3>Before and after a trading session<\/h3>\n<p>Before trading session &#8211; Look at D1 and H1 and set up a daily bias<\/p>\n<p>After the trading session &#8211; Journal all trades with Time, Entry, Stop-loss, Take Profit, R:R Ratio and screenshot provided<\/p>\n<h4>Trading Strategy<\/h4>\n<p>5-minute S\/R break and retest with market trading above or below 21 and 10 EMA which depends on the desired direction<\/p>\n<p>Example:<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-394362 size-large alignnone\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/download-1030x589.png\" alt=\"\" width=\"1030\" height=\"589\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/download-1030x589.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/download-300x171.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/download-768x439.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/download-1536x878.png 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/download-1500x857.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/download-705x403.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/download.png 1589w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<p>This is obviously only an example and you can go in much more depth with your trading plan.<\/p>\n<p>But hopefully, we have shown you an example of how it can look like.<\/p>\n<h2>In Conclusion<\/h2>\n<p>Becoming a professional trader in Forex is not an easy task, but it can be done.<\/p>\n<p>It requires a lot of dedication and experience, but once you have that, it becomes much easier.<\/p>\n<p>Trading is a business and every professional trader knows that.<\/p>\n<p>That&#8217;s why you need a robust trading strategy, trading journal and you must show up every day to watch the markets. You have to know exactly what you are about to do, what timeframes to analyze and what markets you stick yourself to, at any given day.<\/p>\n<p>With all that, you are a step closer to becoming a real <strong>Professional Trader<\/strong>. FTMO is here, by your side.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Although trading is often portrayed as an easy job that you can do from your phone or laptop on the beach, this couldn&#8217;t be far from the truth. If you truly want to become a Professional Trader, there is a long and hard journey you have to take. In this comprehensive article, we are going [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":406562,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/394352"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=394352"}],"version-history":[{"count":24,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/394352\/revisions"}],"predecessor-version":[{"id":611909,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/394352\/revisions\/611909"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/406562"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=394352"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=394352"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=394352"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}