{"id":395310,"date":"2020-10-09T11:20:33","date_gmt":"2020-10-09T09:20:33","guid":{"rendered":"https:\/\/ftmo.com\/?p=395310"},"modified":"2022-01-11T17:54:45","modified_gmt":"2022-01-11T16:54:45","slug":"how-to-think-in-probabilities","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/how-to-think-in-probabilities\/","title":{"rendered":"How to think in probabilities"},"content":{"rendered":"<p><em>Are you getting caught up by your emotions in trading? That is one of the reasons to start trading with a mechanical edge based on statistics! In this article, we will look at how you can start thinking and trading in probabilities!<\/em><\/p>\n<h2>How to think in probabilities<\/h2>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/09\/Statapp1-2.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-395312 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/09\/Statapp1-2.png\" alt=\"\" width=\"1030\" height=\"863\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/09\/Statapp1-2.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/09\/Statapp1-2-300x251.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/09\/Statapp1-2-768x643.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/09\/Statapp1-2-705x591.png 705w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/a><\/p>\n<p>When uncertainty is involved in a game, it’s called a game of chance. We all know popular games such as Poker, Roulette, BlackJack etc.<\/p>\n<div class=\"entry-content-wrapper clearfix standard-content\">\n<div class=\"entry-content\">\n<p>Now, a game of chance is boring without any stakes, right? In a game of chance, people may put bets. A game which rewards or punishes based on chance is now a GAMBLE.<\/p>\n<p>Gambling is fun. Gamblers enjoy a roller-coaster of emotions. Experiencing pain makes the gambler FEAR the outcome of loss. Winning makes them GREEDY for the dopamine rush. Adrenaline is their catalyst for excitement. He will be committed to injure himself to get even the slightest drop of happiness. What a great drug. Gambling is not only fun, but also dangerous.<\/p>\n<p>What is the deal with trading now? You see, trading involves uncertain outcomes, and it involves bets. Shouldn’t we classify trading as gambling? I do not disagree with this statement. Trading will undoubtedly incite the same emotions as if you went into a casino and there will be people who will purely trade for the excitement.<\/p>\n<p>However, some people decide to consistently make money in these games. The only difference? These people possess a <strong>statistical edge <\/strong>and follow strict <strong>risk management. <\/strong>These people evolve from gamblers to traders.<\/p>\n<h2>Statistical Edge<\/h2>\n<p>A statistical edge is the player’s advantage in a game of chance. If you have an edge, you will always come out on top in the long run.<\/p>\n<p>Take a <strong>rigged coin<\/strong> for example. It will drop 51 % of the time in your favour (heads) and 49% of the time in your opponent’s favour (tails). Every time you win, your opponent pays you $1. Every time you lose, you pay your opponent $1.<\/p>\n<p>The rules of this game are set. A game of chance should always give you these parameters: <em>a probability of winning, a probability of losing, payout for winning, punishment for losing.<\/em><\/p>\n<p>The probability of winning is 51%, hence the probability of losing is 49% (100% – 51%). Payout for winning is $1 and punishment for losing is $1 as well.<\/p>\n<p>With these parameters, we will calculate the <strong>expectancy<\/strong>, which will determine whether you do possess a statistical edge, or not.<\/p>\n<p>We toss the coin 100 times. In theory, heads will drop 51 times and tails will drop 49 times. In other words, we win $51 and lose $49, hence making a $2 profit ($51- $49). We tossed the coin 100 times; therefore we were risking $100 overall. As a result, we made $2. To calculate the expectancy, you simply take your profit\/loss and divide it by the amount you risked through the whole game. For this example, we take $2 divided by $100 and we get $.02.<\/p>\n<p>0.02 is our expectancy and what it means is that for every $1 we risk, we should make $0.02.<\/p>\n<p><strong>IF THE EXPECTANCY IS GREATER THAN 0, YOU POSSESS A STATISTICAL EDGE AND YOU SHOULD MAKE MONEY IN THE LONG TERM.<\/strong><\/p>\n<p>0.02 is greater than 0, hence the player who wins the coin game 51% of the time will make money in the long run.<\/p>\n<p>A trading system basically has the same parameters. We will simply call the probability of winning a <strong>win rate<\/strong>. Then we have the average<strong> Reward to Risk Ratio (RRR)<\/strong>. This is calculated by taking the average profit divided by the average loss of your trades.<\/p>\n<p>Let us assume a system that wins 40% of the time and has a RRR of 2. A RRR of 2 means that when you win, you win twice as much as when you lose. We risk 1R on every trade (R is a fixed amount of risk). When we win, we make 2R. Out of 100 trades, we should theoretically win 40 trades and lose 60 trades. So what is our expectancy? We win 40 trades with a reward of 2R, hence we make 80R. We lose 60 trades, incurring a loss of 60R. At the end of 100 trades, we make 80R and lose 60R, thus being 20R in profit. Over 100 trades we risked 100R but made 20R in profit. Expectancy again is the amount gained divided by the amount risked. Therefore, 20R\/ 100R = 0.2, so for every $1 we risk on a trade you earn $0.2 on average. The expectancy is greater than 0, so this strategy will make you money.<\/p>\n<h2>Risk Management<\/h2>\n<p>A winning strategy is not enough if you do not follow strict risk management. I like to tell myself that a trading strategy is just a tool, but what makes you money is your risk management. If you bet a little you win a little, if you bet a lot, you win a lot, but if you bet too much, you crash. You might have a good hand in Poker, but if you go all in, you risk losing the game.<\/p>\n<p><strong>TRADING IS A SURVIVAL GAME. THOSE WHO PROTECT THEIR CAPITAL STAY IN THE GAME TO PLAY ANOTHER DAY.<\/strong><\/p>\n<p>There are several ways to manage risk:<\/p>\n<p>MARTINGALE<\/p>\n<p>FIXED ABSOLUTE RISK<\/p>\n<p>FIXED POSITION SIZE<\/p>\n<p>FIXED RELATIVE CAPITAL RISK<\/p>\n<p>In later articles, we will discuss each of these money management strategies. I personally like using FIXED RELATIVE CAPITAL RISK MANAGEMENT. The only reason is that for me it provides stable parameters for advanced risk management techniques, but I do not discriminate against these other strategies.<\/p>\n<h2>Trading with a Statistical Edge<\/h2>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-311493\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/3438-1030x687.jpg\" alt=\"\" width=\"1030\" height=\"687\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/3438-1030x687.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/3438-300x200.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/3438-768x512.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/3438-1500x1001.jpg 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/3438-705x470.jpg 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/3438-450x300.jpg 450w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<p>While many traders back-test and document their trades to check the viability of the trading system, there is a tremendous benefit in tracking and using the data to optimize both your stop loss and profit target. When documenting trades, two of the most important pieces of data that I record is the drawdown and the profit potential.<\/p>\n<p>To be clear, the drawdown is how far a trade goes against my position before going in my favour.<\/p>\n<p>Whereas the profit potential is the maximum distance the trade moves in my favour, from my entry. It is not necessary and in fact is rarely, where I exit the trade. But certainly, getting out at the extreme of the move, or as close to it as possible, is the goal.<\/p>\n<p>I document my trades two ways first, I use screenshots of the charts themselves where I annotate my entry, the time, the trade type and any other relevant information pertaining to my methodology such as strength and weakness analysis, multiple time frame analysis as well as correlation. I also record the drawdown and the profit potential of the trade on the chart.<\/p>\n<p>I then enter the key data into my excel spreadsheet.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-311508\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-excel-1030x512.png\" alt=\"\" width=\"1030\" height=\"512\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-excel-1030x512.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-excel-300x149.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-excel-768x382.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-excel-1500x745.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-excel-705x350.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-excel-450x224.png 450w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-excel.png 1602w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<p>This includes the date, day, session, pair, time, direction, entry price, close price, set-up type, entry type, exit type, drawdown, profit potential and result. I then let excel do all the heavy lifting for me as I can then sort my trades multiple ways, by day, by session, by pair, by direction, by set-up type etc.<\/p>\n<p>But where the cool stuff is under the tab <strong>&#8220;Mind-blowing stats&#8221;<\/strong> where I have statistics filterable by any of the above which will allow me to optimize both my stop loss and my profit target.<\/p>\n<p>The application is discussed below.<\/p>\n<p>If you use an account risk % to determine your position size (as you should), then the smaller the stop, the larger a position size you can trade. However, the stop must have a high probability of holding. The most trading books, manual, video&#8217;s etc., advise that your stop should be several pips beyond a recent swing high\/low.<\/p>\n<p>However, my trade documentation has allowed me to come up with a statistical edge for my stop placement.<\/p>\n<p>As it can be seen in attachment &#8220;Drawdown&#8221;, trading my Type 1 BO (breakout out) on GBPAUD, 79.55% of the time my drawdown has been less than 25 pips, whereas it is only 81.82% at 30 pips and 84.09% at 35 pips.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-311497\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-Drawdown-1030x486.png\" alt=\"\" width=\"1030\" height=\"486\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-Drawdown-1030x486.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-Drawdown-300x142.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-Drawdown-768x362.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-Drawdown-705x333.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-Drawdown-450x212.png 450w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-Drawdown.png 1344w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<p>So, while using a larger stop may prevent an extra loss or 2, the benefit of having a larger position size and therefore netting more money makes the extra loss(es) inconsequential.<\/p>\n<p>Similarly, the profit target can be optimized as well.<\/p>\n<p>Looking at the attachment &#8220;Profit Potential&#8221; and again staying with my Type 1 BO trades on GBPAUD, we can easily see that almost 80% of the time, these trades get between 20 and 30 pips.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-311503\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-Profit-potential-1030x379.png\" alt=\"\" width=\"1030\" height=\"379\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-Profit-potential-1030x379.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-Profit-potential-300x110.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-Profit-potential-768x283.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-Profit-potential-705x260.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-Profit-potential-450x166.png 450w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/04\/1583274736-Profit-potential.png 1336w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<p>This is a great place to take 1\/2 of the position off and move the stop to flat. We can then let the remaining half run to about 50 pips where 59.09% of the trades reach.<\/p>\n<p>Obviously, market conditions are not always the same but if you can identify when they are, i.e. correlated move or certain groups (commodity pairs or safe haven pairs) strengthening or weakening, then you can make an informed decision on how far a trade may run.<\/p>\n<p>Initial activity occurs when the market opens outside of the previous day´s range. The goal of this analysis is to define the probability of the gap between the currently open and the previous high\/low being closed.<\/p>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Are you getting caught up by your emotions in trading? That is one of the reasons to start trading with a mechanical edge based on statistics! In this article, we will look at how you can start thinking and trading in probabilities! How to think in probabilities When uncertainty is involved in a game, it’s [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":406617,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/395310"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=395310"}],"version-history":[{"count":26,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/395310\/revisions"}],"predecessor-version":[{"id":567036,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/395310\/revisions\/567036"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/406617"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=395310"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=395310"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=395310"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}