{"id":398263,"date":"2020-12-23T09:46:22","date_gmt":"2020-12-23T08:46:22","guid":{"rendered":"https:\/\/ftmo.com\/?p=398263"},"modified":"2022-01-11T17:46:06","modified_gmt":"2022-01-11T16:46:06","slug":"the-christmas-edition-our-new-ftmo-traders","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/the-christmas-edition-our-new-ftmo-traders\/","title":{"rendered":"The Christmas edition &#8211; our new FTMO Traders"},"content":{"rendered":"<p><em>The festive season is in full swing and we are quite sure that these five traders have a good extra reason to celebrate this year. Why? Because they are joining our FTMO proprietary trading firm as they passed the evaluation process. In this article, we asked them some questions about their journey.<\/em><\/p>\n<h3>Trader Corey &#8211; <em>&#8220;Passing the Challenge felt like a huge victory, but passing Verification was an absolute thrill because at that point the reality hits &#8211; that you&#8217;ve actually done it, you&#8217;re going to be funded.&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/coreyp.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-398264\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/coreyp-225x300.jpeg\" alt=\"\" width=\"225\" height=\"300\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/coreyp-225x300.jpeg 225w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/coreyp-773x1030.jpeg 773w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/coreyp-768x1024.jpeg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/coreyp-1152x1536.jpeg 1152w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/coreyp-1125x1500.jpeg 1125w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/coreyp-529x705.jpeg 529w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/coreyp.jpeg 1536w\" sizes=\"(max-width: 225px) 100vw, 225px\" \/><\/a><\/p>\n<p><strong>Where have you learnt about FTMO?<\/strong><\/p>\n<p>I first came across FTMO on Instagram. I followed many traders when I was new to this kind of trading to try and piece together what they were doing and I noticed a few screenshots of FTMO Challenge Certificates here and there, so I decided to take a look for myself and here we are.<\/p>\n<p><strong>How did Maximum loss limits affect your trading style?<\/strong><\/p>\n<p>The Maximum loss limit set by FTMO in this challenge is a natural level. Beyond 10% down is extremely hard to come back from not only financially, but especially mentally. All traders should strive to abide by these guidelines at all times. Risk management will always be the #1 priority of a professional trader and the biggest determinant of long term success.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>The outcome of any ONE trade is ultimately random. To be successful in these markets you must first have an edge and take a &#8216;series of trades&#8217; approach. This means that when placing the trades according to your rules, the first two or three trades might be losses. But by the time you&#8217;ve taken 10 trades, you should be in the green. This will be the result of proper risk management and executing with a solid R:R.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/coreym.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-398267\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/coreym.png\" alt=\"\" width=\"933\" height=\"885\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/coreym.png 933w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/coreym-300x285.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/coreym-768x728.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/coreym-705x669.png 705w\" sizes=\"(max-width: 933px) 100vw, 933px\" \/><\/a><\/p>\n<p><strong>How does passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>Passing the Challenge felt like a huge victory, but passing Verification was an absolute thrill because at that point the reality hits &#8211; that you&#8217;ve actually done it, you&#8217;re going to be funded. It was one of those special moments in my life &#8211; Something that is the culmination of so many years of frustration, loss, hopelessness&#8230;to finally piece together a strategy that you think gives you an edge, but to then prove it twice over consecutive tests is very special. Passing the testing gives you a new zest for life, that if you can do this you can do anything. If I can pass once, I can pass again and again. I am looking forward to continued refinement of my approach and processes with the added accountability that being with FTMO will provide. I now have the opportunity to make a living doing what I am most passionate about, for this is I am truly grateful.<\/p>\n<p><strong>What do you think is the key for long term success in trading?<\/strong><\/p>\n<p>I am a strong believer that if you want excellence in your trading results, you must resonate on excellence in all areas of your life. Because Risk Management is so crucial to the success of a trader, you must be able to make the choice to do the right thing. This cannot just be when you&#8217;re trading. Your internal dialogue in relation to EVERYTHING must be you making the choice to do the right thing. If you start to slip in your quality of choices elsewhere eg poor diet, missing gym sessions, then you are likely to slip in your trading too. You cannot be one person out there, and be another person in front of the charts. In technical terms &#8211; You must have an edge. No way around it. You must be able to execute according to your rules and you must know how to manage your risk. I also believe that you must be able to &#8216;let go&#8217; mentally so you can execute according to your plan and let winning trades play out. You cannot force profit, you must give yourself the opportunity over and over again in circumstances where probability is in your favour and let the profit come to you. Trust and Faith play such a vital role. I couldn’t have passed without my faith. You must know what you want to achieve and where you are going. To get there efficiently you must train your subconscious mind to resonate on the level your goal resides on. I found visualisation very helpful &#8211; holding in mind the end closing balance to pass the challenge. By doing this, my mind was in a state to find opportunities and act according to my rules. As a general rule, most of us know what to do, but if we do not act according to this knowledge it is because of our mental state. If your mental state isn’t where it needs to be then you must change your input. We are who we are and where we are because of what we let into our minds. Change who and what you listen to and what your results transform. Finally, you must maintain order and balance in your life as this creates the stability required to achieve greatness. Our foundational base will always stem from the state of affairs with the people closest to us &#8211; Family, friends and partner. Keep them in good stead and avoid drama. Next, ensure your health is on track and your finances are in order. As you continue to peel back the layers of typical forms of day to day stress, you find yourself in the environment which is likely to facilitate success.<\/p>\n<p><strong>One piece of advice for people starting the FTMO Challenge now.<\/strong><\/p>\n<p>Decide now whether you are going to scalp or swing. You can pass either way but if you are somewhere in the middle, your chances are slim. Scalpers, less is more. Take your consistent profits and don&#8217;t give them back to the market. Swing traders, also less is more &#8211; Be selective. Have the faith and courage to let your winners run. I could&#8217;ve passed the test much easier and sooner had I let a few of my winning trades play out a bit longer. Don&#8217;t try to be a hero. Make sure you are measured in your position size and do not add to a losing position. Set your SL &amp; TP early, especially before going to bed when you hold a position overnight. Keep in mind at all times what you want to achieve. Visualize that passing figure being in your balance line. This will train your subconscious mind to then go and act in accordance with the achievement of that picture in your mind. Believe that it&#8217;s possible first. Always remember, winners are not people who never fail, but people who never quit.<\/p>\n<h3>Trader Andrew &#8211; <em>&#8220;I personally believe the key for long term success in trading is to stick to your profitable strategy and trading plan.&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewp.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-398270\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewp-240x300.jpeg\" alt=\"\" width=\"240\" height=\"300\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewp-240x300.jpeg 240w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewp-824x1030.jpeg 824w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewp-768x960.jpeg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewp-1229x1536.jpeg 1229w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewp-1200x1500.jpeg 1200w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewp-564x705.jpeg 564w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewp.jpeg 1440w\" sizes=\"(max-width: 240px) 100vw, 240px\" \/><\/a><\/p>\n<p><strong>What do you think is the key for long term success in trading?<\/strong><\/p>\n<p>I personally believe the key for long term success in trading is to stick to your profitable strategy and trading plan. As long as you have consistently backtested the strategy and are confident that it is profitable then you shouldn’t ever have to stray away from your own personal style of trading. I also believe that having a strong mental resilience towards trading is a must have, purely just to survive in the markets. It’s very easy to get distracted or to have FOMO and if you can eliminate these factors that can cause you to be at a loss then that’s the first step towards being profitable. I believe the first step to becoming successful at trading is to learn how to survive in the markets before thinking about making any huge profits.<\/p>\n<p><strong>Where have you learnt about FTMO?<\/strong><\/p>\n<p>I first became aware of FTMO from YouTube, I was doing research on a trading community and the mentor had mentioned that a few members were looking to become FTMO funded by the end of the year. I’d never heard of this before so I did my research and honestly thought the company was too good to be true. A lot of traders are excellent traders however don’t have the capital to be risking a safe percentage and FTMO allows good traders to do that and grow the account.<\/p>\n<p><strong>What was the most difficult during your FTMO Challenge or Verification and how did you overcome it?<\/strong><\/p>\n<p>Firstly I believe the challenge was slightly more difficult than the verification just due to the timeframe and target that you had to hit for the challenge, however, I believe the most difficult element of both the challenge and the verification was knowing why you had a target to reach. It’s easy to trade and stick to your plan but as soon as you have a target you can easily become fixated on reaching the target which can lead to rushed entries, forcing bigger R on trades and overall becoming slightly reckless.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewm.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-398273\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewm.png\" alt=\"\" width=\"920\" height=\"892\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewm.png 920w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewm-300x291.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewm-768x745.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewm-36x36.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/andrewm-705x684.png 705w\" sizes=\"(max-width: 920px) 100vw, 920px\" \/><\/a><\/p>\n<p><strong>What was easier than expected during the FTMO Challenge or Verification?<\/strong><\/p>\n<p>I personally thought that it would take me longer than a few weeks to reach 10% on the challenge however once I eliminated the idea of having a target and just stuck to my plan, I had hit the target before I knew it and I believe that’s how every trader should approach the challenge.<\/p>\n<p><strong>How did Maximum loss limits affect your trading style?<\/strong><\/p>\n<p>Honestly, I didn’t pay too much attention to the maximum loss as I knew that I would only risk 1% per trade and if I had lost two trades in a week then I would stop trading until the next week. I guess through learning and studying trading over the past year it’s taught me to protect my capital and not go into that much drawdown at any cost.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>If you’re a serious trader or even a trader who isn’t as experienced but wants to become a professional trader like I was, then I would completely recommend going for the FTMO challenge. If you don’t feel you’re ready with your current progress then join a trading community where you can learn from others which can help speed up your learning curve and set the FTMO challenge as a target for you to reach. In terms of how to approach the challenge, my most honest tip is not to forget about the target but just to put it to one side and stick to your trading plan. You should have the confidence that your plan is profitable from backtesting so stick to what you know and before you know it you’ll have reached the target, and if not then it’s not the end of the world, just go back to the drawing board, refine your skills and try again.<\/p>\n<h3>Trader Jamie &#8211; <em>&#8220;Don&#8217;t be afraid to take the leap.&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiep-scaled.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-398276\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiep-225x300.jpg\" alt=\"\" width=\"225\" height=\"300\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiep-225x300.jpg 225w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiep-773x1030.jpg 773w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiep-768x1024.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiep-1152x1536.jpg 1152w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiep-1536x2048.jpg 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiep-1125x1500.jpg 1125w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiep-529x705.jpg 529w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiep-scaled.jpg 1920w\" sizes=\"(max-width: 225px) 100vw, 225px\" \/><\/a><\/p>\n<p><strong>What do you think is the key for long term success in trading?<\/strong><\/p>\n<p>Patience and Mindset.<\/p>\n<p><strong>What was the most difficult during your FTMO Challenge or Verification and how did you overcome it?<\/strong><\/p>\n<p>Mindset was the hardest, wanting to achieve everything quickly and micro managing trades too much \/ over trading. I overcame this through books like trading in the zone and trusting my analysis to do what I initially set it up to do. Also knowing that this opportunity could potentially change the rest of my life was a major reason in working hard on the discipline\/ fomo side of things.<\/p>\n<p><strong>Describe your best trade.<\/strong><\/p>\n<p>My best trade was EURUSD. It reached an area of interest in a sell to buy scenario and played out perfectly.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiem.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-398279\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiem.png\" alt=\"\" width=\"916\" height=\"894\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiem.png 916w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiem-300x293.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiem-768x750.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiem-36x36.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/jamiem-705x688.png 705w\" sizes=\"(max-width: 916px) 100vw, 916px\" \/><\/a><\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>I use a specific strategy which is based on Smart money concepts as opposed to the traditional way of retail trading, although this gives a slight balance of losing more than I win the stops are tighter and produce a much higher risk to reward ratio.<\/p>\n<p><strong>What was easier than expected during the FTMO Challenge or Verification?<\/strong><\/p>\n<p>The 5% verification target given due to the timescale to be able to achieve it. After hitting 10% over 30 days the 5% in my mindset was a given as it was half the target over double the time so my confidence was sky high in regards to hitting this.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>Don&#8217;t be afraid to take the leap, have faith in your trading plan and use the tools FTMO give you like the trading diary, successful pairs etc. This will be truly life changing once achieved.<\/p>\n<h3>Trader <span class=\"kt-header__topbar-username kt-visible-desktop\">Abdirahman &#8211; <em>&#8220;In trading, luck is not something I believe in.&#8221;<\/em><\/span><a id=\"header_abv\" class=\"kt-media kt-media--success\" href=\"https:\/\/trader.ftmo.com\/metrix\/2090622232#\"><\/a><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/Abdirahmanp.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-398282\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/Abdirahmanp-243x300.jpg\" alt=\"\" width=\"243\" height=\"300\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/Abdirahmanp-243x300.jpg 243w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/Abdirahmanp-768x950.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/Abdirahmanp-570x705.jpg 570w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/Abdirahmanp.jpg 828w\" sizes=\"(max-width: 243px) 100vw, 243px\" \/><\/a><\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p>I think the hardest obstacle is doing analysis and finding out the trade goes in the wrong direction.<\/p>\n<p><strong>What do you think is the most important characteristic\/attribute to become a profitable trader?<\/strong><\/p>\n<p>The most important attributes are knowledge and risk management. I listed knowledge first because you need to learn before you can manage the risks you are taking.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>In trading, luck is not something I believe in. To be a successful trader, you should rely on your analysis and risk management because luck does not exist in the traders&#8217; world.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/Abdirahmanm.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-398285 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/Abdirahmanm.png\" alt=\"\" width=\"915\" height=\"878\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/Abdirahmanm.png 915w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/Abdirahmanm-300x288.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/Abdirahmanm-768x737.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/Abdirahmanm-36x36.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/Abdirahmanm-705x676.png 705w\" sizes=\"(max-width: 915px) 100vw, 915px\" \/><\/a><\/p>\n<p><strong>Describe your best trade.<\/strong><\/p>\n<p>The best trade was the USDMXN because that trade pulled my account from a negative net to a positive net within hours. It was also the trade that helped me complete my verification process.<\/p>\n<p><strong>How does your risk management plan look like?<\/strong><\/p>\n<p>I plan for a max loss of $2,000 daily and in case of stop loss is reached, I will not add new trade until the next day. I plan not to take more than 5 lot sizes of 1 with a stop loss of 40 pips or 4 lot sizes of 1 with a stop loss of 50 pips. And I plan to not trade more than 3 pairs at once.<\/p>\n<p><strong>What is the number one advice you would give to a new trader?<\/strong><\/p>\n<p>Believe in and trust your analysis.<\/p>\n<h3>Trader Herve &#8211; &#8220;Your stop loss is there to protect you.&#8221;<\/h3>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervep.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-398288\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervep-169x300.jpg\" alt=\"\" width=\"169\" height=\"300\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervep-169x300.jpg 169w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervep-579x1030.jpg 579w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervep-768x1365.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervep-864x1536.jpg 864w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervep-844x1500.jpg 844w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervep-397x705.jpg 397w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervep.jpg 1080w\" sizes=\"(max-width: 169px) 100vw, 169px\" \/><\/a><\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>Yes. Its a wedge strategy in conjunction with pitchforks and incomplete harmonic patterns. There is a 3-5 pip stop loss and a 20 pip take profit. Nothing is guaranteed in the market so sometimes I will take an 18 pip TP or even 15. The goal is to reach 20 pips and take out 80% and let it ride depending on the TP1 set by the wedge.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>I also use a tool called harmonic wave convergence to eliminate luck.<\/p>\n<p><strong>What was the most difficult during your FTMO Challenge or Verification and how did you overcome it?<\/strong><\/p>\n<p>The challenge is fair. The most difficult thing is overcoming my own ego. When the market is turning against me, I can&#8217;t will it back to my direction. Respect the market and take what it will give you.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervem.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-398291\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervem.png\" alt=\"\" width=\"926\" height=\"898\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervem.png 926w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervem-300x291.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervem-768x745.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervem-36x36.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/12\/hervem-705x684.png 705w\" sizes=\"(max-width: 926px) 100vw, 926px\" \/><\/a><\/p>\n<p><strong>How would you rate your experience with FTMO?<\/strong><\/p>\n<p>Excellent. Best compounding leverage idea I&#8217;ve ever witnessed in my life.<\/p>\n<p><strong>What was more difficult than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p>The math. A 2% sl for $50,000 is $1,000. So the risk is small but it&#8217;s actually huge because the allowed loss per day is $2,500. So in one day, 3 trades with a 2% sl will disqualify you. What I had to do was change the risk to equal 1% &#8211; 1.5% per trade. If 3\/3 trades go against me, I have to stop and try again tomorrow. 1 trade at 20+ pips will heal the wounds of 3 loses at 3-5 pips. The math has to work in my favor.<\/p>\n<p><strong>What is the number one advice you would give to a new trader?<\/strong><\/p>\n<p>Your stop loss is there to protect you. Make sure you are aware of your stop loss before you consider your take profit. Don&#8217;t fight your stop loss. Let it work for you. Don&#8217;t move it either. Let it regulate your lot size and where you enter the market.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The festive season is in full swing and we are quite sure that these five traders have a good extra reason to celebrate this year. Why? Because they are joining our FTMO proprietary trading firm as they passed the evaluation process. In this article, we asked them some questions about their journey. Trader Corey &#8211; [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":406727,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[672],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/398263"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=398263"}],"version-history":[{"count":5,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/398263\/revisions"}],"predecessor-version":[{"id":541649,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/398263\/revisions\/541649"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/406727"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=398263"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=398263"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=398263"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}