{"id":398799,"date":"2021-01-13T12:21:13","date_gmt":"2021-01-13T11:21:13","guid":{"rendered":"https:\/\/ftmo.com\/?p=398799"},"modified":"2024-01-19T17:00:00","modified_gmt":"2024-01-19T16:00:00","slug":"scam-alert","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/scam-alert\/","title":{"rendered":"Scam Alert"},"content":{"rendered":"<p><em>People can easily get trapped by individuals giving fake promises or luring them into exciting and unrealistic results. In this article, we will show you what you should thoroughly watch out for and be aware of. It would be a shame to have high hopes ruined by someone with unclear intentions. FTMO is getting more and more popular, and that is especially because of you, our traders. Unfortunately, this also brings some negative aspects to our business. Let&#8217;s have a look at the most common trading-related scams you might find online.<\/em><\/p>\n<h2>Account management<\/h2>\n<p>This service is mostly offered by private message. You will get approached by someone who claims that he\/she is an excellent trader, and if you want to complete the entire evaluation process, he will take care of that and also your FTMO Account.<\/p>\n<p>Everything will be done, and you won&#8217;t even lift a finger, and the only thing that will bother you is counting the packs of money.  The message will also include many images of huge profits, countless withdrawals, and other things that will support these lies.<\/p>\n<p>This service will cost you hundreds of dollars (depending on the account contract&#8217;s size) plus the fee for FTMO Challenge. This would be the initial investment, and then he would take some share from the profit split for the monthly payout. So, instead of having a Profit Split from FTMO with up to 90%, you would eventually have half of it.<\/p>\n<p><strong>Everything sounds great. Right? <\/strong><\/p>\n<p>Unfortunately, we never found any service that would be successful from our profound internal and external research. Those services always follow the same scenario, and in just a few days, you will see a rule violation in your account. The provider will stop communicating with you, block you on social networks, and enjoy the earned money you sent him for his scam promise. Instead of the promised profits from FTMO Account, you have just blown away your own $1,000, and the scammer just did fake business.<\/p>\n<p>Also bear in mind that the maximum allocation with FTMO is $400,000. This means that any violation of this rule can be easily detected by our trading department.<\/p>\n<h2>Fake accounts on the social media network<\/h2>\n<p>Some of you may have noticed that there are occasional comments below our posts that contain information about Bitcoin wallets and promise numerous appreciations of the deposit. If you click on the users who posted these comments, you will see a recently created profile that tries to copy the official FTMO profile with great accuracy. This profile has only a few followers compared to the official FTMO profile.<\/p>\n<p>Be careful on social media as well. All FTMO&#8217;s official accounts on Facebook, Instagram, and Twitter are verified. You can easily see this thanks to the blue check mark next to the profile name.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-538136 size-large\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/01\/XX-1030x486.jpg\" alt=\"\" width=\"1030\" height=\"486\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/01\/XX-1030x486.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/01\/XX-300x141.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/01\/XX-768x362.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/01\/XX-1536x724.jpg 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/01\/XX-2048x966.jpg 2048w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/01\/XX-1500x707.jpg 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/01\/XX-705x332.jpg 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/01\/XX-24x11.jpg 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/01\/XX-36x17.jpg 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/01\/XX-48x23.jpg 48w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<h2>Phishing<\/h2>\n<p>Phishing is another common practice where fraudsters try to misuse the good name of our company to get your money or sensitive data. This is a form of a fraudulent email that pretends to be coming from our company, but its main target is most likely your sensitive data, such as credit card details or passwords for online banking or even your trading account or FTMO Client Area login details.<\/p>\n<p>The scammer sending the email can then resell the data or use it himself to extort funds directly from you through blackmail. If the attacker manages to convince you to enter your login details on a fake site or install a fraudulent app from the email on your mobile, he or she can get through two-factor SMS authentication and steal money from your account.<\/p>\n<p>A phishing email has only a generic salutation, often informal. In the past, poor grammar was a common feature of phishing emails and scam sites, but that’s no longer true today as scams are getting more and more sophisticated. It&#8217;s spam that&#8217;s unsolicited and unexpected, trying to attract your attention with its urgency (so the attackers can put you under time pressure) or an overly attractive offer (a low or no price for a product, seemingly winning a lottery).<\/p>\n<p>For example, we have registered a fake offer claiming that FTMO was opening up the possibility to invest in selected traders. If there was such an offer, you would have found out about it on our website and FTMO&#8217;s official social media channels.<\/p>\n<p>What should raise your attention is a suspicious email address or domain from which the email comes or a link in the body of the email that does not lead to the domain of the company, but to some unsecured site (using the HTTP protocol instead of secure HTTPS). If you receive anything from FTMO, it will always be sent from official company emails only, anything that comes from other addresses than @ftmo.com should be handled very carefully. If there is a link in the email to some unfamiliar website (anything else than https:\/\/ftmo.com\/ or https:\/\/trader.ftmo.com), do not click on it. If you are unsure, feel free to contact our support team, and we will help you verify whether the message was actually sent by one of our colleagues.<br \/>\nThe problem with today&#8217;s phishing messages is that they are increasingly sophisticated and difficult to distinguish from regular, legitimate communication. At the same time, even fake sites are getting better looking and often indistinguishable from the company&#8217;s original site.<\/p>\n<p>Still, a reputable institution will not require you to enter passwords or other sensitive information directly into an email and will not link you to an insecure web address. So do your best to avoid such things. Anyone who wants to feel safe should have a good antivirus program installed and it is highly recommended to browse the internet only with the antivirus turned on.<\/p>\n<h2>Courses and EA ready to meet the FTMO Challenge<\/h2>\n<p>As the last in this scam alert selection, we will highlight courses and robots specially prepared to complete the FTMO Challenge. There are no guarantees or one unique way of trading!<\/p>\n<p>Everyone has their approach to trade, with mixed feelings for the market, different perceptions of risk, diverse psychological settings, etc. In trading, no shortcut will make you a millionaire in a few days. Many things need to be &#8220;sat down&#8221; and tried properly.<\/p>\n<p>If someone teaches you their strategy and you find out that the trading system will suit you in all directions, you will still not achieve the same results as your teacher. You evaluate each situation a little differently, and only thanks to that, the work cannot be the same.<\/p>\n<p>This does not have any negative correlation, you can easily be better than your teacher in the end, but it will cost some time and effort.<\/p>\n<p>Please don&#8217;t take it that all mentors do their job poorly. Certainly not, but if someone tells you that their course is precisely tailored to the FTMO Challenge and after completing it, you will meet the FTMO Challenge 100%, be very careful!<\/p>\n<p>Even worse are automatic strategies (EA), which promise you such results. In this case, the possibility of positive influence in your trading is pretty much zero. If we consider the current market conditions, where unexpected things happen more often than usual, it is almost unreal for someone to program algorithms that won&#8217;t make mistakes.<\/p>\n<h2>Conclusion<\/h2>\n<p>Don&#8217;t try to find career shortcuts that don&#8217;t exist. In trading, one of the most beautiful things is freedom and responsibility only for oneself. If you go wrong with trading, you know it&#8217;s your fault, and you can work on it. Once you eliminate a mistake, you don&#8217;t have to make it for the rest of your life. If you transfer responsibility to someone else, you can&#8217;t work with bugs.<\/p>\n<p>We are sorry that many people are trying to damage the FTMO brand and offer services that only lead to the loss of considerable sums of money. Be careful which services you use.<\/p>\n<p>If FTMO needs to contact you, it is always from our website&#8217;s official communication channels!<\/p>\n<p>Check if the email contains @ftmo.com and check the profiles on social networks if they are genuine FTMO profiles or only imitations.<\/p>\n<p>Not sure if it was an official contact? Do not hesitate to contact our FTMO Support Team, which is at your disposal.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>People can easily get trapped by individuals giving fake promises or luring them into exciting and unrealistic results. In this article, we will show you what you should thoroughly watch out for and be aware of. It would be a shame to have high hopes ruined by someone with unclear intentions. FTMO is getting more [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":408638,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[4809,670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/398799"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=398799"}],"version-history":[{"count":14,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/398799\/revisions"}],"predecessor-version":[{"id":604757,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/398799\/revisions\/604757"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/408638"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=398799"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=398799"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=398799"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}