{"id":403622,"date":"2021-05-28T17:36:56","date_gmt":"2021-05-28T15:36:56","guid":{"rendered":"https:\/\/ftmo.com\/?p=403622"},"modified":"2021-08-27T10:43:55","modified_gmt":"2021-08-27T08:43:55","slug":"fomo-the-fear-of-missing-out","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/fomo-the-fear-of-missing-out\/","title":{"rendered":"FOMO – The Fear Of Missing Out"},"content":{"rendered":"<p><em>Are you familiar with FOMO? What it is, how is it related to trading and more importantly how it can be overcome? This is what we cover in our new article.<\/em><\/p>\n<p>&nbsp;<\/p>\n<p><a class=\"lightbox-added aligncenter\" href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/05\/FOMOCZ.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-402796\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/05\/FOMOCZ.png\" sizes=\"(max-width: 2481px) 100vw, 2481px\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/05\/FOMOCZ.png 2481w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/05\/FOMOCZ-300x141.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/05\/FOMOCZ-1030x486.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/05\/FOMOCZ-768x362.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/05\/FOMOCZ-1536x724.png 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/05\/FOMOCZ-2048x966.png 2048w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/05\/FOMOCZ-1500x707.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/05\/FOMOCZ-705x332.png 705w\" alt=\"\" width=\"2481\" height=\"1170\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<h2>What is FOMO and how does it affect you?<\/h2>\n<p>FOMO or “Fear of Missing out” has become a pretty common issue with a lot of traders and in fact, in day-to-day life as well. It has been reported that more than 60% of millennials are affected by the fear of missing out in some aspect of their lives. We live in a modern age of social media, which gives us unprecedented access to the lives of others. Thus it is only human nature to fear that we are missing out on something.<\/p>\n<p>FOMO in trading is the <i>fear of missing out<\/i> on big opportunities in the market, and it is not a rare phenomenon. It doesn’t really matter if you are a beginner or a professional trader, FOMO can affect everyone and anyone.<\/p>\n<p>This fear stems from the feeling that other traders are more successful, and it can cause overly high expectations, a lack of long-term perspective, lack of patience and overconfidence\/not enough confidence.<\/p>\n<p>The FOMO trader tends to enter trades without enough thought, or closing trades at bad moments because it’s what others seem to be doing. There is that need to follow the herd with a lack of research or lack of self-confidence. FOMO is an internal feeling, but one that can be impacted by a range of external factors.<\/p>\n<p>Some of the external factors that could lead to a trader experiencing FOMO are:<\/p>\n<p><strong>Volatile markets.<\/strong> Of course, when there is market movement in any direction – it can make us think about missing out on a great opportunity, right?<\/p>\n<p><strong>Big winning streaks.<\/strong> Winning streaks don’t last forever – stay humble.<\/p>\n<p><strong>Repetitive losses.<\/strong> Traders can end up in a vicious cycle; entering a position, getting scared, closing out, then re-entering another trade as anxiety and disappointment arise about not holding out. This can eventually lead to bigger losses.<\/p>\n<p><strong>News, rumours and social media.<\/strong> Be cautious as to who and what you will let influence your thought process and what you already know. Don’t take social media content at face value. Take your time, do your research, and evaluate every single piece of information.<\/p>\n<h2>So what are the main differences between FOMO trading and disciplined trading?<\/h2>\n<p>Disciplined traders have a plan, do the necessary research and analysis, set a comfortable risk-to-reward ratio, use sensible stop-loss and take-profit levels. They follow a plan, keep a log, and achieve their trading goals.<\/p>\n<p>And FOMO traders? They react compulsively, jump on trends, take opinion as fact, and follow rumours. Then they consider the upside and maximize exposure. They get into an uncomfortable situation because they enter a risky position and then panic, close out and do this again and again because they don’t have a plan, even in the case there is a plan, it is not always followed through. They don’t keep a log and for the above reasons FOMO takes over.<\/p>\n<h2>But can FOMO be overcome?<\/h2>\n<p>One of the essential components when it comes to the prevention of FOMO is greater self-awareness. Be self-aware, know who you are and which strategy suits you the best and fully understand the importance of discipline and risk management in trading.<\/p>\n<p>Concentrate on yourself, on your strategy, do your own research – you are unique and therefore your path to success is unique. Stay patient and calm. If you see others being successful, take this as an inspiration – you can be also successful in your own unique way. Don’t follow others, don’t pay too much attention to social media posts, just stay on your own individual path.<\/p>\n<p>If you believe in yourself, if you are self-aware and have a plan, you will be fine. When you have self-knowledge, you’re naturally calm and poised. Stick to your trading plan, do your research and keep a trading journal.<\/p>\n<p>Be patient, disciplined, and confident. If you think you’re unable to overcome FOMO, our FTMO performance coach can help you overcome this fear.<\/p>\n<p>And remember; what comes easy – won’t last and what lasts – won’t come easy.<\/p>\n<p>Believe that even if you don’t win today, sooner or later your win will come. Market opportunities will always be here for your next trade. Patience is the key to success.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Are you familiar with FOMO? What it is, how is it related to trading and more importantly how it can be overcome? This is what we cover in our new article. &nbsp; &nbsp; What is FOMO and how does it affect you? FOMO or “Fear of Missing out” has become a pretty common issue with a [&hellip;]<\/p>\n","protected":false},"author":31,"featured_media":405051,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[5184],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/403622"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/31"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=403622"}],"version-history":[{"count":4,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/403622\/revisions"}],"predecessor-version":[{"id":424229,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/403622\/revisions\/424229"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/405051"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=403622"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=403622"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=403622"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}