{"id":403601,"date":"2021-05-13T12:28:29","date_gmt":"2021-05-13T10:28:29","guid":{"rendered":"https:\/\/ftmo.com\/?p=403601"},"modified":"2021-08-16T11:23:50","modified_gmt":"2021-08-16T09:23:50","slug":"dont-risk-what-you-cant-afford-to-lose","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/dont-risk-what-you-cant-afford-to-lose\/","title":{"rendered":"Don’t risk what you can’t afford to lose"},"content":{"rendered":"<p><em>In this article, we explain the reasons why trading may become addictive and why traders might fall into situations that could potentially lead to a negative experience about trading. In addition, we focus on cases in which traders, in combination with different aspects of trading, can worsen their financial situation and how to avoid such financial setbacks. <\/em><\/p>\n<h2>Trading is a risky business<\/h2>\n<p>These days, a lot of people search for new ways of generating income. Many start to discover and learn about trading. While trading might seem to be an easy task at a first glance, however, it is evident that novice traders tend to rely only on the basic formula of buying low, selling high, or vice versa.<\/p>\n<p>Moreover, the urge to make some quick money is often amplified when someone’s financial situation is on the verge of instability.<\/p>\n<p>This often happens when people lose jobs that used to provide stable and secured income for their day-to-day expenses.<\/p>\n<p>Before we jump to many different theories, definitions and findings of this article, let us relax our minds and ask ourselves some critical questions that we can carry along on our trading journey or at least while reading this article.<\/p>\n<p>Ask yourself these questions and answer them in the most honest way possible.<\/p>\n<ul>\n<li>“What is my current financial situation?”<\/li>\n<li>“Do I have any debts?”<\/li>\n<li>“Does my financial situation allow me to start trading?”<\/li>\n<li>“If I lost my invested money, how much would it affect my life?”<\/li>\n<li>“How long can I sustain my living without any income?”<\/li>\n<\/ul>\n<p>FTMO Traders already know that trading is a very risky business as numerous factors can cause pressure on their psychology, thus affecting their profitability, discipline and decision-making processes.<\/p>\n<p>Those who have difficulties in handling emotions often neglect situations when markets are not in the trader’s favour and they may end up losing more than what they intend to, mainly due to poor preparation, risk management, and psychology.<\/p>\n<p>Additionally, since trading often involves leverage, profits or losses are being magnified, and for that reason trading can be dangerous when you are not fully aware and ready.<\/p>\n<p>&nbsp;<\/p>\n<p><a class=\"lightbox-added aligncenter\" href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/Trading-Crypto-and-Indices.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-402297\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/Trading-Crypto-and-Indices-1030x486.jpg\" sizes=\"(max-width: 1030px) 100vw, 1030px\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/Trading-Crypto-and-Indices-1030x486.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/Trading-Crypto-and-Indices-300x141.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/Trading-Crypto-and-Indices-768x362.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/Trading-Crypto-and-Indices-705x332.jpg 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/Trading-Crypto-and-Indices.jpg 1241w\" alt=\"\" width=\"1030\" height=\"486\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<h2>If you start, do it risk-free<\/h2>\n<p>You might have already bumped into one or more risk warning disclaimers, whether it was on brokerage, trading education site, prop firm or elsewhere.<\/p>\n<p>As far as these disclaimers might appear as an annoying formality, one cannot be far from the truth. What do they say? That trading can be risky, your capital is at risk, or that only a handful of traders are profitable and others lose capital and so on.<\/p>\n<p>This is due to the fact that brokers\/proprietary trading firms tend to advise new traders that trading with leverage may cause immense losses, and therefore the individual financial situation should always be put into consideration prior to starting trading.<\/p>\n<p>In certain countries, licenced entities are also required by law to publish the trading success rates of their clients, exposing the reality in the most transparent effort.<\/p>\n<p>The good thing is that brokers\/proprietary trading companies often offer demo accounts or Free Trial accounts in which traders can experience the trading environment, applications, and overall trading conditions risk-free.<\/p>\n<p>A lot of traders tend to overlook this step, however, it is extremely beneficial to get familiar with all trading aspects and conditions to avoid any possible hassle and surprises while trading live.<\/p>\n<p>Further to that, every broker, prop firm or liquidity provider offer different pricing, market hours, and trading conditions. Gaining the experience risk-free is the battle half won.<\/p>\n<h2>Trading can be addictive<\/h2>\n<p>Firstly, let’s break down what addiction means and how it is acquired. The definition of addiction is basically an urge to a particular activity or a substance that we can hardly control or refrain from.<\/p>\n<p>It is nothing more than a repeated habit that becomes an addiction over time. One can build an addiction to almost anything. It can be sugar, coffee, smoking, alcohol, drugs, etc.<\/p>\n<p>Besides the addictions which are part of substance dependence, being addicted to trading is part of behavioural addiction that involves an inability to stop participating in particular activities.<\/p>\n<h2>Trading vs Gambling<\/h2>\n<p>The same reason why trading can be addictive is identical to why gambling is addictive. As science has already proven, when you win while playing in a casino, the brain releases certain neurochemicals affecting a brain, such as dopamine and serotonin.<\/p>\n<p>These neurochemicals are the main causes for the euphoria, excitement and an indescribably good feeling at that moment. They directly affect the brain by activating its reward system and over time, the brain becomes accustomed to this type of stimulation in order to feel pleasure.<\/p>\n<p>In one of our articles – <a href=\"https:\/\/ftmo.com\/en\/forex-gambling\/\" target=\"_blank\" rel=\"noopener\">https:\/\/ftmo.com\/en\/forex-gambling<\/a>, we discussed why trading resembles gambling so much and how we can actually become consistently profitable. In case you have not read it, go ahead and have a look at the article to have an idea to what extent trading is the same as gambling and why trading is actually more than gambling.<\/p>\n<p>A brain can become addicted to any positive feelings and over a certain period of time, it craves more for the excitement and euphoria from winning trades just like winning in roulette. This can even be elevated by underlying mental health problems, passed genetics from family members, and many other factors such as that trading has become more accessible with the rise of the internet.<\/p>\n<p><strong>What are the symptoms of trading addiction? <\/strong><\/p>\n<ul>\n<li aria-level=\"1\">Charts obsessed<\/li>\n<li aria-level=\"1\">Increasing risk or financial exposure<\/li>\n<li aria-level=\"1\">Trading with no robust strategy or system<\/li>\n<li aria-level=\"1\">Losing interest in normal daily routine<\/li>\n<li aria-level=\"1\">Anxiety, irritability or stress when not trading<\/li>\n<li aria-level=\"1\">Taking loans or borrowing money from others<\/li>\n<li aria-level=\"1\">Using daily-necessities money for trading<\/li>\n<li aria-level=\"1\">Incline into criminal activities or fraud to get money for trading<\/li>\n<\/ul>\n<p>Being obsessed with researching, checking charts, performing technical analysis, reading news to watch the fundamentals do not necessarily indicate addiction to trading.<\/p>\n<p>However, when other important tasks are neglected or you find yourself refraining from activities that used to be pleasurable and in your normal daily routine, you might consider reflecting on whether you are addicted or starting to be addicted to trading.<\/p>\n<p>The sooner you detect this, the better. On another level, when you start to feel anxious, stressed, irritated when you are not trading, or even worse, looking for “out of pocket” money just to place trades, it might be beneficial to start searching for help from a professional.<\/p>\n<h2>Trading under a financial pressure<\/h2>\n<p>As we have discussed above, taking loans or using money that is devoted to covering daily necessities is certainly bad money management and financial illiteracy.<\/p>\n<p>While it does not necessarily mean that a trader may not be able to generate money from trading, it certainly indicates that such trader is over-risking which eventually amplifies the emotions both positive and negative.<\/p>\n<p>The consequences of these amplified emotions may either cause bad habits of money management, anxiety or in a worst-case scenario mild symptoms of trading addiction. Some traders are likely to engage in revenge trading and over-risking their trades without a proper analysis of their strategy.<\/p>\n<p>Trading under financial pressure has a direct impact on the biggest enemies of money management – fear and greed. Since these emotions can be magnified due to financial pressure, they usually take over your decision making which is contradictory to money management and risk management that we stress about at FTMO.<\/p>\n<p>In case you missed our post on Money Management, feel free to read it at the following link: <a href=\"https:\/\/ftmo.com\/en\/money-management-in-forex-trading\/\" target=\"_blank\" rel=\"noopener\">https:\/\/ftmo.com\/en\/money-management-in-forex-trading\/<\/a>.<\/p>\n<p>Traders at FTMO already know the importance of money management not only in trading but also in applying them in real life.<\/p>\n<p>We are also well aware of all the risks while trading without a plan, not maintaining discipline, failing to adapt to the ever-changing market conditions, unrealistic expectations, poor risk and money management, etc.<\/p>\n<p>The uncertainty of the markets in combination with the pressure from the financial situation due to loans or debts may cause even further losses and create financial setbacks for inexperienced traders.<\/p>\n<p>The good thing is, with all the tools and applications that FTMO provides to traders (Account MetriX, Mentor App, Statistical App, Equity Simulator, Trading Journal), we are able to help our traders to create a good trading plan, risk management, and also advance their trading skills to another level.<\/p>\n<p>Apart from the tools, we also provide free monthly sessions with our Performance Coach for our FTMO Traders where they can freely discuss their psychology or emotional setbacks while enhancing their mental state in order to sharpen their decision-making skills for another trading month.<\/p>\n<p>&nbsp;<\/p>\n<p><a class=\"lightbox-added aligncenter\" href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/hell_vs_management.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-402300\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/hell_vs_management-1030x486.jpg\" sizes=\"(max-width: 1030px) 100vw, 1030px\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/hell_vs_management-1030x486.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/hell_vs_management-300x141.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/hell_vs_management-768x362.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/hell_vs_management-705x332.jpg 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/hell_vs_management.jpg 1241w\" alt=\"\" width=\"1030\" height=\"486\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<h2>Conclusion<\/h2>\n<p>Trading is a risky business. It is a profession like any other. If you want to be a commercial pilot, you have to study and practice for years before getting your pilot licence. If you want to be a plastic surgeon, you devote years of studies and practice before you can take the real responsibility of doing the job.<\/p>\n<p>Trading is no exemption and there are no shortcuts. Although you might feel that the infrastructure is available, easy to understand and you have all the features on your hand, you still need practice, experience, psychological durability, refined strategy and an adaptive market approach.<\/p>\n<p>Trading involves money and if you don’t have them spare, don’t get into trading at all. Stick to the notion of “<em>only invest what you can afford to lose<\/em>“.<\/p>\n<p>If you know you’ll be lacking your monthly income or cannot go without having extra cash sideways for your trading, don’t deposit them in the broker.<\/p>\n<p>If you trade for a Prop Firm like FTMO, think twice if you really need to purchase your new FTMO Challenge immediately after your previous attempts were not successful. You can always take a step back, reflect on your past performance, practice in the Free Trial or any demo account and do what is needed to be better another day.<\/p>\n<p>Self-reflection is crucial, just like your financial literacy. Don’t allow trading to become gambling or your addiction. Professional traders are those who live a balanced life and have complete control over their daily activities and endeavours.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In this article, we explain the reasons why trading may become addictive and why traders might fall into situations that could potentially lead to a negative experience about trading. In addition, we focus on cases in which traders, in combination with different aspects of trading, can worsen their financial situation and how to avoid such [&hellip;]<\/p>\n","protected":false},"author":31,"featured_media":406284,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/403601"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/31"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=403601"}],"version-history":[{"count":3,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/403601\/revisions"}],"predecessor-version":[{"id":565397,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/403601\/revisions\/565397"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/406284"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=403601"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=403601"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=403601"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}