{"id":406254,"date":"2021-06-29T14:10:03","date_gmt":"2021-06-29T12:10:03","guid":{"rendered":"https:\/\/ftmo.com\/?p=406254"},"modified":"2022-01-11T17:15:08","modified_gmt":"2022-01-11T16:15:08","slug":"our-new-ftmo-traders-share-their-feedback","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/our-new-ftmo-traders-share-their-feedback\/","title":{"rendered":"Our new FTMO Traders share their feedback"},"content":{"rendered":"<p><em>Wednesday is here and once again, we bring you Q&amp;A with some of our new FTMO Traders. How did they manage to pass the FTMO Evaluation Process? Check out their feedback, you might learn a thing or two.<\/em><\/p>\n<h3>Trader Nuno &#8211; <em>&#8220;Make sure you are in the right headspace if you wanna take trading seriously.&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/nunop.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-403400 size-medium\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/nunop-228x300.png\" alt=\"\" width=\"228\" height=\"300\" \/><\/a><\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>Yes, the only thing I change sometimes is the risk per trade, as I try to use asymmetrical compounding to maximize gains and cover losses.<\/p>\n<p><strong>Describe your best trade.<\/strong><\/p>\n<p>My best trade ran for more than 30x the initial risk, however, most of the position got taken major partials at 5R\/R and 10R\/R, also the risk on that trade was low.<\/p>\n<p><strong>What do you think is the most important characteristic\/attribute to become a profitable trader?<\/strong><\/p>\n<p>Discipline, if I didn&#8217;t force myself to follow the plan I would have lost both the challenge and verification phase, a plan is nothing but a plan if you don´t follow it, when you do, you get your edge in the market.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/nunoM.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-403403\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/nunoM.png\" alt=\"\" width=\"819\" height=\"812\" \/><\/a><\/p>\n<p><strong>What was easier than expected during the FTMO Challenge or Verification?<\/strong><\/p>\n<p>Allowing the winners to pay for the losses, I thought I was gonna panic when I went in drawdown but I kept my calm and executed the plan.<\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p>Honestly, both market conditions and my psychology, I used to be funded before but I ruined it because of FOMO and stress caused by other personal issues, the market conditions were odd for the second part of this last challenge but I managed to pull it off.<\/p>\n<p><strong>One piece of advice for people starting the FTMO Challenge now.<\/strong><\/p>\n<p>Take your time, don&#8217;t rush the process, and make sure you are in the right headspace if you wanna take trading seriously.<\/p>\n<h3>Trader Rickey &#8211; <em>&#8220;My experience with FTMO has been the best ever.&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/rickyp.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-403406\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/rickyp-183x300.jpeg\" alt=\"\" width=\"183\" height=\"300\" \/><\/a><\/p>\n<p><strong>What do you think is the most important characteristic\/attribute to become a profitable trader?<\/strong><\/p>\n<p>Discipline is the most important in my opinion.<\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>I have a trading plan and I update it frequently to keep it in line with current market conditions. Markets change and so should your plan. Otherwise, your strategies will become outdated and no longer viable in a new market condition.<\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p>The hardest obstacle for me was not being greedy and over-trading. Walking away for the day after hitting my daily goal or earning good enough profits to be happy with. Thanks to the FTMO rules, I&#8217;m able to walk away after a profitable day so that I don&#8217;t give back my profits or break a rule. FTMO rules helped me a ton!<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/rickeym.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-403409\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/rickeym.png\" alt=\"\" width=\"819\" height=\"812\" \/><\/a><\/p>\n<p><strong>How would you rate your experience with FTMO?<\/strong><\/p>\n<p>My experience with FTMO has been the best ever. I&#8217;ve learned so much about following the rules, which has made me a better and more profitable trader. I rate FTMO as the best firm on the market, hands down.<\/p>\n<p><strong>Describe your best trade.<\/strong><\/p>\n<p>My best trade was when I made $4,196 on US30, riding price from the Supply Zone to the Demand Zone. It was quick and smooth.<\/p>\n<p><strong>One piece of advice for people starting the FTMO Challenge now.<\/strong><\/p>\n<p>I would advise not to overtrade. Be patient and not try to pass in one day. Take your time and let the markets tell you what&#8217;s happening. Don&#8217;t try to make something happen. Don&#8217;t focus too much on the timeframe deadline, focus more on staying profitable and consistent each day.<\/p>\n<h3>Trader Kristine &#8211; <em>&#8220;I am so grateful for FTMO as it will make my journey quicker and closer to my end goals.&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/kristinep.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-403412\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/kristinep-161x300.jpeg\" alt=\"\" width=\"161\" height=\"300\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Where have you learnt about FTMO?<\/strong><\/p>\n<p>I have learnt about FTMO through a friend\/business partner. I am a part of an academy which is where I learned to be a consistently profitable trader.<\/p>\n<p><strong>How does your risk management plan look like?<\/strong><\/p>\n<p>My risk management plan will ensure that I never surpass the limit per day especially overall. I plan to risk no more than 2% a day and 3% per week. At first I plan to risk lower than what I plan to just like the challenge to ensure I do not pass the 10% overall loss. After gaining about 10-20% of my account I will start risking 0.5-1% per trade Ofcourse keeping in mind my maximum loss per week which for me is 3%.<\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p>The hardest obstacle on my trading journey is revenge trading. I am aware that I’m prone to it sometimes but I know that the risk is always in my control so even when I revenge traded US 30 I didn’t risk any more than I excepted.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/kristinem.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-403415\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/kristinem.png\" alt=\"\" width=\"819\" height=\"812\" \/><\/a><\/p>\n<p><strong>How would you rate your experience with FTMO?<\/strong><\/p>\n<p>My experience with FTMO is amazing. I am so grateful for FTMO as it will make my journey quicker, and closer to my end goals.<\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>The countless amounts of information that helped me in becoming a better person. I believe the charts reflect your mental environment and so trading has forced me to look within and improve myself mentally and emotionally so that I can find consistency not only with trading but with everything I do in life.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>I would like to say READ. Read books to make yourself aware of knowledge that you might already know but do not apply because you are not aware of what your obstacles are. One other thing is to keep track of all of your trades, do not let any losing trades be mistakes. Instead, allow them to be lessons!<\/p>\n<h3>Trader Scott  &#8211; <em>&#8220;Bring on the next chapter!&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/scottp.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-403418\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/scottp-215x300.jpeg\" alt=\"\" width=\"215\" height=\"300\" \/><\/a><\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>Trading psychology has always been lurking around during my trading, and yes it has affected my trading plan, not always in a bad way but also better. You can never be perfect in the trading world, so as long as you learn and eliminate the factors that did interfere with your plan to rule them out you can continue to improve.<\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>Its been a long journey with me, after 5 years of trying to learn the ins and outs of trading and strategies, I told myself year upon year not to quit, so I will continue until I succeed.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>I had to become more consistent in how I trade to eliminate luck, then it becomes more of skill and not a coincidence. You have to show up day after day until you know that the strategy is working, once you can acknowledge this you can gain the confidence that your system works. Don&#8217;t get me wrong it is extremely hard at times but you have to gain and trust in you setups and keep going. Not every trade is a winner, it&#8217;s how you manage the losses. If you have the correct risk management in place you can&#8217;t go wrong.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/Screenshot-2021-06-29-at-9.56.54.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-403421\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/06\/Screenshot-2021-06-29-at-9.56.54.png\" alt=\"\" width=\"819\" height=\"812\" \/><\/a><\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>Its not really made an impact just yet as I don&#8217;t like to get too ahead of myself, but I would not have pursued trading and the FTMO Challenge if i didn&#8217;t want to change my life so who knows&#8230; bring on the next chapter !!!!<\/p>\n<p><strong>How did Maximum loss limits affect your trading style?<\/strong><\/p>\n<p>This was keeping me in check all the time and actually made me a more disciplined trader. I often carried too much of an ego during my earlier trading days and this has failed me more times then i can remember simple reason being&#8230;.the 1 looser that you don&#8217;t let go always wipes away all those gains and becomes a huge set back, effecting my confidence and view on the markets. So having the maximum loss is firm rule that has brought my trading on lots.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>Just make sure that you are ready and have set rules within your plan, follow these and remember proper risk management is above all. Its okay to loose a trade its how you manage the loss that counts. Most new traders can&#8217;t do this.<\/p>\n<p>__________<\/p>\n<p><em>Editorial note<\/em>: <em>All responses are 100% organic and received from our new FTMO Traders during the contract signing process. All responders agreed to have their feedback published and all their answers are not being edited by FTMO, hence they can include grammatical mistakes or typos.  <\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Wednesday is here and once again, we bring you Q&amp;A with some of our new FTMO Traders. How did they manage to pass the FTMO Evaluation Process? Check out their feedback, you might learn a thing or two. Trader Nuno &#8211; &#8220;Make sure you are in the right headspace if you wanna take trading seriously.&#8221; [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":406255,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[672],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/406254"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=406254"}],"version-history":[{"count":5,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/406254\/revisions"}],"predecessor-version":[{"id":424051,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/406254\/revisions\/424051"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/406255"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=406254"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=406254"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=406254"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}