{"id":407251,"date":"2021-07-09T11:37:24","date_gmt":"2021-07-09T09:37:24","guid":{"rendered":"https:\/\/ftmo.com\/?p=407251"},"modified":"2021-08-27T10:39:29","modified_gmt":"2021-08-27T08:39:29","slug":"drawdowns","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/drawdowns\/","title":{"rendered":"Trading and Drawdowns"},"content":{"rendered":"<p><em>Every trader experiences them. A drawdown is a reduction in the equity value of an investment and an inevitable part of every trading system. There are different types of drawdowns and we&#8217;ll cover everything in this article.<\/em><\/p>\n<h2>Drawdown<\/h2>\n<p>We can see it everywhere. Forex, Crypto, Stocks, etc. Every analyst and financial news outlet is using drawdown to visualize a loss of value. Below you can find a chart from the financial media division of Bloomberg showing a drawdown in the Forex pair EURUSD.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-407252\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/Picture-1.png\" alt=\"\" width=\"941\" height=\"587\" \/><\/p>\n<p>But do you know the differences between different varieties of drawdown? For the purpose of this article, we recognize the Absolute drawdown, Relative drawdown and Maximum drawdown. Let’s have a look at how these differentiate and how they compare to our Maximum Daily Loss drawdown.<\/p>\n<p>We can describe Drawdown as the difference between the highest and the lowest point on your account. We measure the risk involved in our account using the drawdown. It is then divided into Absolute and Maximum drawdown.<\/p>\n<h3>Absolute Drawdown<\/h3>\n<p>To represent the difference between the initial balance and the lowest point below that, traders use the term called Absolute Drawdown.<\/p>\n<p>Here is a formula to calculate the Absolute Drawdown:<\/p>\n<p><strong>Absolute Drawdown = Initial Deposit &#8211; Minimal Equity<\/strong><\/p>\n<p>If we take as an example an Initial Balance of $100,000 and we have a maximum reached value of $150,000, the lowest value of $60,000, then the calculation of the Absolute Drawdown is: <strong>$100,000 &#8211; $60,000 = $40,000<\/strong><\/p>\n<p>The Absolute drawdown is to show the risk on the account. It reveals how big the loss is compared to the initial balance. If you had an Absolute Drawdown of $0, this would mean you had no risk at all, whereas in our example, the risk we took is $40,000 or 40% in total.<\/p>\n<h3><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-407256 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/Picture-2.png\" alt=\"\" width=\"635\" height=\"577\" \/><\/h3>\n<h3>Maximum Drawdown<\/h3>\n<p>To represent the difference between the account’s maximum and the closest minimum, we use the Maximum Drawdown. This can show you the potential loss per trade or sequence of trades. If the resulting value is higher than the profit potential of the asset, it is usually a sign of a bad investment (negative RRR).<\/p>\n<p>Maximum Drawdown = Distance between the highest and lowest points (maximum and minimum peak).<\/p>\n<p>If we use values from the previous example:<\/p>\n<p>Maximum Drawdown = <strong>$150,000 &#8211; $60,000 = $90,000<\/strong><\/p>\n<p>$90,000 is the Maximum measured distance for this account.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-407260 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/Picture-1-1.png\" alt=\"\" width=\"672\" height=\"589\" \/><\/p>\n<h3>Relative Drawdown<\/h3>\n<p>To represent the ratio between the Maximum Drawdown and the value of maximum equity, we use the Relative Drawdown.<\/p>\n<p>To calculate this variation, we divide the Maximum Drawdown with the highest point on the account (highest equity) and to change it into a percentage, we multiply the result by 100.<\/p>\n<p>If we take the example from previous calculations:<\/p>\n<p><strong>$90,000 \/ $150,000 * 100 = 60%<\/strong><\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-407264 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/Picture1.png\" alt=\"\" width=\"625\" height=\"595\" \/><\/p>\n<h3>Maximum Daily Loss and Maximum Loss<\/h3>\n<p>We have now been describing different kinds of drawdowns, however, at FTMO we use different terms which are more favourable for the trader. To measure your risk management skills and to apply these on a daily basis, we have our own terms &#8211; Maximum Daily Loss and Maximum Loss. They’re supposed to simplify the way losses are shown in your account.<\/p>\n<p>Maximum Daily Loss is a crucial rule in not only our Evaluation Process but also during the performance of the FTMO Account. It is set as 5% (or 10% in case of an Aggressive risk mode) from the initial account balance. According to the rule, the sum of all positions (closed+open) must not hit or exceed the Maximum Daily Loss (MDL).<\/p>\n<p>We have a formula for calculating the MDL:<\/p>\n<p><strong>Current daily loss = result of closed positions of this day + result of open positions<\/strong>.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-407322 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/Webp.net-gifmaker.gif\" alt=\"\" width=\"800\" height=\"800\" \/><\/p>\n<p>On the above infographic, you can see a scenario of the equity development over 5 trading days.  The starting balance is $100,000 and the MDL for the first day is $5,000 (so the maximum allowed loss of the day is $5,000). This means that if you had a result of -$5000 or greater from your closed + open positions, the rule would count as violated.<\/p>\n<p>Please take notice that MDL is moving together with the initial balance of the new day. As you can see above, the MDL limit moves every midnight in relation to the account balance at 23:59:59 CE(S)T when the MDL resets to the initial 5% limit of the initial account balance.<\/p>\n<p>The difference between MDL and Maximum Loss (ML) is that MDL always resets at midnight CE(S)T to 5% of the initial account balance. This can be seen in the graphic above. ML takes all-time open and closed profits\/losses into account and if you step over the 10% limit of ML, it would count as a violation.<\/p>\n<p>MDL and ML also take commissions and swaps into account.<\/p>\n<p>You can learn more about Maximum Daily Loss and Maximum Loss here: <a href=\"https:\/\/www.ftmo.com\/en\/welcome\/#maximum-daily-loss\">https:\/\/www.ftmo.com\/en\/welcome\/#maximum-daily-loss<\/a> and <a href=\"https:\/\/www.ftmo.com\/en\/welcome\/#maximum-loss\">https:\/\/www.ftmo.com\/en\/welcome\/#maximum-loss<\/a><\/p>\n<p>So when it comes to comparing Maximum Daily Loss and Maximum Loss to the varieties of drawdown, we can conclude that FTMO still cares about drawdown, but we try to mitigate the risks for us and for our traders using the MDL and ML rules so that we can profit together. While risky strategies can be profitable for a small percentage of traders, we seek consistency, reliability and experience.<\/p>\n<p>Drawdown control is an extremely important attribute and skill of every serious trader. Maximum Daily Loss is in place to make sure you can trade another day while not exposing your account equity to dangerously low drawdown levels.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every trader experiences them. A drawdown is a reduction in the equity value of an investment and an inevitable part of every trading system. There are different types of drawdowns and we&#8217;ll cover everything in this article. Drawdown We can see it everywhere. Forex, Crypto, Stocks, etc. Every analyst and financial news outlet is using [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":407652,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/407251"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=407251"}],"version-history":[{"count":10,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/407251\/revisions"}],"predecessor-version":[{"id":414857,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/407251\/revisions\/414857"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/407652"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=407251"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=407251"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=407251"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}