{"id":407628,"date":"2021-02-21T14:40:03","date_gmt":"2021-02-21T13:40:03","guid":{"rendered":"https:\/\/ftmo.com\/?p=407628"},"modified":"2022-01-11T17:43:11","modified_gmt":"2022-01-11T16:43:11","slug":"forex-backtesting","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/forex-backtesting\/","title":{"rendered":"Guide to Forex Backtesting &#8211; Gain confidence in your trading strategy"},"content":{"rendered":"<p><em><span data-preserver-spaces=\"true\">There are countless ways of making money in Forex. But how can you be certain that your strategy will work in the long run? The truth is that you can never know 100% as markets are ever-changing organisms. The good news is that you can get very close to profitability thanks to backtesting. In this article, we will take a look at backtesting basics and show you how you can make most of it to gain confidence in your trading.<\/span><\/em><\/p>\n<h2>Guide to Forex Backtesting &#8211; Gain confidence in your trading strategy<\/h2>\n<p>There is one thing that connects all professional traders &#8211; they have 100% trust in their trading strategy.<\/p>\n<p>If you want to join this elite club of traders, you need to know what to expect from your trading strategy.<\/p>\n<p>This is quite a complicated task since none of us can see the future, but thanks to the historical data, we can easily see how we would have performed in the past.<\/p>\n<p>If we can find out that our trading strategy performed well in the last couple of years, there is a very small chance it won&#8217;t work in the future.<\/p>\n<p><strong>So what is backtesting?<\/strong><\/p>\n<p>While we backtest, we put our strategy to test on historical data.<\/p>\n<p>This can be done over the last couple of months but you can also go 10 or 20 years back.<\/p>\n<p>It all depends on your appetite and how robust you want your backtest to be.<\/p>\n<p>Although backtesting can be very time consuming, it is relatively easy.<\/p>\n<p>All you need is a trading platform with enough historical data and a simple excel sheet where you will document all trades.<\/p>\n<h2>Types of backtesting<\/h2>\n<p>There are two types of backtesting, manual and automated.<\/p>\n<p><strong>Manual backtesting<\/strong> is as straight as it gets.<\/p>\n<p>You just need to open the platform and look, day by day, for valid trading setups you would trade in real-time.<\/p>\n<p>After every trade, you log it into your spreadsheet and carry on.<\/p>\n<p>This can be quite a long process and most importantly you need to be 100% true with yourself.<\/p>\n<p>One of the mistakes traders do with backtesting is they try to &#8220;curve-fit&#8221; strategy so it would bring a positive expectancy.<\/p>\n<p>An example of this can be when the trading setup would present itself in the middle of the night where you won&#8217;t be able to execute it, or your stop loss would get hit by spread and you completely ignore this fact and register the trade anyway.<\/p>\n<p>You have to realize that by doing this, you are only hurting yourself as you will lose money in the live market conditions.<\/p>\n<p>The second type of backtesting is fully <strong>automated<\/strong>.<\/p>\n<p>For this type of backtesting, you often need knowledge of some programming language.<\/p>\n<p>It is mostly Python, MQL or C++.<\/p>\n<p>A huge pro of automated backtesting is that it completely removes all emotions and time you need to spend on going day by day on historical data.<\/p>\n<p>The downside of it is that you need to invest quite some time in learning the programming language.<\/p>\n<h2>Important Backtesting Statistics<\/h2>\n<p>When you are running a backtest these are the most important statistics you should keep track of.<\/p>\n<ul>\n<li>Time and Date of entry<\/li>\n<li>Entry and Exit price<\/li>\n<li>Position size and % risk on your trading account<\/li>\n<li>MAE – Maximal Adverse Excursion<\/li>\n<li>MFE – Maximal Favorable Excursion<\/li>\n<li>Average R: R ratio<\/li>\n<li>Strike rate<\/li>\n<li>Maximum drawdown<\/li>\n<li>Long\/short ratio<\/li>\n<li>The success rate on different instruments<\/li>\n<\/ul>\n<p>If possible, it is good to also add the screenshot to all the trades in your backtest. This way, you can easily come back to it later.<\/p>\n<h2>How many trades should be backtested?<\/h2>\n<p>Some traders might test the first ten trades and if they see their strategy works, they decide it is just enough and give up on further backtesting.<\/p>\n<p>This is definitely not a good approach as you don&#8217;t have a robust data sample.<\/p>\n<p>To be really sure your trading system is stable and robust, you need a sample size of at least 100-200 trades.<\/p>\n<p>This way you will gain much more confidence in your trading.<\/p>\n<p>Although trading in the real market is always different from testing your strategy on the demo, you will gain much more confidence knowing that your strategy has a positive expectancy over the long run.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are countless ways of making money in Forex. But how can you be certain that your strategy will work in the long run? The truth is that you can never know 100% as markets are ever-changing organisms. The good news is that you can get very close to profitability thanks to backtesting. In this [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":407629,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/407628"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=407628"}],"version-history":[{"count":3,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/407628\/revisions"}],"predecessor-version":[{"id":548443,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/407628\/revisions\/548443"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/407629"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=407628"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=407628"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=407628"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}