{"id":407947,"date":"2021-07-14T09:16:31","date_gmt":"2021-07-14T07:16:31","guid":{"rendered":"https:\/\/ftmo.com\/?p=407947"},"modified":"2021-08-16T10:02:09","modified_gmt":"2021-08-16T08:02:09","slug":"these-are-new-ftmo-traders-joining-us-in-july","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/these-are-new-ftmo-traders-joining-us-in-july\/","title":{"rendered":"These are some of new FTMO Traders joining us in July"},"content":{"rendered":"<p><em>Summer is in full swing and we have another dose of new FTMO Traders that were kind enough to share their journey and knowledge with us. Enjoy the article!<\/em><\/p>\n<h3>Trader Danielle &#8211; <em>&#8220;If you don&#8217;t try you won&#8217;t know.&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-407948 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/DanielleP.jpeg\" alt=\"\" width=\"250\" height=\"141\" \/><\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>Yes I am a consistent trader that sticks to my trading strategy which works comfortable with me along practicing and working on my psychology.<\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p>The hardest obstacle on my trading journey is to hold my trade longer which is my main focus right now and it has a lot to do with patience and your psychology but with enough consistency I have overcome that hurdle.<\/p>\n<p><strong>Do you plan to take another FTMO Challenge to manage even bigger capital?<\/strong><\/p>\n<p>Yes most definitely.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-407953\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/DanielleM.png\" alt=\"\" width=\"812\" height=\"975\" \/><\/p>\n<p><strong>Describe your best trade.<\/strong><\/p>\n<p>Having good trade is an overwhelming feeling just having the thought that the hard work and consistency that I have been doing is coming to light however it is not easy but I will not give up.<\/p>\n<p><strong>What was easier than expected during the FTMO Challenge or Verification?<\/strong><\/p>\n<p>Making the profits before the minimum trading days<\/p>\n<p><strong>One piece of advice for people starting the FTMO Challenge now.<\/strong><\/p>\n<p>Ensure you are a consistent trader whether it is by using a demo account or a real account. We can&#8217;t predict the outcome of things however if you don&#8217;t try you won&#8217;t know. Therefore my advice is to be consistent, stay focus and give it a sho<\/p>\n<h3>Trader Orland &#8211; <em>&#8220;FTMO gives me hope and a chance to help me and my family financially.&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-407959\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/OrlandP.jpeg\" alt=\"\" width=\"200\" height=\"200\" \/><\/p>\n<p>&nbsp;<\/p>\n<p><strong>How did you manage your emotions when you were in a losing trade?<\/strong><\/p>\n<p>I always say to myself that it&#8217;s okay, if ever I lose this trade today, there will always be another opportunity to earn it back to tomorrow.<\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>It really gives me hope and a chance to help me and my family financially. This is our chance to pay for all our debts because this pandemic hits us badly financially and emotionally. So this is our chance to stand up once again with the help of your company.<\/p>\n<p><strong>What was the most difficult during your FTMO Challenge or Verification and how did you overcome it?<\/strong><\/p>\n<p>The difficult part was really handling eagerness, my excitement to hit that target profit the quickest possible time and because of that I made some bad decisions in trading but it doesn&#8217;t become a hindrance in achieving my goal that&#8217;s why I&#8217;m here now.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-407965 alignnone\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/OrlandM.png\" alt=\"\" width=\"812\" height=\"975\" \/><\/p>\n<p><strong>How does your risk management plan look like?<\/strong><\/p>\n<p>In every trade that I have I&#8217;m only risking 2% of my equity, then always move my SL to breakeven every 15 or 20 pips positive and I&#8217;m using 1:2 or 1:3 Risk Reward Ratio.<\/p>\n<p><strong>What was easier than expected during the FTMO Challenge or Verification?<\/strong><\/p>\n<p>I didn&#8217;t expect that I will be finishing the verification stage as early as 5 trading days. The setups were just so good that my analysis works. But I truly enjoy both the Challenge and Verification stages.<\/p>\n<p><strong>One piece of advice for people starting the FTMO Challenge now.<\/strong><\/p>\n<p>My advice is just to follow the rules of FTMO because by doing this you are not just passing the challenge and verification but also it will help you a better trader because that&#8217;s what happens to me.<\/p>\n<h3>Trader Jayson &#8211; <em>&#8220;Keep your mind on the end goal.&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-407969 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/jaysonp.jpeg\" alt=\"\" width=\"350\" height=\"233\" \/><\/p>\n<p>&nbsp;<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>It came down to risk management for me. I always thought that luck had a factor in trading but I was wrong. With the proper technical skills, risk management, and trade supervision, luck quickly starts to fade and calculated trades with reasons behind the trade begin to take over.<\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>The opportunity we have to create a life for ourselves through trading is what drew me into pursuing a career in trading. What other opportunity allows you to make money from a click of a button? To be able to work from home and on your own terms and to be able to live comfortably is what really caught my attention when first starting out.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-407973 alignnone\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/jaysonm.png\" alt=\"\" width=\"812\" height=\"975\" \/><\/p>\n<p><strong>What was the most difficult during your FTMO Challenge or Verification and how did you overcome it?<\/strong><\/p>\n<p>The harderst challenge for me was being patient and waiting on setups. I would always worry about not having enough time for the challenge and rushing it. However, I realize that there is no rush and you have to let the market tell you what it wants to do. I would sometimes want to force trades but had to stop and take my emotions out of the picture and realize that I may need to wait another hour or so and be sure that before I take the trade that all my criteria&#8217;s are met.<\/p>\n<p><strong>Do you plan to take another FTMO Challenge to manage even bigger capital?<\/strong><\/p>\n<p>I do plan on taking another challenge but not soon. Maybe a few months down the line once I get in the groove of how this fires funded account feels.<\/p>\n<p><strong>How does your risk management plan look like?<\/strong><\/p>\n<p>My risk management is very strict. I typically will have a 5-8 pip stop loss which sounds like very little wiggle room. Trust me my stops do get hit and sometimes end up going in my desired direction after being hit but that&#8217;s all part of having good risk management. However, when my trades do play out I will typically make between 20-36 pips which covers multiple losses. This is the key in my opinion when it comes to trading.<\/p>\n<p><strong>One piece of advice for people starting the FTMO Challenge now.<\/strong><\/p>\n<p>Keep your mind on the end goal. Stay patient, manage your risk, and trust analysis.<\/p>\n<h3>Trader Daria &#8211; <em>&#8220;When it feels scary to jump, that is exactly when you jump.&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-407977 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/dariaP.jpeg\" alt=\"\" width=\"150\" height=\"287\" \/><\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>Yes, it has affected my trading plan, because you need that trader mindset. The worst you can do is doubt yourself and when you don&#8217;t have faith in yourself, you start to fail. So it&#8217;s important to know about the emotional and psychological part of trading. Having an effective trading strategy is just a small piece of the big puzzle. Balance the emotions and be aware of your mental process are important in the forex market. After a few losses, it&#8217;s likely to doubt your trading style, but it&#8217;s better to look at your mistakes and learn from them. Let these mistakes adjust your trading strategy a little bit. Also, I learned a lot through having the market experience.<\/p>\n<p><strong>How did Maximum loss limits affect your trading style?<\/strong><\/p>\n<p>Maximum loss limits learned me to have safe, consistent, and disciplined risk management. It helped me a lot to look at the trades I took with the right risk-reward ratio, 1:3. Also, I have a trading plan in which I only set 1 % risk a day. I learned also to not overtrade and to not be greedy, I wanted to keep it simple and organized during the Challenge. This is done by being organized and having a trading plan.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-407981\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/Screenshot-2021-07-13-at-9.50.24.png\" alt=\"\" width=\"812\" height=\"975\" \/><\/p>\n<p><strong>What was more difficult than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p>It was difficult when you had bad losses during the Challenge, but the key to passing the Challenge is to stay disciplined and to take a few, simple trades that have nice profits.<\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>Freedom that you will get, to be able to travel everywhere you want while you can trade and to be a confident &amp; an independent woman. Also, I love to have some consistency in my life.<\/p>\n<p><strong>Where have you learnt about FTMO?<\/strong><\/p>\n<p>Through Youtube and I have followed the FTMO traders through Instagram, they really inspired me to achieve my next level goals to be a profitable trader. I am really thankful that FTMO exists.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>Don&#8217;t rush yourself too much, don&#8217;t overtrade and don&#8217;t be greedy. Make sure you have your trading plan, and to have the right, safe, tight risk management. The most important thing to know is to trust yourself and don&#8217;t doubt about your trading style. Keep it simple and don&#8217;t let the emotions take your Challenge over. You don&#8217;t need to trade every day, some profitable days per week are enough. And all of it, when it feels scary to jump, that is exactly when you jump. Otherwise, you end up staying in the same place your whole life&#8230;<\/p>\n<p><em>Editorial note<\/em>: <em>All responses are 100% organic and received from our new FTMO Traders during the contract signing process. All responders agreed to have their feedback published and all their answers are not being edited by FTMO, hence they can include grammatical mistakes or typos.  <\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Summer is in full swing and we have another dose of new FTMO Traders that were kind enough to share their journey and knowledge with us. Enjoy the article! Trader Danielle &#8211; &#8220;If you don&#8217;t try you won&#8217;t know.&#8221; &nbsp; Do you have a trading plan in place, and do you follow it strictly? Yes [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":408646,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[672],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/407947"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=407947"}],"version-history":[{"count":6,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/407947\/revisions"}],"predecessor-version":[{"id":568884,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/407947\/revisions\/568884"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/408646"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=407947"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=407947"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=407947"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}