{"id":408509,"date":"2021-07-16T10:50:16","date_gmt":"2021-07-16T08:50:16","guid":{"rendered":"https:\/\/ftmo.com\/?p=408509"},"modified":"2022-01-11T17:14:42","modified_gmt":"2022-01-11T16:14:42","slug":"forex-and-poker","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/forex-and-poker\/","title":{"rendered":"Forex and Poker"},"content":{"rendered":"<p><em>What do poker and forex have in common? What connects them? That&#8217;s what we&#8217;ll look at in today&#8217;s article.<\/em><\/p>\n<h2>Forex and Poker<\/h2>\n<p>People who are inexperienced with either Forex or Poker will probably say that both are hazardous and gambling.<\/p>\n<p>This notion, however, is far from true. In reality, Poker and Forex have a lot in common.<\/p>\n<p>The connection between Poker and Forex may look strange at first glance, yet they have a lot of common characteristics.<\/p>\n<p>In both, one needs to focus on money management, dealing with emotions, be patient, disciplined and concentrate on a long-term goal.<\/p>\n<h3>Psychology<\/h3>\n<p>Without proper control of emotions, no Forex trader or Poker player will be successful in the long term.<\/p>\n<p>When a Poker player is not mentally well, whether because of high stakes he is not used to or because of the trap he has fallen into after an unfortunate losing hand, his chances of success are very slim.<\/p>\n<p>When a Forex trader is unwell, he starts making unnecessary mistakes, opening unnecessarily large positions with little potential for profit and entering into trades he would not have done otherwise.<\/p>\n<p>Fear and wild emotions simply do not belong to a Poker table or Forex trading and traders and players must learn to manage them as best as they can.<\/p>\n<h3>Long-term goal and patience<\/h3>\n<p>Both the player at the Poker table and the trader must focus on the long-term goal and accept the fact that you can&#8217;t do it without losses.<\/p>\n<p>Experienced players know that they don&#8217;t have to enter every hand, and losing, or even losing several hands in a row, doesn&#8217;t have to mean the end of the tournament.<\/p>\n<p>Although traders will try to make their strategy to eliminate the number of losing trades, the strategies with a 100% win rate do not exist so traders have to get used to losing.<\/p>\n<p>The ability to close losing trades that do not have the potential to turn into a profit is important, just as the ability to fold when there are a lot of chips on the table but you just don&#8217;t have a good hand.<\/p>\n<p>Loving your open positions is as dangerous as loving your cards.<\/p>\n<h3>Money management and discipline<\/h3>\n<p>A small-cap Poker player should not participate in high-entry tournaments, same as a trader should not risk an unnecessarily large percentage of his account when opening a trade.<\/p>\n<p>Before a trader starts trading Forex seriously, he should have a fine-tuned and tested strategy, including money management rules, and then sticking to it.<\/p>\n<p>If a trader knows the percentage success rate of his strategy, he can adjust the risk-reward ratio to be profitable in the long run.<\/p>\n<p>The player at the poker table should also have a strategy, know the percentage probability of each hand and accordingly risk a certain number of chips at every game.<\/p>\n<p>In both cases, the number of profitable trades and games may be relatively low, but with a disciplined approach, the Poker player and trader can be in profit in the long run.<\/p>\n<h3>Knowledge of the market<\/h3>\n<p>It is an advantage for a Poker player to know his opponents at the table and can adapt his strategy accordingly.<\/p>\n<p>He can afford to push the beginner and play more aggressively, but against experienced players, he must proceed more cautiously.<\/p>\n<p>Even a trader needs to know what influences the markets and should realise that he is mainly up against big players who have resources and capabilities on a completely different level.<\/p>\n<p>The decision to enter is always up to the trader, but mastery of technical and fundamental analysis and the ability to adapt to what is happening in the markets is very important and determines success or failure.<\/p>\n<p>There can be unpredictable movements in Forex, so Poker may seem easier in this regard.<\/p>\n<p>Even in Poker, a player can lose with the best cards in his hand, and he also has to get used to coming out of most tournaments a loser (sometimes with the money, often without).<\/p>\n<p>In both cases, the information available to the trader and the player is quite limited and confident predictions of outcomes are virtually impossible. Knowledge and experience can significantly reduce this disadvantage.<\/p>\n<h3>Conclusion<\/h3>\n<p>Despite the great similarities between Forex and Poker, one fact is really different.<\/p>\n<p>Our FTMO Traders are under constant scrutiny in terms of compliance and risk management.<\/p>\n<p>With the applied Trading Objectives, we can work together to ensure your trading career is long-lasting and you are not in danger of one &#8220;all-in&#8221; costing you everything.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What do poker and forex have in common? What connects them? That&#8217;s what we&#8217;ll look at in today&#8217;s article. Forex and Poker People who are inexperienced with either Forex or Poker will probably say that both are hazardous and gambling. This notion, however, is far from true. In reality, Poker and Forex have a lot [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":408991,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[4809],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/408509"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=408509"}],"version-history":[{"count":7,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/408509\/revisions"}],"predecessor-version":[{"id":424228,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/408509\/revisions\/424228"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/408991"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=408509"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=408509"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=408509"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}