{"id":409812,"date":"2021-08-05T09:38:28","date_gmt":"2021-08-05T07:38:28","guid":{"rendered":"https:\/\/ftmo.com\/?p=409812"},"modified":"2022-01-11T17:12:10","modified_gmt":"2022-01-11T16:12:10","slug":"the-impact-of-your-personal-life-on-your-trading","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/the-impact-of-your-personal-life-on-your-trading\/","title":{"rendered":"The impact of your personal life on your trading"},"content":{"rendered":"<p><em>This week we have an article from our Performance Coach Nelly. She talks about how trading can affect real-life situations and gives actionable tips on dealing with obstacles trading can bring.<\/em><\/p>\n<h2>The impact of your personal life on your trading<\/h2>\n<p><span style=\"font-weight: 400;\">How are you today? How was your last week? What is going on in your life right now? <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Have you been working on something else besides trading?<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Trading is a path of self-discovery and not just learning the markets. And trading psychology is not concerned only with our emotions while trading but with our mental health overall. Everything is connected. You need to feel well to reach your highest potential. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For becoming a consistently profitable trader, it is absolutely crucial to protect your mental wellbeing. Because honestly &#8211;  mental wellbeing is essential when it comes to our performance. If we feel alright, if we are happy and healthy, we then live a healthy and balanced lifestyle. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If we are surrounded by loved ones who support us through our ups and downs, our performance is naturally totally different than when we feel stressed, overwhelmed, desperate and lonely. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">And let me highlight here how important knowing when to trade and when not to trade is &#8211; as sometimes, not trading equals having a profitable trade.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Certain circumstances can appear in our lives when we won’t be able to dedicate energy to anything, not even trading. And it can be super challenging to acknowledge that kind of a situation, to recognize when we should take a break from the markets. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">But trust me, recognizing this can literally save you. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Because whatever is wrong in your life will eventually carry over into your trading performance. This is especially dangerous if you haven’t made peace with money, wealth, and the magnetic polarity of abundance and scarcity. Separate your trading needs from your personal needs, and take care of both.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Try to always evaluate the situation you find yourself in. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Start to journal and you will find out that the correlation between how you feel and how you trade is a real thing. You have to understand yourself to some degree and that can take time. It’s a process. Maybe you are laughing now- &#8220;<em>understand yourself<\/em>&#8220;? But knowing the exact kind of emotions you experience when things are going well or vice versa, being able to describe them and write down your observations, is not always an easy task and that&#8217;s only a first step you should take. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">When you master journaling and it becomes your habit, you’ll see how beneficial it truly is. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Being a trader can be super stressful sometimes and knowing and recognizing how you feel and where you are in your life is necessary to overcome that stress, to prevent you from doing silly and impulsive decisions when you let your emotions take over. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">To become a better trader, you also need to become a better version of yourself in every aspect. Find some time for yourself to grow stronger and healthier. And as you feel better, you’ll also perform better. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It is also advisable to have some routine in your life. Have a plan of your day in your mind and even better, have a plan on paper or in your calendar. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Try having a morning routine. When you’re getting ready for the new day, sink a glass of water, go for a run or have a shower followed by a proper breakfast. Your brain will certainly thank you. Meditation is another proven technique that is helping. Analyse how you feel, write it down. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">During the afternoon, evening or at weekends, spend some time with your family or friends. Go out, have fun. Be outdoor and just breathe that fresh air. Concentrate on different things just for a while.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Some of us really tend to spend all our time behind the screens, watching the charts with zero personal life and poor habits. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Dedication is very important but you also need to recognize when it is time to take a break. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Have a plan and stick with that plan even when you are happy and you have an amazing day or even week or month. Stick with your plan, but also have some free time for yourself. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Having a rest day can be extremely beneficial! Our brains need some time without markets, without charts. Go for a walk, have a proper meal, talk with your neighbour. Whatever. Have a break! <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Because the point is &#8211; our personal life has an impact on our trading but our trading also has an impact on our social life. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">How much time do you spend with your family? With your friends? Do you have any other hobbies? <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Earlier, I mentioned that some situations in our life can actually have a massive impact on our trading. But we should also be careful and don&#8217;t let trading impact our personal life too much.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Do not marry those charts!<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I know, trading can give us a lot of dopamine and that’s actually why it can become addictive for some people. You need to have an edge. Recognize how you feel, have a look at your relationship with trading. <em>Is it a healthy relationship? <\/em><\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>This week we have an article from our Performance Coach Nelly. She talks about how trading can affect real-life situations and gives actionable tips on dealing with obstacles trading can bring. The impact of your personal life on your trading How are you today? How was your last week? What is going on in your [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":412704,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[5184],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/409812"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=409812"}],"version-history":[{"count":5,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/409812\/revisions"}],"predecessor-version":[{"id":424226,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/409812\/revisions\/424226"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/412704"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=409812"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=409812"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=409812"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}