{"id":410195,"date":"2021-07-28T10:06:43","date_gmt":"2021-07-28T08:06:43","guid":{"rendered":"https:\/\/ftmo.com\/?p=410195"},"modified":"2021-08-16T14:28:48","modified_gmt":"2021-08-16T12:28:48","slug":"meet-our-new-ftmo-traders-2","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/meet-our-new-ftmo-traders-2\/","title":{"rendered":"Meet our new FTMO Traders"},"content":{"rendered":"<p><em>Another edition of interviews with new FTMO Traders is here! Let&#8217;s have a look at their journey throughout the Evaluation Process and what valuable tips they share to help you join our ranks. <\/em><\/p>\n<h3>Trader Brian &#8211; <em>&#8220;Be patient and take only the best setups.&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/BrianP.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-410196 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/BrianP.jpeg\" alt=\"\" width=\"250\" height=\"188\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>It will give me a chance to use my trading skills to hopefully leverage a faster timeline to financial freedom than I would have been able to do on my own by having access to more capital.<\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>Financial freedom- to be able to live and work from anywhere. To save for retirement and pay off debts Business freedom: to hopefully trade full time at some point and not need my job anymore.<\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>This is something I have had to work hard at and still do. I try to be conscious and aware of FOMO and chasing the market. I am overall pretty good at risk management but I need to still work on the confidence of letting winning trades run and not cut them off too early.<\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/BrianM.png\"><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-410201 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/BrianM.png\" alt=\"\" width=\"812\" height=\"796\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p><strong>What was easier than expected during the FTMO Challenge or Verification?<\/strong><\/p>\n<p>The FTMO Challenge believe it or not.<\/p>\n<p><strong>How did Maximum loss limits affect your trading style?<\/strong><\/p>\n<p>I just used smaller lot sizes than I normally would and limited the number of open trades I had at any one time. The daily loss was the one I was concerned most about.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>Be patient and take only the best setups&#8211;there is plenty of time. And practice excellent risk management&#8211;particualry in position size and number of open trades to limit chance of loss limits being hit.<\/p>\n<h3>Trader Munkhchuluun &#8211; <em>&#8220;Practice makes perfect.&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/MunkhchuluunP.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-410206 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/MunkhchuluunP.jpeg\" alt=\"\" width=\"300\" height=\"225\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>Yes, I have a trading plan and follows it every time.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>Every trade should be based on your own trading plan and risk management. I follow my rules and there is no need to count on luck.<\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p>The hardest obstacle on my trading journey was trading psychology, especially after the victory. For example, although the profit target of the verification stage is lower than the challenge one, I have passed the challenge almost 5 times with only 1 successful verification step. I&#8217;m pretty good at dealing with losses\/ fighting after a big loss day.<\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/Screenshot-2021-07-26-at-9.59.03.png\"><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-410211 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/Screenshot-2021-07-26-at-9.59.03.png\" alt=\"\" width=\"812\" height=\"788\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p><strong>What do you think is the most important characteristic\/attribute to become a profitable trader?<\/strong><\/p>\n<p>It is easy to say to stick with your rules. However, it is not as easy as it says. For me, being able to follow your rules and stick with your trading plan is the most important characteristic to become a profitable trader. Also, it takes time. If you can do it, you will be able to trade without emotions and take advantage of it.<\/p>\n<p><strong>How does your risk management plan look like?<\/strong><\/p>\n<p>I&#8217;ll try to have at least 1:2 risk to reward ratio. For example, 30 pips stop loss against the 60 pips take profit. However, I don&#8217;t like to put SL and TP. I plan and visualize the SL and TP areas and prefer to manage my trades live according to what the market gives us.<\/p>\n<p><strong>What is the number one piece of advice you would give to a new trader?<\/strong><\/p>\n<p>Practice makes perfect. Please spend as much as time you can on learning charts. You will not regret it.<\/p>\n<h3>Trader Ezekiel &#8211; <em>&#8220;Passing FTMO Challenge and Verification will completely change my life forever.&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/ezekielP.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-410218 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/ezekielP.jpeg\" alt=\"\" width=\"250\" height=\"333\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p><strong>What was more difficult than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p>I believe what was more difficult then expected was adapting to the risk management I have to the time crunch of the 30-day challenge.<\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p>My hardest obstacle definitely has been correcting my psychology. I used to have so much FOMO on profits it would cause myself to do things that did not align with my risk management.<\/p>\n<p><strong>How did you manage your emotions when you were in a losing trade?<\/strong><\/p>\n<p>I managed my emotions by simply not looking at the dollar amount of drawdown I was in and strictly looking at that chart.<\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/EzekielM.png\"><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-410223 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/EzekielM.png\" alt=\"\" width=\"812\" height=\"788\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>Passing FTMO Challenge and Verification will completely change my life forever. As I am finally going to be able to be self-employed, I’ll be able to work remotely and travel the world.<\/p>\n<p><strong>What was easier than expected during the FTMO Challenge or Verification?<\/strong><\/p>\n<p>I believe what was easier than expected was the Max drawdown. 10% to lose on an account isn’t very hard when you are risking 1-3% a trade but if you manage risk correctly then you can still see a significant amount of gain on the account risking 0.5-0.75% a trade.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>Good Luck. This challenge seems like a big deal. Because in some way it is. Stay calm and stick to your risk management. You will thank your future self.<\/p>\n<h3>Trader Moya &#8211; <em>&#8220;It’s an unbelievable opportunity that I wish I discovered earlier!&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/MoyaP.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-410236 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/MoyaP.jpeg\" alt=\"\" width=\"250\" height=\"280\" \/><\/a><\/p>\n<p><strong>Where have you learnt about FTMO?<\/strong><\/p>\n<p>Through friends\/other traders who have recommended FTMO and have commented how brilliant the service is.<\/p>\n<p><strong>What do you think is the most important characteristic\/attribute to become a profitable trader?<\/strong><\/p>\n<p>Discipline! Patience, adaptability, resilience and mental toughness. I think the “technical” side of trading &#8211; analysis is only a small portion of the overall skill required. The majority of the skill is psychological. Once you overcome the psychological aspect and control your mindset, that is when profitability will become consistent.<\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>The freedom, flexibility and financial benefits mainly, that becoming a successful trader offers. I am inspired by trading as it does not discriminate, the opportunity is available to ANYONE no matter where you come from or what cards you have been dealt in life. In traditional employment, a person’s upbringing\/educational background and qualifications can contribute massively to their chance of success\/making a good living. In trading none of this matters, it’s an opportunity available to anyone who wants to pursue it.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/MoyaM.png\"><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-410241 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/MoyaM.png\" alt=\"\" width=\"812\" height=\"788\" \/><\/a><\/p>\n<p><strong>How did you manage your emotions when you were in a losing trade?<\/strong><\/p>\n<p>Chilling out and not getting too worked up &#8211; taking a walk helps me. Meditation is amazing too. Also reminding myself that a losing trade is inevitable and not the end of the world and that there’s always the next trade! If I’m having a losing day I’ll try to stay off my phone and not look at the market until the next day when I’m feeling refreshed.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>Of course, luck plays some part in trading and it’s great when it’s on our side. However, we know that on the balance of probabilities, our trades cannot continuously win. To eliminate luck I think it’s important to always stick to your strategy and plan, as your decisions will be based on a set amount of relative factors. Rather than a negative gambling approach, where success would be based more on luck.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>Go for it! It’s an unbelievable opportunity that I wish I discovered earlier! The feeling of passing is unbelievable especially if it has taken you a while to pass. Take your time and do not rush with eagerness, there are a minimum amount of trading days you need to complete anyway. Make sure to begin the challenge at a time that you can give it your full focus, as distractions can cost you. I’d also keep the fact you’re doing the challenge to yourself as pressure from others asking how it’s going can cause unnecessary emotional pressure that could affect your performance.<\/p>\n<p>__________<\/p>\n<div class=\"entry-content\">\n<p><em>Editorial note<\/em>: <em>All responses are 100% organic and received from our new FTMO Traders during the contract signing process. All responders agreed to have their feedback published and all their answers are not being edited by FTMO, hence they can include grammatical mistakes or typos.  <\/em><\/p>\n<\/div>\n<footer class=\"entry-footer\">\n<section class=\"author-box\">\n<div class=\"author_description\">\n<div class=\"author_description_text\"><\/div>\n<\/div>\n<\/section>\n<\/footer>\n","protected":false},"excerpt":{"rendered":"<p>Another edition of interviews with new FTMO Traders is here! Let&#8217;s have a look at their journey throughout the Evaluation Process and what valuable tips they share to help you join our ranks.  Trader Brian &#8211; &#8220;Be patient and take only the best setups.&#8221; &nbsp; &nbsp; How has passing the FTMO Challenge and Verification changed [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":410525,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[672],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/410195"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=410195"}],"version-history":[{"count":9,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/410195\/revisions"}],"predecessor-version":[{"id":427052,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/410195\/revisions\/427052"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/410525"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=410195"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=410195"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=410195"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}