{"id":410326,"date":"2021-07-30T07:11:55","date_gmt":"2021-07-30T05:11:55","guid":{"rendered":"https:\/\/ftmo.com\/?p=410326"},"modified":"2024-02-26T08:48:12","modified_gmt":"2024-02-26T07:48:12","slug":"what-is-a-swap-and-for-whom-is-it-important","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/what-is-a-swap-and-for-whom-is-it-important\/","title":{"rendered":"What is a swap and for whom is it important?"},"content":{"rendered":"<p><em><span data-preserver-spaces=\"true\">What is a swap in trading and why should some traders take it into account when opening their positions? Can a swap have any significant impact on the outcome of a trade? And what has FTMO prepared for swing traders? Let&#8217;s check everything about swaps in this article. <\/span><\/em><\/p>\n<h2>What is a swap and for whom is it important?<\/h2>\n<p>When choosing a broker, traders often have to deal with the fees that the company charges them for executing the trade. Most often, they study the size of the spreads and commissions for the executed trades, and they should not forget about slippage.<\/p>\n<p>Those who do not trade intraday should also know about swaps.<\/p>\n<h3>What is a swap and how is it calculated<\/h3>\n<p>A rollover forex swap, or FX swap, is a cost (or income) to traders for holding a position overnight.<\/p>\n<p>For intraday traders who are not used to holding their positions overnight, the swap is not that important.<\/p>\n<p>However, if the trade is drawn out and the trader does not manage to close it before midnight, he may be surprised by a slight decrease in profit (or increase in loss), or at best a slight unexpected profit.<\/p>\n<p>The size of a swap is based on the interest rates of central banks of the countries whose currencies we trade.<\/p>\n<p>The larger the difference in rates, the larger the swap.<\/p>\n<p>A swap is positive when a long position is held in the currency with the higher interest rate, while it is negative when the trader is in a short position on the currency with the higher interest rate.<\/p>\n<p>Thus, a swap differs for different currency pairs. Its size also depends on the broker (liquidity providers).<\/p>\n<p>In the specifications of the individual pairs and instruments that can be traded, a swap is stated in points per lot.<\/p>\n<p>Nowadays, interest rates are often similar in most developed economies, resulting in swaps being negative in both directions.<\/p>\n<p>The size of a swap in this case is influenced by the broker or liquidity provider itself.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-604792\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/Swap-new-24.png\" alt=\"\" width=\"545\" height=\"646\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/Swap-new-24.png 545w, https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/Swap-new-24-253x300.png 253w\" sizes=\"(max-width: 545px) 100vw, 545px\" \/><\/p>\n<h3>3-day swap<\/h3>\n<p>A swap is charged to the trader at the end of the trading day, usually around midnight.<\/p>\n<p>An interesting feature that traders need to watch out for is the triple spread being charged overnight from Wednesday to Thursday.<\/p>\n<p>This is due to the fact that most instruments need two days to settle a trade. A trade that a trader opened on Wednesday will be settled on Friday and will include the weekend.<\/p>\n<p>The figure above shows that when holding a trade overnight, a trader in a long position on the EURUSD pair (buying EUR, selling USD) will be deducted 6.25 points per lot, and 3.00 points per lot in a short position (selling EUR, buying USD). If he holds a trade from Wednesday to Thursday, there will be a reduction of 18.75 points in a long position and 9 points in a short position.<\/p>\n<h2>Carry trade<\/h2>\n<p>In the days before the financial crisis, when most central banks in developed countries did not hold their interest rates near zero as they do today, traders and investment companies used higher positive swaps to make speculative investments to profit from interest rate differentials.<\/p>\n<p>Thus, the USDJPY and GBPJPY currency pairs have been used quite extensively as the Bank of Japan used to keep its rates very low for a long time and rates in the US and the UK have stayed above five per cent.<\/p>\n<p>Trades in which an investor borrows a currency at a low interest rate and buys a currency at a higher interest rate in order to profit from the interest rate differential are called carry trades.<\/p>\n<p>For ordinary traders, such trades don&#8217;t make much sense given the size of their accounts, but it&#8217;s good to keep an eye on them. Carry trades can influence currency rates and create strong trends in the longer term when markets are stable. Higher yielding currencies then tend to appreciate at such times.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/GBPJPY.png\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-410332\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/07\/GBPJPY.png\" alt=\"\" width=\"1294\" height=\"739\" \/><\/a><\/p>\n<p>In times of crisis, on the other hand, currencies with higher interest rates, which are mostly currencies of emerging economies, fall despite the positive interest rate differential. Investors are looking for safe assets with lower interest rates and the carry trade principle is not working.<\/p>\n<h2>FTMO Swing<\/h2>\n<p>As already mentioned, swaps and carry trades are not a big problem for intraday traders, but traders who use swing strategies and hold a trade for several days or weeks have to take such scenarios into account.<\/p>\n<p>In the best case, swaps will mean additional profit for them, in the worst case they have to count on lower profit or higher than expected loss.<\/p>\n<p>The new Swing account from FTMO is designed for traders with a longer investment horizon, who keep their positions open overnight or even longer, where some of the limitations associated with a classic account do not apply.<\/p>\n<p>Traders with FTMO Account Swing can keep their positions open even over the weekend and do not have to restrict entries during high impact news releases.<\/p>\n<p>Positive swaps can then increase their profits slightly, but they must also take into account that negative swaps can reduce their expected profits.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is a swap in trading and why should some traders take it into account when opening their positions? Can a swap have any significant impact on the outcome of a trade? And what has FTMO prepared for swing traders? Let&#8217;s check everything about swaps in this article.  What is a swap and for whom [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":410827,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/410326"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=410326"}],"version-history":[{"count":8,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/410326\/revisions"}],"predecessor-version":[{"id":609754,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/410326\/revisions\/609754"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/410827"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=410326"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=410326"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=410326"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}