{"id":412418,"date":"2021-08-13T14:59:06","date_gmt":"2021-08-13T12:59:06","guid":{"rendered":"https:\/\/ftmo.com\/?p=412418"},"modified":"2022-01-11T17:11:41","modified_gmt":"2022-01-11T16:11:41","slug":"order-types","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/order-types\/","title":{"rendered":"Order types while trading: What can you use?"},"content":{"rendered":"<p><em>In one of our recent articles, we discussed the execution of orders in forex. This time, we’ll talk about what orders traders can use in their trading platform when entering and exiting trades. While this may seem like a simple and obvious matter at first glance, using the right orders can help a trader better manage risk and money.<\/em><\/p>\n<h2>Market Order<\/h2>\n<p><span style=\"font-weight: 400;\">A Market order means that the trader will execute the trade at the best price available given the depth of the market at the time the order is executed. Traders use this order mainly when they want to enter the market as quickly as possible or when they want to close a position at the current price as quickly as possible.<\/span><\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-11-at-8.16.43.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-413407\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-11-at-8.16.43.png\" alt=\"\" width=\"2680\" height=\"1770\" \/><\/a><\/p>\n<p><span style=\"font-weight: 400;\">In volatile markets and markets with low liquidity, slippage can be quite significant, but traders who trade live must take this into account. A market order can be executed practically with a single click on the buy button (opening a long position at the ask price) or sell button (short position at the bid price) and is most often used by intraday traders and scalpers.<\/span><\/p>\n<h2>Limit orders<\/h2>\n<p><span style=\"font-weight: 400;\">Pending (limit) orders allow traders to enter or exit a trade at predetermined price levels outside of the current price. With these orders, they do not have to constantly monitor the market and wait for the price to reach an expected level that suits them. Traders have several types of pending orders to choose from, which they can combine to suit their individual strategies.<\/span><\/p>\n<h3>Stop orders<\/h3>\n<p><span style=\"font-weight: 400;\">A trader enters a Stop order when he expects the current price movement to continue. Thus, when a trader plans to open a long position, he places the Stop order above the current price, when he plans to open a short position, he places the order below the current price.<\/span><\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-11-at-8.16.56.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-413412\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-11-at-8.16.56.png\" alt=\"\" width=\"2680\" height=\"1770\" \/><\/a><\/p>\n<p><span style=\"font-weight: 400;\">When the price reaches the predetermined level, a buy (long position) or sell (short position) order is activated. The stop order is executed at any price after activation, so even in this case, the trader must take into account the possibility of slippage in markets with low liquidity or volatile markets.<\/span><\/p>\n<h3>Limit order<\/h3>\n<p><span style=\"font-weight: 400;\">A trader enters a Limit order if he wants to execute a trade at a better price than the price at which the selected instrument is currently trading.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Thus, when he wants to open a long position, he enters a Limit order below the current price. i.e. the price must first fall below the specified price and then the buy order is executed. For a short position, it is the other way around, the trader enters a Limit order above the current price. A Limit order, unlike a Stop order, provides the trader with the option to have his trade executed at a distanced level opposite of the desired market direction, in most cases in favour of the trader. <\/span><\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-11-at-8.17.04.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-413417\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-11-at-8.17.04.png\" alt=\"\" width=\"2680\" height=\"1770\" \/><\/a><\/p>\n<p><span style=\"font-weight: 400;\">The problem is that the execution of the order may not happen even if the price touches the set price for a short period of time. If there are multiple orders at a given price, trades simply might not get filled. Same as with Stop orders, traders can experience slippage (both positive or negative) for their Limit order. There is no guarantee of the trade being filled at the exact or better price. <\/span><\/p>\n<h3>Stop Loss a Take Profit<\/h3>\n<p><span style=\"font-weight: 400;\">These two order types close the ongoing trade at predetermined levels. Stop Loss is effectively a stop order, closing the position; while Take Profit is a limit order, closing the open position.<\/span><\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-11-at-8.18.29.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-413422\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-11-at-8.18.29.png\" alt=\"\" width=\"1557\" height=\"909\" \/><\/a><\/p>\n<p><span style=\"font-weight: 400;\">Stop Loss closes the trade if the price moves in the opposite direction of the trader’s intention. This is practically the maximum loss the trader is willing to accept in a given trade. In the case of a long position, the Stop Loss can initially be placed below the price at which the trader entered the market, or later changed above to any level below the current market price at the given time if the price goes in the trader&#8217;s favour, thus securing a portion of the profit. In the case of a short position, it is the opposite.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Take Profit is the price at which the trader wishes to realize his profit or exit from the position (even if it is a losing position). For a long position, this order should logically be placed above the price at which the trader entered the market, for a short position it should be placed below the entry price.<\/span><\/p>\n<h3>Trailing Stop<\/h3>\n<p><span style=\"font-weight: 400;\">A specific type of Stop Loss order is the Trailing Stop, which traders can use to protect their profits. Unlike the classic Stop Loss, it is a dynamic order that moves in the desired direction of the asset price. It is only activated when a predetermined profit level is reached. For example, if a trader sets a Trailing Stop at 25 points, once the profit is made at this level, the Stop Loss will move to the break-even level. With each further movement in the desired direction of the asset price, this order is moved. If the trader does not set a Take Profit, the trade will not close until the price moves 25 points against the direction in which the trader opened the trade.<\/span><\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-11-at-8.18.55.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-413435\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-11-at-8.18.55.png\" alt=\"\" width=\"2680\" height=\"1770\" \/><\/a><\/p>\n<h3>Stop Limit<\/h3>\n<p><span style=\"font-weight: 400;\">A Stop Limit order is a combination of Stop and Limit orders and is practically an improved version of a Stop order. As we have already mentioned, the Stop order is subject to negative slippage in thinly liquid and volatile markets. A Stop Limit order solves this problem by triggering the Limit price when the Stop level is reached, which is the worst price a trader is willing to accept. Again, the trader has to take into account that the order may not be executed even if the price reaches the Stop level but no longer reaches the Limit level.<\/span><\/p>\n<h3>Order Expiration<\/h3>\n<p><span style=\"font-weight: 400;\">When placing pending orders, traders have to take into account that they may not be executed at all because the price may not reach the desired level. In addition, when placing orders, traders can specify how long their order will wait for execution.<\/span><\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-11-at-8.19.16.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-413427\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-11-at-8.19.16.png\" alt=\"\" width=\"868\" height=\"366\" \/><\/a><\/p>\n<p><strong>Good Till Cancelled (GTC)<\/strong> &#8211; <span style=\"font-weight: 400;\">in this case, the order is valid until the price reaches the desired level or is cancelled by the trader.<\/span><\/p>\n<p><strong>Today, Good for the Day (GFD, today)<\/strong> &#8211; <span style=\"font-weight: 400;\">such an order will be cancelled at the end of the trading day.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The trader can also specify the exact date and time when the pending order is to be cancelled if it is not executed yet.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>In one of our recent articles, we discussed the execution of orders in forex. This time, we’ll talk about what orders traders can use in their trading platform when entering and exiting trades. While this may seem like a simple and obvious matter at first glance, using the right orders can help a trader better [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":413768,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/412418"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=412418"}],"version-history":[{"count":8,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/412418\/revisions"}],"predecessor-version":[{"id":424043,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/412418\/revisions\/424043"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/413768"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=412418"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=412418"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=412418"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}