{"id":413978,"date":"2021-08-20T08:07:15","date_gmt":"2021-08-20T06:07:15","guid":{"rendered":"https:\/\/ftmo.com\/?p=413978"},"modified":"2022-01-11T17:10:59","modified_gmt":"2022-01-11T16:10:59","slug":"pros-and-cons-of-daytrading","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/pros-and-cons-of-daytrading\/","title":{"rendered":"Pros and cons of day trading"},"content":{"rendered":"<p><em>Intraday trading looks very appealing at first glance. The desire to make as much money as possible in a short period of time encourages an active approach to trading and frequent opening of positions. This approach can produce interesting results for some traders, but it is not for everyone. What are the major pros and cons of day trading? We will find out in this article.<\/em><\/p>\n<p>Until relatively recently, intraday trading wasn’t common practice among traders since only trading professionals were using this strategy.<\/p>\n<p>However, with the development of technology and the generalization of the internet, this approach is becoming increasingly accessible to retail traders who can trade from home or even at work.<\/p>\n<p>Intraday trading has become popular especially in Forex as it provides traders with leverage, high liquidity, low commissions and minimal spreads.<\/p>\n<h2>Plenty of opportunities<\/h2>\n<p>An intraday trader usually follows smaller time frames and focuses on smaller price movements, so he or she will see a relatively large number of trading opportunities on the market during the day.<\/p>\n<p>If a trader enters a sufficiently volatile and liquid market, he or she may execute several trades during the course of a day that represents a relatively large upside potential.<\/p>\n<p>Even a series of losing trades during the course of a day may not be a problem for them, as there will still be quite a lot of opportunities to find profitable trades.<\/p>\n<p>When a trader has a relatively large amount of data available for analysis, a large quantity of trades is an advantage in backtesting.<\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-19-at-9.26.03.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-414211\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-19-at-9.26.03.png\" alt=\"\" width=\"1845\" height=\"776\" \/><\/a><\/p>\n<h2>Risk a money management<\/h2>\n<p>Due to the number of trades executed during the day, a trader can risk a smaller percentage of his account per trade, which can be useful for traders with smaller accounts. While it is true that intraday trading is recommended for more experienced traders, the less experienced may appreciate the fact that they do not lose a considerable portion of their account with one failed trade. Of course, it is important to follow the rules of money management, but this should be a given for any trader.<\/p>\n<h2>Peaceful sleep<\/h2>\n<p>Since an intraday trader closes his trades before the end of the trading day and does not hold open positions overnight, he or she does not have to deal with market rollovers where liquidity is low, spreads widen and market gaps and slippages occur. They also aren’t concerned with the swaps that brokers and liquidity providers charge (or credit) for holding a position overnight.<\/p>\n<h2>Time management<\/h2>\n<p>Although intraday trading is considered a rather time-consuming discipline, the opposite may be true. Because low-timeframe markets provide ample opportunities to enter in one day, an intraday trader can determine the appropriate time to enter the market. The right choice of time, suitable strategy and a proper backtest then lead to a trader being able to spend only a few hours a day trading (at a time when liquidity in the markets is highest and spreads are minimal) and nonetheless could end their day with some interesting profit.<\/p>\n<h2>Quantity does not always mean quality<\/h2>\n<p>For one thing, a lot of realized trades means interesting profit potential. Equally, a large quantity might also mean a larger risk of taking a loss. This can make an inexperienced trader getting nervous and making mistakes after a series of losing trades, entering trades in a violation of own rules or opening unnecessarily large positions to make up for realized losses as quickly as possible.<\/p>\n<p>This then leads to an increasing number of losing trades and, in the worst-case scenario, it can cost the trader their account.<\/p>\n<p>However, the euphoria one feels after a series of profitable trades can be quite tricky since the feeling of invincibility is dangerous. It can coerce the trader to execute trades not entirely in line with their strategy. Such overtrading can lead to unnecessary mistakes and losses.<\/p>\n<p>With a relatively large number of trades, a trader must take into account that the cost of trading in the form of fees will increase.<br \/>\nTraders should choose brokers and liquidity providers that offer the lowest fees possible and they should take these additional costs into account when opening their positions.<\/p>\n<h2>The influence of psychology<\/h2>\n<p>If a trader gets into a losing streak and starts repeating mistakes leading to additional losses, it will definitely be mentally challenging for them. Frustration and doubt about the strategy, or worse, fear of opening new trades, may creep in. Worse still, a trader watching a market in which interesting opportunities may arise has their judgment impaired by fear of losing that may ultimately end in profit might lead to further frustration. Intraday trading is thus much more demanding in terms of following the rules and mastering the psychological side of trading. However, this is something that every trader should master, not just the intraday trader.<\/p>\n<h2>Fewer instruments<\/h2>\n<p><span style=\"font-weight: 400;\">Brokerage firms and prop trading firms usually attract their clients with a large number of instruments that can be traded on their platforms. Due to specific liquidity and time requirements, an intraday trader will probably have to pass up on a large number of instruments.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Still, there are plenty of instruments suitable for intraday trading, so a trader will certainly not miss out.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Intraday trading is certainly an interesting way to make money in forex, but without a doubt, it doesn&#8217;t suit all.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Intraday traders should be aware that it is rather a very demanding method of trading, both because of the need for strict adherence to trading plan and rules and in terms of the trader’s psychological resilience.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Intraday trading looks very appealing at first glance. The desire to make as much money as possible in a short period of time encourages an active approach to trading and frequent opening of positions. This approach can produce interesting results for some traders, but it is not for everyone. What are the major pros and [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":414413,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[162],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/413978"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=413978"}],"version-history":[{"count":8,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/413978\/revisions"}],"predecessor-version":[{"id":532496,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/413978\/revisions\/532496"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/414413"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=413978"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=413978"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=413978"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}