{"id":414590,"date":"2021-08-25T12:23:49","date_gmt":"2021-08-25T10:23:49","guid":{"rendered":"https:\/\/ftmo.com\/?p=414590"},"modified":"2022-01-11T17:10:38","modified_gmt":"2022-01-11T16:10:38","slug":"work-hard-to-look-for-proper-setups-ftmo-traders","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/work-hard-to-look-for-proper-setups-ftmo-traders\/","title":{"rendered":"Work hard to look for proper setups &#8211; FTMO Traders"},"content":{"rendered":"<p><em>Becoming an FTMO Trader is an outcome of combining a great amount of effort together with hard-earned knowledge, but of course there’s more to that. What psychological obstacles can you expect, how should you approach your strategy? We’ve interviewed several new FTMO Traders to help you anticipate your potential route through the Evaluation Process.<\/em><\/p>\n<h3>Trader Philip &#8211; <em>&#8220;The only guaranteed outcome you can control as a retail trader is how much you lose.&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/PhilipP.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-414592\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/PhilipP.jpeg\" alt=\"\" width=\"400\" height=\"534\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>From my teenage years, I have always been fascinated by the simplicity of economics, being involved in the biggest Financial market where the principles of demand and supply are applied is a dream come true, and the fact that it&#8217;s rewarding if one becomes good at it, thus giving you the financial freedom inspires me to be better each day.<\/p>\n<p><strong>How did you manage your emotions when you were in a losing trade?<\/strong><\/p>\n<p>My mentor empathized one thing when I was starting out, the only guaranteed outcome you can control as a retail trader is how much you lose, thus before entering the trade I am already prepared to lose a certain percentage and with that in mind, I let the markets do what they want to do because that stop loss is there as a friend to protect my capital.<\/p>\n<p><strong>What do you think is the most important characteristic\/attribute to become a profitable trader?<\/strong><\/p>\n<p>Patience, patience, and having a higher risk\/reward ratio.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/PhilipM.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-414597\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/PhilipM.png\" alt=\"\" width=\"769\" height=\"925\" \/><\/a><\/p>\n<p><strong>How does your risk management plan look like?<\/strong><\/p>\n<p>Should never risk more than 2% on a trade. Having at least a 1:2 risk\/reward ratio.<\/p>\n<p><strong>Describe your best trade.<\/strong><\/p>\n<p>GBP\/AUD, From 03\/08\/21 to 13\/08\/21, this pair gave four different opportunities around the same price(1.8755-1.8775) to go long, one of my best trades.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>Just don&#8217;t give up, keep studying these markets and be patient.<\/p>\n<h3>Trader Mohammad &#8211; &#8220;<em>It’s my dream come true being able to trade properly&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/MohammadP.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-414603\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/MohammadP.jpeg\" alt=\"\" width=\"500\" height=\"375\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p><strong>What do you think is the key to long term success in trading?<\/strong><\/p>\n<p>Trading plan with proven strategy, good risk management, positive attitude, belief in yourself and good psychology, be resilient and hungry for profits but not greedy.<\/p>\n<p><strong>What was more difficult than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p>My own psychology because I have control over it yet sometimes I allowed it to dictate my emotions when trading- sometimes with not so good results.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>Stuck to my trading plan and learning from good trade and bad trade and continually improving entry and exit point….I only took trade that met my entry criteria.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/MohammadM.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-414608\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/MohammadM.png\" alt=\"\" width=\"769\" height=\"925\" \/><\/a><\/p>\n<p><strong>Where have you learnt about FTMO?<\/strong><\/p>\n<p>Fantastic company providing fantastic opportunities for people like me who would never had a chance to trade in the market.<\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>For me this is is the second FTMO account but I lost it through being cocky and overconfident thinking I’ve achieved everything. Not this time, it will be treated with utmost respect and I see it as changing my life and that of my family in the process….it’s what I’ve only wanted to do in my life ever since I was 16 when I witnessed the £ crashed out of the ERM….it’s my dream come true being able to trade properly and hopefully in the future to be my full time job and hobby and I intend to make good profits for our partnership.<\/p>\n<p><strong>What is the number one piece of advice you would give to a new trader?<\/strong><\/p>\n<p>Trading plan and learn through every trade….you’ll never stop learning and never think you’re better than the markets….never blame the market or broker for your own failing, learn from your own mistakes. Mistakes are natural and part of the process. It’s through my mistakes that I have become more consistent and profitable….be prepared to learn a lot and respect the market.<\/p>\n<h3>Trader Tobias &#8211; <em>&#8220;All my losers which I cut are my best trades, cutting a losing trade makes me feel good.&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/TobiasP.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-414615\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/TobiasP.jpeg\" alt=\"\" width=\"400\" height=\"533\" \/><\/a><\/p>\n<p><strong>How does passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>I have always wanted to be a prop trader but things have changed for propriety trading and investment banks, I have dabbled in trading over the years not very successfully, doing the challenges helped my trading overall as it demands excellent risk management.<\/p>\n<p><strong>What was easier than expected during the FTMO Challenge or Verification?<\/strong><\/p>\n<p>Keeping to the risk management parameters was easier than I expected, when strict rules are not in force its tempting to take a chance. I find it very easy to cut trades to stay within guidelines<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/TobiasM.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-414620\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/TobiasM.png\" alt=\"\" width=\"769\" height=\"925\" \/><\/a><\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>There are certainly good luck and bad luck moments, luckily bad luck is managed with hard stop losses while good luck is rewarded with good profit<\/p>\n<p><strong>How did you manage your emotions when you were in a losing trade?<\/strong><\/p>\n<p>I don&#8217;t get too emotional, its not about whether a trade goes on to win or lose but exposing the account to risk<\/p>\n<p><strong>Describe your best trade.<\/strong><\/p>\n<p><b>A<\/b>ll my losers which I cut are my best trades, cutting a losing trade makes me feel good<\/p>\n<p>One piece of advice for people starting the FTMO Challenge now.<\/p>\n<p>Don&#8217;t rush, use the full time alotted, once you reach your objective reduce the risk dramatically<\/p>\n<h3>Trader Shahroz &#8211; <em>&#8220;Be patient and work hard to look for proper setups.&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/shahrozP.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-414625\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/shahrozP.jpeg\" alt=\"\" width=\"300\" height=\"400\" \/><\/a><\/p>\n<p><strong>What do you think is the key for long term success in trading?<\/strong><\/p>\n<p>The key to long term success in trading is risk management. If someone know how to manage their risk and trade accordingly, they can be successful.<\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p>The hardest obstacle was to not being patient during the trade. Sometimes you go with analysis and then don&#8217;t get enough patience to hold on the setup, but I think over time this obstacle can be eliminated.<\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>No. I focus on my trading plan and do not let my emotions come into my trade.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-24-at-13.21.52.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-414630\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Screenshot-2021-08-24-at-13.21.52.png\" alt=\"\" width=\"769\" height=\"925\" \/><\/a><\/p>\n<p><strong>What was the most difficult during your FTMO Challenge or Verification and how did you overcome it?<\/strong><\/p>\n<p>The most difficult part was to look for proper setups for the trade and be patient to look at the setups being played out. To overcome these difficulties I spent many hours on charts in order to look for best setups through my analysis and my own strategy.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>Simply by following my analysis through my strategy.<\/p>\n<p><strong>What is the number one piece of advice you would give to a new trader?<\/strong><\/p>\n<p>The only advice I ever give is to be patient and work hard to look for proper setups. Do not rush into taking a trade. You don&#8217;t have to take a trade everyday.<\/p>\n<div class=\"entry-content\">\n<p>__________<\/p>\n<div class=\"entry-content\">\n<div class=\"entry-content\">\n<p><em>Editorial note<\/em>: <em>All responses are 100% organic and received from our new FTMO Traders during the contract signing process. All responders agreed to have their feedback published and all their answers are not being edited by FTMO, hence they can include grammatical mistakes or typos. <\/em><\/p>\n<\/div>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Becoming an FTMO Trader is an outcome of combining a great amount of effort together with hard-earned knowledge, but of course there’s more to that. What psychological obstacles can you expect, how should you approach your strategy? We’ve interviewed several new FTMO Traders to help you anticipate your potential route through the Evaluation Process. Trader [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":414699,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[672],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/414590"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=414590"}],"version-history":[{"count":8,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/414590\/revisions"}],"predecessor-version":[{"id":424041,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/414590\/revisions\/424041"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/414699"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=414590"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=414590"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=414590"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}