{"id":414679,"date":"2021-08-27T08:46:43","date_gmt":"2021-08-27T06:46:43","guid":{"rendered":"https:\/\/ftmo.com\/?p=414679"},"modified":"2022-01-11T17:10:06","modified_gmt":"2022-01-11T16:10:06","slug":"the-history-of-money-and-the-emergence-of-forex","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/the-history-of-money-and-the-emergence-of-forex\/","title":{"rendered":"The history of money and the emergence of Forex"},"content":{"rendered":"<p><i><span style=\"font-weight: 400;\">How did we get from barter, exchanging shells and precious metal coins, through traditional paper money, all the way to today’s purely electronic cryptocurrencies and internet trading? When did Forex actually come into existence and what led to it? In this article, we will try to cover the complete path of the foreign exchange market.<\/span><\/i><\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/historyen.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-414801\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/historyen.jpg\" alt=\"\" width=\"2400\" height=\"1256\" \/><\/a><\/p>\n<p><span style=\"font-weight: 400;\">Money, in the form we know it today, has a relatively short history, but barter trade has virtually existed since people began to feel the need to exchange manufactured or cultivated goods for something else.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This form of trade can be dated tens of thousands of years back, which historians believe to be situated around the early Palaeolithic period.<\/span><\/p>\n<h2>From barter to money<\/h2>\n<p><span style=\"font-weight: 400;\">The barter trade lasted for quite a long time until it ceased to be practical because with the Earth population increasing, it became quite difficult to find suitable goods for exchange. The next evolutionary form of barter was the first form of money, which was back then still far away from the present structure. Nevertheless, the common feature was that the things or products being used as means of payment were generally in demand, and therefore had some exchange value in society.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It could be anything from furs to various grains, salt, or linen, simply things that were useful for the general public. Later on, shells of small molluscs were discovered and spread across the world. To this day, we consider them as one of the longest used forms of payment in the history of mankind.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, even this method has encountered its limits, mainly due to the growth of the society and the expansion of trade, when the selected commodity forms of money did not have exchange potential between different parties.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">At that time, metals were also used in some areas instead of commodity payments (depending on availability) because they were durable, portable, and easily divisible.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The Mesopotamian shekel, which represented both a unit of weight and a currency, can be considered a precursor of the first coins. Then in China, replicas of bronze shells appeared, replacing small bronze objects such as daggers, spades, etc. However, due to insufficient practicality, these objects were eventually replaced by their circle-shaped successors.<\/span><\/p>\n<h2>Metal coins as a catalyst for world trade<\/h2>\n<p><span style=\"font-weight: 400;\">However, the true predecessor of modern coins was eventually first minted in Lydia, which was located in today’s territory of Turkey.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The first coins that date from 650 to 600 BC were minted from a mixture of gold and silver with standardised weights ranging from 0.15 to 14 grams. The coins were stamped with various symbols to distinguish their nominal value.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The method of minting later spread to other parts of the world, which resulted in using new types of metals, as well as their mixtures. The ability to control the minting and circulation of coins slowly equaled an instrument of political power.<\/span><\/p>\n<h2>Paper money from China<\/h2>\n<p><span style=\"font-weight: 400;\">Even metal coins proved impractical over time, especially when transporting large quantities. In China, the first paper money began to appear around the seventh century AD. Later, around the end of the 10th century, the first financial bonds were issued, although their validity was limited to a certain period of time and to certain regions.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The government, of course, soon realised the economic advantage of printed money and secured a monopoly on its printing. Just as today’s US Dollar bears the statement “In God, We Trust”, so did Chinese paper money bear the warning “Those who counterfeit will be beheaded”.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The first nationally valid gold-backed banknotes were introduced in the second half of the thirteenth century. Marco Polo, who visited China in the thirteenth century as well, later introduced paper money in Europe. While addressing the state monopoly on printing money, he declared that “the Chinese emperor issues so many banknotes a year that he could buy all the treasures in the world, though it costs him nothing”.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The distrust in paper money in Europe delayed its spread there by a few hundred years.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The first modern banknotes in Europe were printed by the predecessor of today’s Swedish central bank, Stockholms Banco, in 1661.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Although the banknotes were a huge success, the bank eventually went bankrupt in 1667. The bank began printing so many of them that it could no longer cover them with its assets.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Several years later, the Bank of England was the first bank in Europe to start issuing banknotes permanently.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It was founded in 1694 to finance the war against France and began issuing banknotes in 1695.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, it was not until 1745 that it began to print standardised series of banknotes valued from £20 to £1,000, and in 1833, banknotes officially became a legal tender. In 1844, the Bank of England was granted a monopoly on printing banknotes that were backed by gold reserves.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In the USA, the situation was actually pretty similar. Banknotes were first printed to finance the Civil War in 1861, standardised system of printing money was not introduced until 1869.<\/span><\/p>\n<h2>Gold standard<\/h2>\n<p><span style=\"font-weight: 400;\">Although paper money drove world trade, economists feared that printing money too easily would lead to its devaluation.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In the late nineteenth century, the so-called gold standard, in which a standard economic unit of account is based on a fixed quantity of gold, became widespread in many countries.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This system was used in various forms until 1932 (although a large number of countries withdrew from it during the First World War).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It was then reintroduced in 1944 in the form of the Bretton Woods system, which lasted until 1971 when the US effectively ended it on 15 August by abolishing the convertibility of the dollar into gold.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As banknotes over the world are no longer covered by gold reserves, we’ve entered the era of floating exchange rates.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The second half of the twentieth century produced a new phenomenon that completely changed the way of how payment methods were used until then. Credit cards began to emerge and are now probably the most common method of performing monetary transactions. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Nowadays, the idea of abolishing paper money and replacing it with other, digital payment methods is slowly gaining in popularity. Mobile payments and especially cryptocurrencies (which have become a recent phenomenon thanks to the huge success of Bitcoin) can be considered as the latest phenomenon.<\/span><\/p>\n<h2>Forex<\/h2>\n<p><span style=\"font-weight: 400;\">Naturally, as money developed and world trade expanded, so did the business of exchanging currencies.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It started with the spread of coins and boomed with the emergence of banks and the spread of paper money in the 17th and 18th century, when the first forex market was established in Amsterdam.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The standardisation of international and monetary trade was then brought about by the gold standard, which stabilised the currency market and operated with several innovations all the way until 1971, when the Bretton Woods system was practically canceled.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Two years later, when other attempts to create a stable monetary system had failed (Smithsonian Agreement, European Common Float, etc.), the free-floating exchange rates were introduced in 1973, which can be considered as the birth of the modern currency exchange market.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Without any link to gold, currency values depended on multiple other factors, creating the need for a market where exchange rates would be determined in real-time based on market information.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Although national governments still had a very strong position in such markets, traders, banks, and various investment companies saw forex as a very interesting opportunity for making profits on exchange rate movements.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Along with the development of modern technologies, forex became a permanent sector of the financial markets. Reuters introduced computer monitors to replace telephones for trading as early as the 1970s, and in the 1980s, the same firm developed a form of electronic trading that served as a closed network for real-time traders.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The 1990s saw a further boom in forex thanks to the spread of the internet and, in no small part, the fall of the Iron Curtain and the globalisation of the economy.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">New players appeared on the market, restrictions on access to the currency market fell in many countries and the number of tradable currencies heavily expanded.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Financial institutions began to develop their own platforms that allowed their clients to trade forex with access to real-time prices. Eventually, the Internet also meant that forex trading could be extended to retail investors and retail brokerage firms were established to provide access to forex for their clients.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The introduction of the Euro, which gradually became the second most traded currency on the market, had a relatively large impact on the forex market in the new millennium.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Another big factor that has helped in the spread of forex among retail clients was the use of leverage, which allows forex traders to profit from even relatively small movements. The increasing prevalence of forex and the highly competitive market has led to further improvements in conditions for retail investors.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Forex has long been the most liquid financial market. When in the 1980s, $70 billion worth of trades were executed daily on Forex, today we’re looking at around $5 trillion. Trading foreign currencies is no longer a privilege of individual governments or large financial institutions. We at FTMO also try to make forex accessible to as many retail traders as possible by providing them with the opportunity to seriously dive into the markets and by trying to educate them on what is important when it comes to trading.<\/span><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>How did we get from barter, exchanging shells and precious metal coins, through traditional paper money, all the way to today’s purely electronic cryptocurrencies and internet trading? When did Forex actually come into existence and what led to it? In this article, we will try to cover the complete path of the foreign exchange market. [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":414801,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[4809],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/414679"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=414679"}],"version-history":[{"count":6,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/414679\/revisions"}],"predecessor-version":[{"id":424225,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/414679\/revisions\/424225"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/414801"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=414679"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=414679"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=414679"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}