{"id":415195,"date":"2021-09-03T15:08:34","date_gmt":"2021-09-03T13:08:34","guid":{"rendered":"https:\/\/ftmo.com\/?p=415195"},"modified":"2022-08-11T14:59:09","modified_gmt":"2022-08-11T12:59:09","slug":"how-does-liquidity-affect-market-volatility","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/how-does-liquidity-affect-market-volatility\/","title":{"rendered":"How does liquidity affect market volatility?"},"content":{"rendered":"<p><em>With a daily volume of over $6.5 trillion, perhaps liquidity should not be a problem in the forex market. However, even such a huge volume does not necessarily mean that there will always be sufficient supply and demand in all markets at all times.<\/em><\/p>\n<p><span style=\"font-weight: 400;\">Forex is a relatively broad concept, so the term “liquid market” may be misleading in some cases. The average daily turnover in forex is currently more than $6.5 trillion  (the US stock exchanges generate a daily volume of about $280 billion for comparison), and in 2019, the total trading volume exceeded $2.4 quadrillion.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">However, the majority of funds flow on the most liquid currency pairs, the so-called majors. The EURUSD pair alone occupies more than a quarter of all trades in terms of volume, and together with the USDJPY (17%) and GBPUSD (10%) pairs, they represent more than half of the volume traded on the currency market. When it comes to individual currencies, the US dollar is clearly the most popular one, appearing in more than 85% of all trades in the forex market, with 170 tradable currencies in total.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It is also important to clarify that similar data can never be fully accurate as forex is an OTC market and is not covered by a single exchange. The way to determine the liquidity of individual markets is by analysing data from currency futures traded on commodity exchanges, and the same is true for volumes as well.<\/span><\/p>\n<h2>Liquid vs illiquid markets<\/h2>\n<p><span style=\"font-weight: 400;\">So what actually affects the liquidity and why do some markets move more while others are slower? As previously mentioned, most forex trades take place on three main pairs. Other majors include AUDUSD, NZDUSD, USDCAD, and USDCHF pairs, while the liquid markets also include most of the combined currency pairs (crosses or minors, i.e. they do not contain USD) such as EURJPY, EURCHF, AUDJPY, GBPJPY, etc. These markets are where the largest trading volumes are traded and where the most liquidity is available for most of the day, i.e. the most pending orders creating a counterparty to traders on both the supply and demand side.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In high liquidity markets, a trader is more likely to execute a trade with less or no slippage as there are enough participants in the market, and enough traders can be found at all price levels to form a counterparty to each trade. As a result, these markets have very small spreads, major price swings occur less often and are thus generally characterised by lower volatility.<\/span><\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/high-liquid.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-415454\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/high-liquid.png\" alt=\"\" width=\"1634\" height=\"765\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">When there are enough pending orders in the market, the interest of traders is usually realized, and the price has no reason to move quickly in one direction or the other. Larger moves then occur when traders are more aggressive in one direction at certain price levels. They enter more orders, and traders in the opposite direction have no interest in going against them, which results in creating trends.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Less liquid markets include exotic pairs, where currencies of mostly emerging countries are represented. Traders in these markets usually do not have enough counter orders, and their trades may not be realized at the desired price. The larger the trade volume, the higher is the risk of slippage, plus higher spreads need to be expected in these markets too. Significant movements can occur much faster, hence these markets are much more volatile.<\/span><\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Low-liquid.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-415459\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/Low-liquid.png\" alt=\"\" width=\"1634\" height=\"766\" \/><\/a><\/p>\n<h2>Rollovers and macro data<\/h2>\n<p><span style=\"font-weight: 400;\">Even in liquid and major markets, there may be situations where the liquidity is lower, and traders must be prepared for increased volatility. This usually occurs during market rollovers, when most institutions are closed, causing more frequent slippages and wider spreads. Forex is a market that operates 24 hours a day, but that doesn’t mean that the big financial houses in the US or London are open non-stop.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Another case where liquidity in the markets, including majors, decreases for a period of time, is the publication of macroeconomic reports. If there is an important report release, traders may withdraw their pending orders due to the uncertain outcome and fear of market reaction. After the news is announced, the market is flooded with new orders, often entered by automated algorithmic programs, causing an increase in volatility. However, this usually may last only a few seconds or minutes.<\/span><\/p>\n<h2>Watch out for the Swiss franc<\/h2>\n<p><span style=\"font-weight: 400;\">An interesting example of extreme volatility caused by unexpected news is the past events on the EURCHF pair. Liquidity virtually dried up on this pair for a few minutes in mid-January 2015, which has never happened before in the modern history of forex. This was due to the unexpected end of the intervention by the Swiss National Bank. This led to an extreme move that resulted in many zeroed-out accounts of traders that were in bad positions, even bankruptcies of brokerage firms. The situation did not return to normal until a few days later.<\/span><\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/EURCHF-2015.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-415464\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/08\/EURCHF-2015.png\" alt=\"\" width=\"1636\" height=\"788\" \/><\/a><\/p>\n<p><span style=\"font-weight: 400;\">Investors should also keep an eye on the Swiss franc at the end of summer 2021. The CHF has greatly appreciated against the euro since April 2018, but it recorded two relatively significant drops in August, and analysts speculate that this may be due to the SNB’s actions. Brokers and liquidity providers have also responded by increasing margin requirements, thus reducing leverage on the USDCHF and EURCHF currency pairs.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Cryptocurrencies are nowadays a specific chapter. The value of the cryptocurrency market is currently around $200 billion and although they are very popular among a certain group of traders, the interest among large institutional investors is rather marginal. Forex traders today commonly have several of the best-known cryptocurrencies at their disposal, but their volatility is high due to the market’s low volume and liquidity.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The enormous liquidity in forex (or in selected pairs) leads to the fact that these markets are generally much less volatile than, for example, stocks. Leverage, which significantly multiplies these movements, is responsible for the fact that forex traders can be profitable even thanks to these relatively small movements. Thus, even with relatively small amounts of money, traders can control trades with the volume of six-figure volume and more.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Without any leverage, a trader needs €100,000 to execute a one-lot trade on the EURUSD currency pair, but with 1:100 leverage, a margin of €1,000 is sufficient. Thanks to FTMO, however, traders do not even need €1,000 out of their own pockets. After fulfilling the FTMO Challenge and Verification conditions, a trader can use an account size of up to $400,000, using only a negligible amount out of his own pocket to get the opportunity.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>With a daily volume of over $6.5 trillion, perhaps liquidity should not be a problem in the forex market. However, even such a huge volume does not necessarily mean that there will always be sufficient supply and demand in all markets at all times. Forex is a relatively broad concept, so the term “liquid market” [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":415431,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/415195"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=415195"}],"version-history":[{"count":22,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/415195\/revisions"}],"predecessor-version":[{"id":594721,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/415195\/revisions\/594721"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/415431"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=415195"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=415195"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=415195"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}