{"id":415495,"date":"2021-09-10T06:33:20","date_gmt":"2021-09-10T04:33:20","guid":{"rendered":"https:\/\/ftmo.com\/?p=415495"},"modified":"2022-04-06T16:04:16","modified_gmt":"2022-04-06T14:04:16","slug":"market-conventions-and-rollovers-on-nzd","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/market-conventions-and-rollovers-on-nzd\/","title":{"rendered":"Market conventions and rollovers on NZD"},"content":{"rendered":"<p><em>In this article, we&#8217;ll talk about rollovers in Forex, market conventions and what traders should look out for when trading New Zealand dollar pairs.<\/em><\/p>\n<h2>What are market conventions and rollovers?<\/h2>\n<p>Traders who trade Forex and hold their positions for more than one day had come across the term rollover.<\/p>\n<p>In short, it is an extension of the settlement date when a trader holds a position overnight.<\/p>\n<p>Normally, when holding a position overnight, the settlement would occur after two days; in a rollover, the settlement does not occur, but the position rolls over to the next day, for which it can then receive or pay an interest rate, called a <a href=\"https:\/\/ftmo.com\/en\/what-is-a-swap-and-for-whom-is-it-important\/\"><strong>rollover forex swap<\/strong><\/a>.<\/p>\n<p>Market conventions were introduced for transparency, to establish a consensus market view of established practices in certain markets and to help prevent misunderstandings. They define and establish basic concepts, units, pair designations, terms, etc. which are then used in trading around the world.<\/p>\n<p>One such global market convention is the stipulation of the time when rollover contracts occur in forex.<\/p>\n<p>For all currency pairs, rollover occurs at 17:00 Eastern Time (EST, New York), which corresponds to 23:00 Central European (Summer) Time (CE(S)T) and 00:00 time on the MetaTrader server platform (EE(S)T\/GMT+2). There is, however, one more convention being in place for the NZD currency, at a different time compared to a rollover of all other currencies.<\/p>\n<p>The convention established by the New Zealand Financial Markets Association (NZFMA) then sets the rollover time for currency pairs having NZD leg at 07:00 New Zealand Time (Auckland time), which corresponds to 22:00 on the MetaTrader server (EE(S)T\/GMT+3).<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-415632\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/eurnzd15jul.png\" alt=\"\" width=\"701\" height=\"663\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>Since liquidity constraints in the markets during rollovers are characterised by increased volatility and spread widening, traders should beware that this may occur twice for <strong>New Zealand dollar<\/strong> pairs.<\/p>\n<p>Similarly, traders should note that these times change with the daylight saving\/standard time changeover, which occurs at different dates in different places around the world. In the US, the time changes from Daylight Saving Time to Standard Time (in New York from EDT to EST) on the first Sunday in November and in Europe on the last Sunday in October (in Central Europe from CEST to CET). In New Zealand, standard time changes to Daylight Saving Time on the last Sunday in September (in Auckland from NZST to NZDT).<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/Group-4771.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-417850\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/Group-4771.jpg\" alt=\"\" width=\"4101\" height=\"3147\" \/><\/a><\/p>\n<p>In the USA, standard time changes to Daylight Saving Time on the second Sunday in March, and in Europe, it changes on the last Sunday in March. In New Zealand, the time changes from Daylight Saving Time to the standard first Sunday in April.<\/p>\n<p>Traders should be aware that price charts with NZD currency might display volatile price action including spread widening and\/or execution slippages, twice during any given day, corresponding to two individual rollover conventions.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In this article, we&#8217;ll talk about rollovers in Forex, market conventions and what traders should look out for when trading New Zealand dollar pairs. What are market conventions and rollovers? Traders who trade Forex and hold their positions for more than one day had come across the term rollover. In short, it is an extension [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":415753,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/415495"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=415495"}],"version-history":[{"count":10,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/415495\/revisions"}],"predecessor-version":[{"id":428843,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/415495\/revisions\/428843"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/415753"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=415495"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=415495"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=415495"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}