{"id":415881,"date":"2021-09-17T08:40:22","date_gmt":"2021-09-17T06:40:22","guid":{"rendered":"https:\/\/ftmo.com\/?p=415881"},"modified":"2022-01-11T17:07:20","modified_gmt":"2022-01-11T16:07:20","slug":"ftmo-traders-without-risk-management-and-patience-you-will-not-succeed","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/ftmo-traders-without-risk-management-and-patience-you-will-not-succeed\/","title":{"rendered":"FTMO Traders: You will not succeed without patience and proper risk management"},"content":{"rendered":"<p><em>What do traders that have passed the FTMO Challenge and Verification have in common? What would they recommend to others interested in managing the FTMO Account? That’s exactly what we’re going to look at in today’s article, which was inspired by the answers of successful FTMO Traders.<\/em><\/p>\n<p>Forex trading is an individual sport where no one-size-fits-all approach exists. However, this is precisely the appeal of forex trading. Everyone can find a unique, personal style or approach that suits them the best. Despite such individuality, there still are things that most successful traders have in common. From the responses sent to us by the traders that have successfully completed our Evaluation Process, we have selected a few commonalities related to psychology, investment strategies, or risk and money management.<\/p>\n<h2>Trading plan and risk management<\/h2>\n<p>Although the answers of FTMO traders vary and everyone is usually emphasizing something different, there is one thing most of them agree on. Without a solid trading plan and proper risk management, it is impossible to be consistently profitable in forex. FTMO’s Trading Objectives related to Maximum Loss and Maximum Daily Loss are the factors that motivated many traders to create a trading plan that includes rigorous risk management rules.<\/p>\n<p>When developing a trading plan and a strategy, traders generally try to keep it as simple as possible. Too many indicators can create confusion. As mentioned, forex is an individual sport and traders should approach it as such. It is better to spend more time developing your own strategy than trying to copy an approach that may not suit you or that you do not fully understand. Pieces of advice and tips available on the internet may be certainly beneficial, but they can unnecessarily overwhelm the trader with conflicting suggestions and opinions as well.<\/p>\n<h2>Stop Loss is a friend<\/h2>\n<p>Many traders have admitted that they were unable to complete the FTMO Challenge without the following rules. Sticking to risk management, proper RRR setting, and especially a reasonable Stop Loss helps traders to manage their positions better. Trader Philip put it quite accurately when he said that “the only guaranteed outcome you can control as a retail trader are your losses”. Stop Loss is a friend that protects your capital, according to him.<\/p>\n<h2>Backtesting and trading journal<\/h2>\n<p>When creating a plan, thorough backtesting is essential, and no one should start trading without performing some analysis on their strategy first. There is the option of using a Free Trial account for those who want to test their strategy essentially risk-free. However, even here traders point out that although you do not trade with real money on the demo account, it is necessary to behave just like in a real market with a regular broker or during the FTMO Challenge and Verification.<\/p>\n<p>An important tool that has helped many traders in moving towards consistent results is trading journal and analysis of executed trades, which are primarily used to detect incorrect entries and exits. When it comes to losing and generally incorrect trades, traders agree that they should not be considered as a disaster, but as an opportunity to learn and improve your trading skills.<\/p>\n<p>You can also take a look at our video about backtesting.<\/p>\n<div class='avia-iframe-wrap'><iframe loading=\"lazy\" title=\"Backtesting a trading strategy | FTMO\" width=\"1500\" height=\"844\" src=\"https:\/\/www.youtube.com\/embed\/-8f0FaA6l8M?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/div>\n<h2>Patience and discipline<\/h2>\n<p>Trading itself requires patience and discipline. Many traders try to complete the FTMO Challenge or Verification as quickly as possible, but this rather leads to overtrading and unnecessary mistakes. A trading plan that is sufficiently tested is a great start, but if the trader is not disciplined enough, it is very easy to lose the grip with your plan and mistakes and losses will inevitably come. Knowing the rules and following the rules is simply not the same thing. Here we’d like to cite our trader Osadebawen: “you don’t have to be the best trader in the world in order to be profitable, you just have to be well disciplined”.<\/p>\n<p>Good opportunities appear in the market every day, so there is no rush. Don’t be afraid to wait for a good trade. Many traders also take a day off from trading after conceding a losing streak to absorb the losses, analyze the mistakes and get their mindset straight. As trader Khallid recalled: “Rome wasn’t built in a day”.<\/p>\n<p>It is interesting that many traders admitted that Verification, which has significantly less strict rules in regards to the required profit, was actually harder for them. In particular, the problem is that after completing the FTMO Challenge, traders tend to get excited and overly fearless. That leads to undisciplined behaviour, impatience and mistakes that cause the trader to fail the much easier Verification.<\/p>\n<h2>Kill your emotional side<\/h2>\n<p>Don’t get us wrong, we’re still talking only about trading. The psychological aspect is a special chapter of trading that many traders do not pay much attention to. However, psychology ultimately influences your trading performance and is related to all the points discussed above. Trader Shane described trading as ” the ultimate emotion test that will very quickly reveal if you are psychologically evolving or not“. If a trader can admit that emotions are his biggest problem, it is the first step to evolve your trading in the right direction.<\/p>\n<p>Most traders admit that creating a functional plan and following their risk management setup with well-adjusted Stop Losses greatly helps them moderate their emotions, gain the necessary confidence and limit the influence of randomness on their results. The right mental setup is the foundation of success for most traders who have passed the Evaluation Process.<\/p>\n<p>&nbsp;<\/p>\n<p style=\"font-size: 9px;\"><em>All information provided on this site is intended solely for the study purposes related to trading on financial markets and does not serve in any way as a specific investment recommendation, business recommendation, investment opportunity analysis or similar general recommendation regarding the trading of investment instruments. Trading in financial markets is a high-risk activity and it is advised not to risk more than one can afford to lose!<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>What do traders that have passed the FTMO Challenge and Verification have in common? What would they recommend to others interested in managing the FTMO Account? That’s exactly what we’re going to look at in today’s article, which was inspired by the answers of successful FTMO Traders. Forex trading is an individual sport where no [&hellip;]<\/p>\n","protected":false},"author":43,"featured_media":416279,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/415881"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/43"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=415881"}],"version-history":[{"count":7,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/415881\/revisions"}],"predecessor-version":[{"id":424222,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/415881\/revisions\/424222"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/416279"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=415881"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=415881"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=415881"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}