{"id":416448,"date":"2021-09-22T14:21:07","date_gmt":"2021-09-22T12:21:07","guid":{"rendered":"https:\/\/ftmo.com\/?p=416448"},"modified":"2022-01-11T17:06:45","modified_gmt":"2022-01-11T16:06:45","slug":"chat-with-new-ftmo-traders","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/chat-with-new-ftmo-traders\/","title":{"rendered":"Autumn chat with new FTMO Traders"},"content":{"rendered":"<p><em>We bring you another article from the FTMO questions and answers series. This time, new FTMO Traders Dennis, Joey, James, and Milan share their experience gathered in the Evaluation Process as well as their plans for their future at FTMO.<\/em><\/p>\n<p>&nbsp;<\/p>\n<h3>Trader Dennis &#8211; <em>&#8220;Think in probabilities. Do not try to predict the future, because no one can.&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/dennisp.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-416450\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/dennisp.jpeg\" alt=\"\" width=\"300\" height=\"400\" \/><\/a><\/p>\n<p><strong>Describe your best trade.<\/strong><\/p>\n<p>Well, I think that was a DAX trade using the Market Profile. I entered at the Value Area Low and was able to trade it all the way up through the Value Area High, and the breakout after. RRR was something around 1:7.<\/p>\n<p><strong>How did passing the FTMO Challenge and Verification change your life?<\/strong><\/p>\n<p>I&#8217;m very excited to make a consistent income from trading, it will pay my debts and make me able to finally build a saving for me and my family. I was a self-employed music producer for a long time, still doing it, but the pressure of always being creative is huge, and to do it as the main income source can be hard. So with trading, I wanted to generate an income source for me, that is simply about money, self-discipline, and management. And if I do that successfully, I won&#8217;t have to worry about the money anymore, and can do my music without any pressure.<\/p>\n<p><strong>What do you think is the most important characteristic\/attribute of a profitable trader?<\/strong><\/p>\n<p>I think that is not one particular attribute or characteristic, but being aware of the whole psychological aspect in trading and the reasons why most of the traders lose their money. When I read the book &#8220;Trading In The Zone&#8221; by Mark Douglas, that&#8217;s what opened my eyes towards the system of probabilities, to realize what is in your control and what is not, especially in trading. This helps to get rid of the psychological or emotional drama involved and simply do the work as a trader. That is opening trades, setting the TP and SL levels, and managing the risk.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/Screenshot-2021-09-21-at-12.43.40.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-416455\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/Screenshot-2021-09-21-at-12.43.40.png\" alt=\"\" width=\"757\" height=\"913\" \/><\/a><\/p>\n<p><strong>What do you think is the key to long-term success in trading?<\/strong><\/p>\n<p>Consistency and no emotional entanglement. I heard some are just displaying points in MetaTrader, not $ or € values, to stop them from becoming scared or greedy. It makes sense to me, I try not to think about the money, but instead, I think in percentages and the numbers that I&#8217;ve set as my set of rules prior to trading. That is my only task, to follow those rules.<\/p>\n<p><strong>What was more difficult than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p>I don&#8217;t know why, probably there is no reason for it, but when I began my Verification, I had a huge drawdown of about -7000 Dollars, in other words, -7%. That was very intense, psychologically, but I trusted my system and kept on trading, and went up from -7000 to +5000 $ in an almost straight line :).<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>Make sure you&#8217;ve checked these things before trying to become an FTMO Trader, 1: Have a strategy that you like, 2: Have a setup and risk management that fits your strategy, psychology, and the rules of FTMO, 3: Think in probabilities and try not to predict the market, because no one can.<\/p>\n<h3>Trader Joey &#8211; <em>&#8220;Stay true to a positive mindset and of course, never forget your risk management&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/JoeyP.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-416461\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/JoeyP.jpeg\" alt=\"\" width=\"200\" height=\"423\" \/><\/a><\/p>\n<p><strong>What was more difficult than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p>The Challenge or Verification itself wasn&#8217;t more difficult than I expected. It was all about being in the right mindset during the whole Challenge and Verification period. For me, that meant I embedded trading in my life. However, I didn&#8217;t expect that it would be that difficult to stay true to my trading plan and the intentions I had set out for the day to get closer to the target of the Challenge\/Verification. My plan consisted of a maximum number of trades I would set out for the day, as well as the losses I would take. Of course, I failed a few times to stay true to my targets for the day, but when I truly took control of the market by waiting for the right positioning, then instead of having to chase the market, the market came to me.<\/p>\n<p><strong>How did passing the FTMO Challenge and Verification change your life?<\/strong><\/p>\n<p>It changed everything for me. Everyone had doubts and not everyone believed in me when I told them I would do the Challenge to become free from the main working industry. But now, I finally can prove to everyone that I have my freedom. I can work wherever I want. I only need my phone with me and I can trade anywhere in the world.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/JoeyM.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-416466\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/JoeyM.png\" alt=\"\" width=\"761\" height=\"918\" \/><\/a><\/p>\n<p><strong>Describe your best trade.<\/strong><\/p>\n<p>The best trade is when I have all the time in the world and I don&#8217;t have to chase the market. It is when I&#8217;m so patient the market moves to me and I take the trade I have already seen in my analyses.<\/p>\n<p><strong>What do you think is the most important characteristic\/attribute of a profitable trader?<\/strong><\/p>\n<p>Stay true to a positive mindset and of course, never forget your risk management. Besides that, it is most important to be rational while trading. Don&#8217;t get emotional over how much percentage you can lose and be rational about the wins you take. Have everything analysed and calculated.<\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>Sometimes when I lose.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>Well, hello new challenger, and good luck. Here are a few tips: don&#8217;t be greedy during the Challenge, be patient, analyse the market and search it. Most importantly, don&#8217;t buy or sell when you see the market is already moving. Wait till the market reaches the point you set out and the move you want to take.<\/p>\n<h3>Trader James &#8211; <em>&#8220;I know my strategy is profitable so if I have a losing trade, I instantly move on to the next one.&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/JamesP.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-416471\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/JamesP.jpeg\" alt=\"\" width=\"300\" height=\"169\" \/><\/a><\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>I traded on demo accounts a lot and kept doing them until I was consistently making profits. I pretended to do the Challenge on the demo account all the time until I was really comfortable I could tackle it for real.<\/p>\n<p><strong>How did you manage your emotions when you were in a losing trade?<\/strong><\/p>\n<p>I just don’t really think too much into a losing trade tbh. I know my strategy is profitable so if I have a losing trade, I instantly move on to the next one.<\/p>\n<p><strong>What do you think is the most important characteristic\/attribute of a profitable trader?<\/strong><\/p>\n<p>To be honest, I’m not really sure, but just work hard and keep putting the effort in. I just enjoy trading so much so learning and wanting to improve constantly is not a chore for me.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/JamesM.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-416476\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/JamesM.png\" alt=\"\" width=\"761\" height=\"918\" \/><\/a><\/p>\n<p><strong>How did Maximum loss limits affect your trading style?<\/strong><\/p>\n<p>Not too much, I’m more concerned about the daily limit. Because on some days, you can have 2 or 3 trades that haven’t gone your way and hit stop loss, which can bring you close to the daily limit, so I’m always watching that. But if I am close, I’ll just stop trading for the rest of the day and continue on the next one.<\/p>\n<p><strong>Describe your best trade.<\/strong><\/p>\n<p>Think it was USDJPY short. I was waiting days for it to come up to a really important resistance level and when it did, it worked out perfectly for me.<\/p>\n<p><strong>One piece of advice for people starting the FTMO Challenge now.<\/strong><\/p>\n<p>I would say do the demo and pretend it’s the Challenge, also stick to the rules and when you pass it 3 times in a row, do the Challenge then. Take your time and don’t overtrade!<\/p>\n<p>&nbsp;<\/p>\n<h3>Trader Milan &#8211; <em>&#8220;Treat it with respect and never ever deviate from your trading strategy.&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/MilanP.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-416481\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/MilanP.jpeg\" alt=\"\" width=\"300\" height=\"300\" \/><\/a><\/p>\n<p><strong>How did you manage your emotions when you were in a losing trade?<\/strong><\/p>\n<p>The only time when I have a problem with my emotions is when I take a trade that I was not supposed to take, meaning it is not according to my strategy, regardless of whether it is a losing or a winning trade. If I am in a losing trade which should be played since it is according to my strategy, I do not have any emotional response since I know that this is a game of probabilities.<\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>Yes, it has, and it still does to this day. The good thing is it became less and less prevalent as time goes by and I am gaining experience and control over my emotions. The biggest problem is taking the trades that do not fully obey the rules, meaning patience is the key.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/MilanM.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-416486\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/09\/MilanM.png\" alt=\"\" width=\"761\" height=\"918\" \/><\/a><\/p>\n<p><strong>What was easier than expected during the FTMO Challenge or Verification?<\/strong><\/p>\n<p>Nothing was easier. I had a tumultuous period in life during the Challenge so it went far harder than I originally thought it would. I had my profit target so I calculated how long would it take for me to reach it. However, it took far longer than expected, due to way too many mistakes that I made. It should&#8217;ve been relatively easy, yet I made it hard. But again, it is a game of emotions and probabilities.<\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p>My impatience.<\/p>\n<p><strong>What did you find as the most challenging part of the Evaluation Process and how did you deal with it?<\/strong><\/p>\n<p>My patience. I overcame it by simply getting serious, and stopping acting inappropriately.<\/p>\n<p><strong>One piece of advice for people starting the FTMO Challenge now.<\/strong><\/p>\n<p>Do not take it easy, because it is not. Treat it with respect and never ever deviate from your trading strategy.<\/p>\n<div class=\"entry-content\">\n<p>__________<\/p>\n<div class=\"entry-content\">\n<div class=\"entry-content\">\n<p><em>Editorial note<\/em>: <em>All responses are 100% organic and received from our new FTMO Traders during the contract signing process. All responders agreed to have their feedback published and all their answers are not being edited by FTMO, hence they can include grammatical mistakes or typos. <\/em><\/p>\n<\/div>\n<\/div>\n<\/div>\n<footer class=\"entry-footer\">\n<section class=\"author-box\">\n<div class=\"author_description\">\n<div class=\"author_description_text\"><\/div>\n<\/div>\n<\/section>\n<\/footer>\n","protected":false},"excerpt":{"rendered":"<p>We bring you another article from the FTMO questions and answers series. This time, new FTMO Traders Dennis, Joey, James, and Milan share their experience gathered in the Evaluation Process as well as their plans for their future at FTMO. &nbsp; Trader Dennis &#8211; &#8220;Think in probabilities. Do not try to predict the future, because [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":416544,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[672],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/416448"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=416448"}],"version-history":[{"count":4,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/416448\/revisions"}],"predecessor-version":[{"id":424034,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/416448\/revisions\/424034"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/416544"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=416448"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=416448"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=416448"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}