{"id":416565,"date":"2021-09-24T09:33:33","date_gmt":"2021-09-24T07:33:33","guid":{"rendered":"https:\/\/ftmo.com\/?p=416565"},"modified":"2022-01-11T17:06:37","modified_gmt":"2022-01-11T16:06:37","slug":"liquidity-providers","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/liquidity-providers\/","title":{"rendered":"What role do liquidity providers play in Forex?"},"content":{"rendered":"<p><em>We recently wrote an article about how market liquidity affects volatility. This time, we&#8217;ll look at where the liquidity in the market actually comes from, and how it&#8217;s possible for retail traders to open relatively large positions with little capital thanks to leverage.<\/em><\/p>\n<p><span style=\"font-weight: 400;\">Forex traders often don&#8217;t bother to wonder where the funds they trade with actually come from. This is even despite the fact that they are fully aware that their own deposited money represents just a small portion of the funds they can control thanks to leverage. So where does the rest of the money that retail traders (but not only them) trade with come from?<\/span><\/p>\n<h2>You can&#8217;t do it without liquidity<\/h2>\n<p><span style=\"font-weight: 400;\">Sufficient liquidity is essential in all financial markets. In forex, as the most liquid market, it is also quite naturally crucial. Without the liquidity, we would not be able to comfortably execute trades in almost real-time, especially in less popular markets.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The lack of liquidity in the forex market was most evident in early 2015 when the Swiss central bank surprisingly stopped pegging the Swiss franc to the Euro. The surprise and the level of uncertainty caused by the move forced liquidity-providing companies to literally pull their money out of the market and for several minutes, it was even impossible to open new positions or close existing ones. This of course led to immense losses in retail accounts as well as to the bankruptcy of some brokerage firms.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If a firm uses multiple quality liquidity providers (LPs) that will provide access to the liquidity pool, traders can execute their orders with much smaller gaps and slippages even with less liquid instruments. For the most liquid instruments, liquidity providers are able to feed the price with absolutely minimum spreads.<\/span><\/p>\n<h2>Liquidity providers vs brokers<\/h2>\n<p><span style=\"font-weight: 400;\">Liquidity providers are institutions that create liquidity through their buy and sell orders, which then allow other market participants to open and close their own positions. The most renowned group of liquidity providers, or Tier 1 LPs, includes large global banks such as Deutsche Bank, JPMorgan, Citibank, large non-bank companies, hedge funds, etc. These companies form the basis of forex as a market and can profit from the price movement of underlying assets as well as from the difference between the bid and ask price, i. e. spread. On the other hand, other participants benefit from the liquidity that these firms maintain in the market.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Tier 2 liquidity providers then act as intermediaries between the Tier 1 group and the end clients, technically working as brokers. They make money on fees or spreads, match large volumes of buy and sell orders and in some cases, can also hedge the positions of their clients.<\/span><\/p>\n<h2>STP, ECN, Market maker<\/h2>\n<p><span style=\"font-weight: 400;\">The first group of brokers works as direct mediators with the LP group, which gives them plenty of liquidity and the ability to offer very interesting spreads. The positions opened by clients are covered by liquidity from the LP side, these brokers do not have to hedge their clients’ positions. STP brokers profit by applying their margin on the spread, while ECN brokers charge a fee for each order but offer lower spreads.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Brokerage firms that do not use the services of large liquidity providers act as liquidity providers or market makers themselves. These firms profit mainly from spreads, but may also open positions against their clients, which could cause their customers to experience relatively significant slippages in less liquid markets.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Due to the increasing regulation in the markets after the financial crisis, it is not easy to find quality liquidity providers today. Strict capital requirements and restrictions on general proprietary trading and the associated risk aversion have led many banks to rather start using services of other, larger banks. One of the outcomes is liquidity recycling and a declining number of Tier 1 LPs<\/span><\/p>\n<p><span style=\"font-weight: 400;\">When selecting a reliable liquidity provider, brokers or prop trading firms must pay attention to the company&#8217;s capital stability, transparency, credibility, technological background, the market in which it operates, or the regulatory rules to which the provider subjects. Unregulated firms that have a history of market manipulation are certainly not a good candidate to operate as LPs.<\/span><\/p>\n<h2>FTMO and liquidity<\/h2>\n<p><span style=\"font-weight: 400;\">FTMO strives to provide its traders with the best possible conditions available on the market and uses the services of several top liquidity providers, both for forex and for CFDs commodities, indices and cryptocurrencies. This allows us to offer our clients very competitive spreads as well as attractive fees.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>We recently wrote an article about how market liquidity affects volatility. This time, we&#8217;ll look at where the liquidity in the market actually comes from, and how it&#8217;s possible for retail traders to open relatively large positions with little capital thanks to leverage. Forex traders often don&#8217;t bother to wonder where the funds they trade [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":416629,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/416565"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=416565"}],"version-history":[{"count":4,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/416565\/revisions"}],"predecessor-version":[{"id":424221,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/416565\/revisions\/424221"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/416629"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=416565"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=416565"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=416565"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}