{"id":416914,"date":"2021-09-30T10:04:37","date_gmt":"2021-09-30T08:04:37","guid":{"rendered":"https:\/\/ftmo.com\/?p=416914"},"modified":"2023-10-23T15:42:23","modified_gmt":"2023-10-23T13:42:23","slug":"why-trading-without-stop-loss-is-not-a-good-idea","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/why-trading-without-stop-loss-is-not-a-good-idea\/","title":{"rendered":"Why trading without Stop Loss is not a good idea"},"content":{"rendered":"<p><em>Many retail traders cannot imagine trading without Stop Loss, yet there is a relatively large amount of traders who do not use Stop Loss in their trading. For large institutional traders, this may not be a big problem due to their capabilities, but retail traders should think twice before trading without SL. We will discuss this topic further in our latest article.<\/em><\/p>\n<p>Although Stop Loss is considered one of the most important elements of achieving sustainable profits among retail traders, there are still many traders who do not use Stop Loss for whatever reason. There are even many articles and videos on the internet that explicitly discourage the use of Stop Loss.<\/p>\n<h2>Patience vs short-term fluctuations<\/h2>\n<p>The most common argument made by proponents of the no Stop Loss approach is that without SL, the trader is giving the market an opportunity to breathe, or allowing the price to move in the wrong direction before heading in the direction the trader wants. In short, trading without SL protects the trader from losses caused by short-term fluctuations in the market. However, this can be solved by the trader being patient and not opening positions too hastily or setting too tight Stop Losses.<\/p>\n<p>Another argument for not using Stop Losses is the so-called Stop Loss hunting, where, hypothetically, large traders or brokers deliberately manipulate the price in such a way as to &#8220;throw&#8221; retail traders out of the market and profit from it. But it&#8217;s all about how the trader sets their Stop Loss again. These manipulations can happen near the important levels of supports and resistance. The only thing a trader has to do is wait for a pullback again or set a proper Stop Loss to avoid these market manipulations. When an important level is actually broken, the Stop Loss protects serves its purpose to protect the capital. Without it, the damage can be huge, especially if the trader is unable to react fast enough and still hopes for a trend reversal.<\/p>\n<h2>A strong will and stress<\/h2>\n<p>When a trader doesn&#8217;t have a strong enough will to absorb losing trades that don&#8217;t turn out in their favour, it can be a big problem. Beginners in particular feel that if necessary, they will be able to close a trade without losing a lot of money. In fact, the opposite is true. Such stressful decision making usually does not lead to the right decisions. Most of the time the trader tells himself for so long that the price will surely turn back in their favour until it is finally too late. Not to mention if some unexpected event or news appear in the markets, not even mentioning any possible technical problems.  If these occur, it is virtually impossible to close a trade.<\/p>\n<p>For most traders who trade with stop losses, the main reason is just psychological comfort. In short, the trader knows right from the opening of the trade how much money he will lose if the market does not move in the right direction. He doesn&#8217;t have to be tied to a screen watching if the price has reached a level at which the loss is already too high. Trading without losses does not exist, and when a trader already anticipates the possibility of a loss when he opens a trade and has it fixed, he avoids acting under stress and can manage his risk better.<\/p>\n<h2>Hedging is not for everyone<\/h2>\n<p>One way to avoid placing a Stop Loss is, of course, hedging. Traders can enter opposite positions on the same pair, or take advantage of correlations in certain currency pairs, temporarily limiting their losses this way. However, markets may not always behave predictably, correlations are never 100% and in the worst-case scenario, both open positions of a trader may be significant losers. Again, this ends up in very difficult decision making under stress, which usually leads to significant losses.<\/p>\n<p>Professional traders with large enough capital can of course limit their losses by reducing leverage, but in the case of retail investors, leverage is the very tool that allows them to make interesting profits even with relatively small capital on their own <a href=\"https:\/\/ftmo.com\/en\/\">funded trading accounts<\/a>.<\/p>\n<p>In the case of traders attempting to obtain an FTMO Account or have already passed the Verification phase, the use of stop losses is virtually essential. The Trading Objectives determining the maximum loss and maximum daily loss are crucially important and those who do not use Stop Losses are very likely to lose their account sooner or later. It is the rigid rules ensuring that traders will be cautious enough at the FTMO Challenge, Verification, or FTMO Account to not try being over-exposed with dangerously high risk, but rather focusing on consistent returns.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Many retail traders cannot imagine trading without Stop Loss, yet there is a relatively large amount of traders who do not use Stop Loss in their trading. For large institutional traders, this may not be a big problem due to their capabilities, but retail traders should think twice before trading without SL. We will discuss [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":417508,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/416914"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=416914"}],"version-history":[{"count":4,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/416914\/revisions"}],"predecessor-version":[{"id":596320,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/416914\/revisions\/596320"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/417508"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=416914"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=416914"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=416914"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}