{"id":417721,"date":"2021-10-08T07:02:11","date_gmt":"2021-10-08T05:02:11","guid":{"rendered":"https:\/\/ftmo.com\/?p=417721"},"modified":"2022-01-11T17:05:56","modified_gmt":"2022-01-11T16:05:56","slug":"how-to-use-the-power-of-the-trend-to-achieve-higher-profits","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/how-to-use-the-power-of-the-trend-to-achieve-higher-profits\/","title":{"rendered":"How to use the power of the trend to achieve higher profits"},"content":{"rendered":"<p><em>Every forex trader knows that the key to success is maximizing your profits and minimizing your losses. There are many ways to achieve this, but it mostly depends on the trader&#8217;s experience and mental resilience. One of such ways can be increasing the position while the trade lasts. <\/em><\/p>\n<p>Most traders who fail to achieve long-term and stable returns tend to take the opposite approach and close trades with too little profit. A better approach may be to &#8220;lock-in&#8221; a partial return by closing a portion of the position when a certain profit is made. He may do so on several occasions, but in case of a strong trend, this so-called scaling out reduces the potential profit by worsening the RRR.<\/p>\n<p>However, the advantage of this approach is to close at least some profit in a market that fails to sustain a strong trend or when the price approaches important support or resistance level. For many traders, this approach has a positive effect on the psyche because they do not have to worry about ending up with zero or in the red again when the trend reverses.<\/p>\n<h2>Scaling in and pyramiding<\/h2>\n<p>The opposite case is scaling in when a trader does not enter the market at once but plans multiple entries. One way is scaling up positions when the trader is in a losing position, the other is scaling up positions in a profitable trade. The first approach will not be discussed in this article, but it should be mentioned that it is in no way recommended for inexperienced traders and is only for someone who really knows what they are doing.<\/p>\n<p>The second approach, called pyramiding, is based on increasing positions in a profitable trade. For most traders, this approach is unnatural because they feel that entering a position at a higher price than the original price makes no sense. This approach is also not recommended for inexperienced traders, but it does have several advantages, which are especially evident in a strong trending market.<\/p>\n<h2>Higher profit and lower risk? It&#8217;s possible<\/h2>\n<p>If executed correctly, the trader can increase their profit without increasing the risk, thus also improving their RRR. When a trend develops in a market, it is simply a shame not to use it to make higher profits than originally planned. Pyramiding is more for swing traders, but it can also be used by intraday traders who catch a significant daily movement.<\/p>\n<p>The basic idea behind this approach is to make the most of a strong trend but limit losses in the event of an adverse trend. To be successful, a trader must have a predetermined size of the positions they will open and the risk on each position. If they want to risk a maximum of 2% on a trade, the SL on the first open position should definitely not exceed 1%. This limits the risk of the trade, because in case of an adverse development right after opening, the trader will experience a relatively small loss.<\/p>\n<h2>Rules are important<\/h2>\n<p>A trader must realize that by adding positions in the direction of their trade, the average price or odds deteriorate with each successive trade. If the trend is too short or moves sideways, this limits the profit potential. This is also why it is not recommended to increase the size of the position on additional entries. When the size of the first position is one lot, the size of the second position and subsequent positions should not exceed one lot. If the size of the additional positions were to increase, their SL would either be too large or would have to be too &#8220;tight&#8221;, increasing the risk of an early exit with lower profits.<\/p>\n<p>Another important risk-reducing feature is moving the stop loss when opening additional positions. Thus, when opening a second position, the trader can move the Stop Loss above the average price, thus ensuring at least a minimum profit when the trend reverses. In the case of a strong trend, the SL of the new position compensates for the profits from the previous positions.<\/p>\n<p>It is ideal to describe the strategy of entering and shifting SL in one example. The trader could make the first entry on the EURJPY pair at the price of 128.8 with the SL set at 23 pips. The market formed a trend, so after some time, he could shift the SL to break even. He could open an equally large position at the price of 129.35. The theoretical profit on the first trade would be 32 pips, the loss on the second trade would be 23 pips, unless there is some quick move to the downside.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-417747\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/EURJPY-1H-III-trend-support.png\" alt=\"\" width=\"1624\" height=\"747\" \/><\/p>\n<p>The third trade after a bounce from the trend line could be placed at 129.8, again with SL at 23 pips. The theoretical loss from the third trade will be 23 pips, but the profit from the first trade is already 77 pips and from the second one, it is 22 pips. After another bounce from the trend line, a fourth trade will be opened at 130.40 points, with an SL being coincidentally 23 pips again. However, the profit from the first trade at this SL will already be 137 pips, the second one will be 82 points and the third one will be 37 pips. If the trader had not set the Take Profit, his profit after the SL at 130.17 would theoretically be up to 233 pips. If he did not increase his position, his profit would be 137 pips, which is almost a 100-pips difference.<\/p>\n<p>Of course, you need to subtract commissions and possible swaps. Even so, the trader&#8217;s profit is very interesting and the RRR at an initial SL of 23 pips is around 10:1. Without increasing the position, it would be less than 6:1. This is of course a theoretical trade, but it could have actually been executed on the EURJPY pair between Aug 24 and Sep 9, 2021.<\/p>\n<h2>You can&#8217;t do it without risks<\/h2>\n<p>However, not to praise, it is necessary to mention the downsides of this approach. As already mentioned, this approach is not for inexperienced traders and is only suitable for very strong trends that may not occur very often. Thus, patience is needed. For swing traders, the biggest potential risks are weekend gaps and spreads during rollovers, which can send even a well-developing trade into a loss or end it unnecessarily early with minimal profit.<\/p>\n<p>As a trader increases his position, he should think about the size of his margin. Every extra trade reduces the required margin (traders on a Swing account only have 30:1 leverage), which could be used on other trades with interesting profit potential.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every forex trader knows that the key to success is maximizing your profits and minimizing your losses. There are many ways to achieve this, but it mostly depends on the trader&#8217;s experience and mental resilience. One of such ways can be increasing the position while the trade lasts. Most traders who fail to achieve long-term [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":417821,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[162],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/417721"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=417721"}],"version-history":[{"count":7,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/417721\/revisions"}],"predecessor-version":[{"id":611112,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/417721\/revisions\/611112"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/417821"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=417721"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=417721"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=417721"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}