{"id":418000,"date":"2021-10-13T10:30:19","date_gmt":"2021-10-13T08:30:19","guid":{"rendered":"https:\/\/ftmo.com\/?p=418000"},"modified":"2022-01-11T17:05:15","modified_gmt":"2022-01-11T16:05:15","slug":"new-ftmo-traders-and-their-journey","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/new-ftmo-traders-and-their-journey\/","title":{"rendered":"Experience shared by new FTMO Traders joining us in Q4 of 2021"},"content":{"rendered":"<p><em>A new edition of Q&amp;A with our FTMO Traders is here. Find out how our trader Muhammed dealt with his FOMO during the Evaluation Stage or take a moment to read a piece of advice by Anthony aimed at traders that are new to FTMO below.<\/em><\/p>\n<p>&nbsp;<\/p>\n<h3>Trader Nermis &#8211; <em>&#8220;Focus on controlling mind state and emotions.&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/nermisp.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-418022\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/nermisp.jpeg\" alt=\"\" width=\"150\" height=\"287\" \/><\/a><\/p>\n<p><strong>What do you think is the key to long-term success in trading?<\/strong><\/p>\n<p>Personally, I think that the key to long term success in trading is to develop a good strategy. Once defined, establish that strategy as a lifetime commitment, keeping in mind that fine-tune to dynamic changes of the market is always necessary for your strategy.<\/p>\n<p><strong>How did you manage your emotions when you were in a losing trade?<\/strong><\/p>\n<p>Simple, I understand that trading is all about controlling your emotions and that temperance makes the difference between success and failure. Keeping a controlled mind state is the most important part of consistent trading. One needs to accept that losing sometimes is part of trading. If you accept this outcome when it happens, you&#8217;ll be able to make corrections and move forward.<\/p>\n<p><strong>How did Maximum loss limits affect your trading style?<\/strong><\/p>\n<p>Maximum loss limits forced me to strategically adjust my trading risk management approach to cutting losses through stop orders, profit-taking, and protective puts in a smart way to stay in the game.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/nermisp.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-418030\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/nermisp.png\" alt=\"\" width=\"1504\" height=\"1464\" \/><\/a><\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>Yes, but once temperance was gained and became confident with my trading strategy,&#8230; it happened no more.<\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>Of course, my trading plan\/strategy is essential, and I need to follow it if I want to be profitable.<\/p>\n<p><strong>What is the number one advice you would give to a new trader?<\/strong><\/p>\n<p>Focus on controlling mind state and emotions. Take time to understand the psychology behind trading.<\/p>\n<h3>Trader Mohammed &#8211; <em>&#8220;FTMO helps the trader behave better and engage his professionalism&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/mohammedp.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-418037\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/mohammedp.jpeg\" alt=\"\" width=\"300\" height=\"300\" \/><\/a><\/p>\n<p><strong>Describe your best trade.<\/strong><\/p>\n<p>Every correct setup trade is my best trade<\/p>\n<p><strong>How would you rate your experience with FTMO?<\/strong><\/p>\n<p>Before being a funding company, FTMO help the trader behave better and engage his professionalism, discipline together with his trading skills and test them in the real market. It is sure that a successful FTMO Trader is completely different, way better than a trader who is not. Thank you FTMO.<\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>At the beginning of my trading journey, I was always ok with the technical stuff, but my real enemy was myself and my psychology. After doing the FTMO challenge\/verification several time, this was a real therapy that helped me bypass this handicap. Now I have much more control over my psychology.<\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/mohammedm.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-418045\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/mohammedm.png\" alt=\"\" width=\"1504\" height=\"1464\" \/><\/a><\/p>\n<p><strong>How does your risk management plan look like?<\/strong><\/p>\n<p>I only jump on trades with high to very high profit and success potential, I set a B plan before entering any trade. I always exit a trade at least at a breakeven or a small profit, but when it is necessary I don&#8217;t care closing a trade with loss as there is always a tomorrow in trading.<\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>I have setup a solid trading strategy based on a long journey (up to 4 years of trading), I was able to overcome my psy and can control my risk, I think I can be profitable on the long go and this motivates my journey.<\/p>\n<p><strong>What is the number one advice you would give to a new trader?<\/strong><\/p>\n<p>Set a plan before you do anything &#8211; Stick on few symbols that you should be familiar with, don&#8217;t suddenly jump on any symbol. &#8211; Have a logic on what you are doing, and recognize your real results, not your wishes. &#8211; The market is what it is, we only have control on our actions and our behavior. &#8211; Don&#8217;t be upset if you fail a challenge, that&#8217;s a step among many towards your professional career.<\/p>\n<p>&nbsp;<\/p>\n<h3>Trader Muhammed &#8211; <em>&#8220;I eliminated the factor of luck in my trading by forward testing my strategy for over a year.&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/Muhammedp.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-418059\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/Muhammedp.jpeg\" alt=\"\" width=\"300\" height=\"299\" \/><\/a><\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>My psychology has affected my trading plan numerous times in the beginning stages of my trading journey, I&#8217;ve allowed my fear of losing or euphoria of making money to dictate my behaviour far too many times to realise its only best to leave emotions at the door, you can really sabotage yourself by trading emotionally, its really important to look at the market objectively while doing the right things outside of your trading to help aid good psychology and optimal performance i.e. getting good sleep, eating correctly, exercising, meditating and having a good morning\/evening routine. I really recommend reading &#8220;Trading in the zone&#8221; by Mark Douglas multiple times until you truly Own the book.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>I eliminated the factor of luck in my trading by forward testing my strategy for over a year, while journaling what worked and what didn&#8217;t work over a large sample size of trades, this gave me the unshakeable confidence that I have a true edge in the market to be consistently profitable<\/p>\n<p><strong>What do you think is the most important characteristic\/attribute to become a profitable trader?<\/strong><\/p>\n<p>I believe there are many important characteristics and attribute to become a profitable trader but the main one is having consistency. How can someone even think to become profitable in the market if they&#8217;re inconsistent with their trading plan and approach?<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/Muhammedp.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-418065\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/Muhammedp.png\" alt=\"\" width=\"1504\" height=\"1464\" \/><\/a><\/p>\n<p><strong>How does your risk management plan look like?<\/strong><\/p>\n<p>I only risk 1-2% of capital per trade which allows me to keep my head above water during times of drawdown. I never over expose myself to a single currency, and lastly Im hardly in more than 3 trades at one time. I like to limit my maximum exposure to the market at one time to 3% or less.<\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>I would say passing the challenge and verification was a process that allowed me to learn so much about myself as a trader and to gain a large amount of capital to work with at the same time. it has changed my life as there is no cap to how much I can earn. I believe the biggest change to my life will be when I leave my current occupation due to earnings from FTMO&#8230; that possibility has no presented itself amongst many others 🙂<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>I firstly want to shout out my trading mentor Gio Paris for creating an exceptional course and platform for anyone and struggling with trading, if it wasn&#8217;t for him I wouldn&#8217;t be where I am in a year. My main tips for anyone attempting the challenge would be to focus on the process and not to be so attached to the outcome of the trades. Truthfully stick to your rules and have that patience to sit on your hands while cherry-picking those trades, And never give up. I passed 3 challenges and failed 2 of the verifications, and then passed my 200k verification. If I gave up on my failures rather than using them as stepping stones I wouldn&#8217;t have passed the third time, You can all do this.<\/p>\n<h3>Trader Anthony &#8211; <em>&#8220;Quality over quantity.&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/anthonyp.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-418075\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/anthonyp.jpeg\" alt=\"\" width=\"150\" height=\"188\" \/><\/a><\/p>\n<p><strong>Describe your best trade.<\/strong><\/p>\n<p>When I go for a trade, I try to catch at least a 1:3R move. This means for every 1% I risk, I&#8217;m looking to get back a minimum of 3%; it doesn&#8217;t always work out this way so sometimes I may have to close earlier but it all depends on price action at the moment. My personal best trade was a 1:17R. Although I only risked.25%, I still managed to get a return of 4.25% off of one trade while barely risking anything. This was on EURUSD, I mapped out supply and demand zones on the 4h and 1hr to get a sense of direction then when the price came to one of my demand zones, I dropped to a lower time in the 3min and found where I wanted the price to react off of. I set a buy limit at the exact price with a very small stop loss of 4 pips and sure enough, it did exactly what I imagined it would do; bought up 68 pips right from my entry point and the rest is history.<\/p>\n<p><strong>How did you manage your emotions when you were in a losing trade?<\/strong><\/p>\n<p>The way I manage my emotions starts before even placing the trade. I do so by understanding the risk I have set for each move. If you are in a trade and worried about it hitting stop loss, in most cases this would mean you are risking too much. Of course it doesn&#8217;t feel good when in drawdown but you must understand it&#8217;s a part of the game and there is absolutely no way you can avoid it.<\/p>\n<p><strong>Where have you learnt about FTMO?<\/strong><\/p>\n<p>I learned about FTMO from one of my friends that was trading before I even started. He would always say he was trying this challenge called FTMO and I never understood what it was. Couple months later and I looked more into the company, I really liked what the mission and goals were for everyday traders like me and them wanting to help us out so I gave it a shot. Here I am now and after a couple attempts, gratefully able to be a funded trader under the firm.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/Anthonym.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-418083\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/Anthonym.png\" alt=\"\" width=\"1504\" height=\"1464\" \/><\/a><\/p>\n<p><strong>What was the most difficult during your FTMO Challenge or Verification and how did you overcome it?<\/strong><\/p>\n<p>I would say what was most difficult honestly was the personal psychology part. I believe that the rules and objectives set in place by FTMO are pretty fair, mainly because they obviously only want good traders under them to handle the capital so it must be atleast a bit tricky. The psychology is most hard because not only do you have to worry about your risk management per trade, there&#8217;s also the daily loss limit, overall loss limit, time period it must be done by, the news, etc. Once you get over the rules and understand why they&#8217;re set in place, it becomes easier to trade without the pressure.<\/p>\n<p><strong>How did Maximum loss limits affect your trading style?<\/strong><\/p>\n<p>With the maximum loss limits, you really just need to understand your risk per trade and manage accordingly to price action. Personally I only like to risk .25%-.5% per trade most of the time so understanding if I lost the trade that the world wouldn&#8217;t be over, makes it much more mindful to use proper risk to reward.<\/p>\n<p><strong>One piece of advice for people starting the FTMO Challenge now.<\/strong><\/p>\n<p>The number one thing I always stress to people in trading is to have patience and use proper risk management. You don&#8217;t need to place trades every hour every day, wait for a good setup to occur then react. Quality over quantity. And when it comes to risk management, only risk what you are willing to lose. Assume before even placing the trade that you already lost it, this will make you feel more comfortable when taking a loss.<\/p>\n<p>__________<\/p>\n<div class=\"entry-content\">\n<div class=\"entry-content\">\n<p><em>Editorial note<\/em>: <em>All responses are 100% organic and received from our new FTMO Traders during the contract signing process. All responders agreed to have their feedback published and all their answers are not being edited by FTMO, hence they can include grammatical mistakes or typos. <\/em><\/p>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>A new edition of Q&amp;A with our FTMO Traders is here. Find out how our trader Muhammed dealt with his FOMO during the Evaluation Stage or take a moment to read a piece of advice by Anthony aimed at traders that are new to FTMO below. &nbsp; Trader Nermis &#8211; &#8220;Focus on controlling mind state [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":418126,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[672],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/418000"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=418000"}],"version-history":[{"count":4,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/418000\/revisions"}],"predecessor-version":[{"id":422682,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/418000\/revisions\/422682"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/418126"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=418000"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=418000"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=418000"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}