{"id":418138,"date":"2021-10-15T12:39:00","date_gmt":"2021-10-15T10:39:00","guid":{"rendered":"https:\/\/ftmo.com\/?p=418138"},"modified":"2022-01-11T17:04:20","modified_gmt":"2022-01-11T16:04:20","slug":"adding-to-a-losing-position-a-risk-that-can-pay-off","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/adding-to-a-losing-position-a-risk-that-can-pay-off\/","title":{"rendered":"Adding to a losing position? A risk that can pay off"},"content":{"rendered":"<p><em>One of the basic rules of trading states that a trader should never increase his\/her positions when he\/she is at a loss. However, some traders still use this method of position management while still remaining successful. How to do it properly without causing too much damage? We will explore that in this article.<\/em><\/p>\n<p>In our last article, we wrote about <a href=\"https:\/\/ftmo.com\/en\/how-to-use-the-power-of-the-trend-to-achieve-higher-profits\/\" target=\"_blank\" rel=\"noopener\">pyramiding<\/a>, an approach where a trader can effectively increase the position profit potential by increasing his\/her position without having to take on more risk. Today, we&#8217;ll talk about the second method of increasing positions called scaling in, where a trader increases his\/her positions while being at loss during the course of a trade.<\/p>\n<p>At the outset, it is important to note that this is not at all recommended for inexperienced traders. Many traders will find this approach, as in the previous case, illogical. However, there are those who are unable to reconcile with closing the losing positions and, believing in a turnaround, try to make up for their losses by increasing their positions. However, when this action is not carried out in a planned manner and with a predetermined risk, it is doomed to failure.<\/p>\n<h2>A clear plan is essential<\/h2>\n<p>The trader must know in advance where he will enter the market and how large his positions will be. This approach takes into account that the first entry into a trade may not be ideal. Increasing the position allows the trader to enter the market in an even better position and average the situation in his favour. The stop loss on the first position is only a fraction of the amount the trader is willing to risk on that trade. While this reduces his potential profit on the trade if the market moves in the right direction from the start, it primarily reduces the potential risk.<\/p>\n<h2>Dealing with FOMO<\/h2>\n<p>Psychologically, it is also interesting for the trader that a move in the wrong direction after opening the first position is no longer a stressful situation for him as he is already counting on it and interestingly, it rather represents another opportunity for an even better entry. This can be especially useful for traders who suffer from FOMO and open positions prematurely. Thus, the first, potentially prematurely opened position may not necessarily be a problem, which can have a positive effect on the trader&#8217;s psyche.<\/p>\n<p>There are several methods of entry when opening positions in this way. A trader can speculate on a trend reversal using various support and resistance levels. Scaling in can also be used when opening positions in a certain range within which new levels of support and resistance etc. can be formed.<\/p>\n<h2>Reversal of the trend<\/h2>\n<p>Like last time, it&#8217;s best to give a specific example on a chart. In the first case, the trader is speculating on a trend reversal on the EURUSD pair. The first entry into the short position can be made somewhere around the 1.18500 level when the price reaches resistance. The stop loss can get set at 1.19500, i.e. 100 pips.<\/p>\n<p>As the price continues to grow up to the next resistance, the trader waits for the next entry at 1.19000, again with the SL at 1.19500, i.e. 50 pips. The second position may be twice as large as the first, which means a higher profit potential at a better price and the same nominal risk value.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-418146\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/EURUSD-H4-vstupy.png\" alt=\"\" width=\"1643\" height=\"721\" \/><\/p>\n<p>TP can be set at the previous low in both cases, i.e. around 1.16700. Ideally, the profit from the first position would be 180 points (Reward to Risk Ratio = 1.8:1), the second position would score 230 points (RRR 4.6:1).<\/p>\n<h2>Breaking the level<\/h2>\n<p>In the second case, the trader is speculating on a breakout after a bounce from support. However, since the price has formed several levels of support, the trader has more levels to enter. The first entry can be made at the highest support around the price of 109,600. In this case, the SL will be, with a conservative approach, below the third level of support, hence somewhere around the 108,600 level (i.e. 100pips).<img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-418153\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/USDJPY-4H-vstupy.png\" alt=\"\" width=\"1644\" height=\"722\" \/><\/p>\n<p>The second entry would be at the second support, i.e. somewhere around 109.200. The SL in this case is set again at 108,600 to 60 pips. The potential third entry has not been realized because the price has not dropped to any third support level. Had the trader counted on this entry, it would mean that his current position is smaller than he originally expected. This reduces the risk of the entire trade, but also the profit potential. Ideally, the trader would be looking at a profit of around 240 (RRR 2.4:1) pips in the first trade and 280 (RRR 2.8:1) points in the second one.<\/p>\n<p>It is important to note that these are the ideal cases where the trend reversal or the level break eventually occur in the direction the trader wishes for. Should the market continue in the opposite of the desired direction, the trader must not move the firmly set SL in any case (or even worse, still keep on buying at a greater loss). On the one hand, this approach may attract traders as even a bad start of the trade can play in their favour. On the other hand, however, the trader must have very firm discipline and predetermined reasonable SL levels that he can easily sustain.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of the basic rules of trading states that a trader should never increase his\/her positions when he\/she is at a loss. However, some traders still use this method of position management while still remaining successful. How to do it properly without causing too much damage? We will explore that in this article. In our [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":418231,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[162],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/418138"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=418138"}],"version-history":[{"count":6,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/418138\/revisions"}],"predecessor-version":[{"id":611100,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/418138\/revisions\/611100"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/418231"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=418138"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=418138"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=418138"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}