{"id":419001,"date":"2021-10-22T10:22:07","date_gmt":"2021-10-22T08:22:07","guid":{"rendered":"https:\/\/ftmo.com\/?p=419001"},"modified":"2022-01-11T17:04:06","modified_gmt":"2022-01-11T16:04:06","slug":"scaling-out","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/scaling-out\/","title":{"rendered":"Scaling out &#8211; security at the expense of returns"},"content":{"rendered":"<p>In the previous two articles, we described two approaches where traders increase their open positions in order to increase the profit potential of their trade, called scaling in. In this article, we&#8217;ll look at a slightly more conservative approach to risk management called scaling out.<\/p>\n<p>Unlike the previous two approaches which were not suitable for beginners and inexperienced traders, scaling out can be recommended even to those traders who do not have many years of experience with forex. The basic principle of scaling out is that the trader realizes part of the profit by partially closing the position. The trader thus &#8220;locks in&#8221; a part of the profit, but at the same time, he still can use the open part of the position to catch a prospective strong trend. Additionally, the trader is also assured of at least some profit in the event of a subsequent trend reversal.<\/p>\n<h2>Certainty for beginners and the unlucky ones<\/h2>\n<p>Closing positions gradually is helpful especially for less-experienced traders, but also for those who have trouble holding profitable positions for long periods of time. Novice traders sometimes have trouble staying in the market long enough and tend to close their trades prematurely with just one significant move against the direction of their trade. Scaling out can help them solve this impatience problem and allow them to stay in the open position long enough to make the most out of the long trend.<\/p>\n<p>It also helps a lot in terms of psychology. Using the scaling out method, traders are assured of at least some profit and can let the rest of the position make more money. This is especially appreciated by traders who, after a series of losing trades, find themselves in a situation where any profit is literally a blessing and their fear prevents them from holding positions for too long. This approach also quite well captures the statement that forex is not about making as much money as possible, but about limiting our losses by applying proper risk management.<\/p>\n<p>Thanks to this unique approach, some traders don&#8217;t even enter Take Profit orders as they simply try to get the highest possible return from the market. For these traders, the first realized PT may be enough profit and everything else can be perceived as just a bonus, which, theoretically speaking, is not limited. The trader then only needs to move the SL according to the market movement, or he\/she can enter a trailing stop and get the most out of a strong trend without spending too much time watching the chart and managing the position.<\/p>\n<h2>Nothing comes for free<\/h2>\n<p>Like any approach to risk management, scaling out is not perfect or without any flaws. Perhaps its biggest drawback that discourages many traders is reducing the profit potential of strong-trending trades. Unlike pyramiding (which increases the number of positions if the trade is profitable), scaling out decreases RRR, which can have a negative effect on a trader&#8217;s overall results in the long run. However, in exchange for a restful sleep, it is definitely worth it for many traders.<\/p>\n<p>Critics of this approach also argue that when scaling out, the trader has to open overwhelmingly large positions in order to be able to split them into partial closes. This can lead to excessive losses when the trade goes wrong and ends up all in the red. Large positions may also not be suitable for some traders, as they will simply not be able to manage risk sensibly due to the stress of having to deal with an unnecessarily large position. Closing trades too early and later seeing the market continue in the trend can also have a negative effect on the psyche of some traders. However, here we&#8217;re talking more about greed rather than limiting profits and losses.<\/p>\n<p>A trader can use many options to exit the market when scaling out. He\/She can set several Profits Targets at predefined values, he\/she can use only one predefined TP and use the trailing stop for the rest of the position, he\/she also can work with the sizes of the positions he closes, etc. Once again, it is best to show a simple example on a chart. We will use the same example that we used in the pyramiding article.<\/p>\n<p>The trader enters the trade on the EURJPY pair again at the price of 128.8. The SL will be 25 pips this time, the size of the position would be 4 lots, which, in case of failure, means a loss of $880 (if we counted on an account size of $100,000, it would mean less than 1%, which is acceptable). The first TP is set at 50 pips, the trader will close half of the position after reaching it, i.e. 2 lots.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-418989\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/EURJPY-1H-SO-I-TP.png\" alt=\"\" width=\"1625\" height=\"705\" \/><\/p>\n<p>TP 2 is at the level of 100 points, here the trader can end his trade, or close half of the trade again (1 lot) and let the rest of the position reach TP 3 (150 points), where the trade is finally ended. If the trader had closed the whole trade already at TP 2, his profit would be $2,640 (880 + 1760), which is certainly not bad (RRR 3:1). If he closed 1 lot at TP 2 and held one lot until TP 3, his profit would be $3,080 (880 + 880 + 1320), which is a little better (RRR 3.5:1).<\/p>\n<p>As mentioned, scaling out is more about limiting risk than maximizing returns. If the trader did not close out parts of the position but held the entire position until TP, then if he closed out at TP 2 his profit would be $3,520 (RRR 4:1), and if he held the entire position until TP 3 his profit would be up to $5,280 (RRR 6:1). With pyramiding, the trader&#8217;s RRR could increase up to 10:1. The main advantage of scaling out is that the trader would be assured of the first profit on the day the trade is opened and would not have to wait 6 (TP 2) or 7 (TP 3) days for it.<\/p>\n<p>As already mentioned, there are many ways to exit the market. But for all of them, a trader should have his exit strategy prepared and tested long before he starts using this trading method. This is the only way he can take advantage of its strengths and maximize his profits.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the previous two articles, we described two approaches where traders increase their open positions in order to increase the profit potential of their trade, called scaling in. In this article, we&#8217;ll look at a slightly more conservative approach to risk management called scaling out. Unlike the previous two approaches which were not suitable for [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":419146,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[162],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/419001"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=419001"}],"version-history":[{"count":5,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/419001\/revisions"}],"predecessor-version":[{"id":424218,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/419001\/revisions\/424218"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/419146"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=419001"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=419001"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=419001"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}