{"id":419189,"date":"2021-10-27T10:36:25","date_gmt":"2021-10-27T08:36:25","guid":{"rendered":"https:\/\/ftmo.com\/?p=419189"},"modified":"2023-11-10T14:29:23","modified_gmt":"2023-11-10T13:29:23","slug":"passing-the-ftmo-challenge-hard-work-but-well-worth-it","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/passing-the-ftmo-challenge-hard-work-but-well-worth-it\/","title":{"rendered":"&#8220;Passing the FTMO Challenge? It is hard work, but well worth it!&#8221;"},"content":{"rendered":"<p><em>It&#8217;s Wednesday and that means we once again spoke with a few of our new FTMO Traders to ask them about their trading journey. They were kind enough to share their experience and even several tips that helped them pass through the Evaluation Process, so do not hesitate to take a few moments and get inspired by their journey in our new article!<\/em><\/p>\n<p>&nbsp;<\/p>\n<h3>Trader Mathusoothanan  &#8211; <em>&#8220;I recently started planning my week ahead and that becomes my success story here.&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/mathp.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-419194\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/mathp.jpeg\" alt=\"\" width=\"300\" height=\"450\" \/><\/a><\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>One of my cousins from India who has introduced me to forex trading back in late 2013. Initially, I deposited 500 dollars with a broker here in Sri Lanka and doubled the account within a week. I thought money-making was super easy and wanted to be a millionaire in my early 20s. But that dream was broken within a week when I lost the capital during the next week itself. But the passion for trading and spending with charts was never been a boring routine to do from then onwards.<\/p>\n<p><strong>How did you manage your emotions when you were in a losing trade?<\/strong><\/p>\n<p>In the initial days, I used to enter into the trade after the trade when I was in losing momentum. However, I changed that behaviour and nowadays I usually take a few hours break or sometimes daybreak if I have a couple of losing trades. I decide on the break duration based on my instinct and that works well for me now. and I will follow the same in the future too.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/mathm.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-419201\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/mathm.png\" alt=\"\" width=\"752\" height=\"904\" \/><\/a><\/p>\n<p><strong>How does your risk management plan look like?<\/strong><\/p>\n<p>I recently started planning my week ahead and that becomes my success story here. I am improving the risk management week by week. I certainly look at my past records and correct it every week. Trying to minimize the losses based on the market condition. I am not going to fix a percentage for every trade rather I look at the market potential and decide the Stop loss based on my lot size. However, I usually keep anywhere between 1 to 3 percentage per trade.<\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p>Controlling my emotion was the toughest part to overcome. I used to have overconfident when I had continuous winning momentum and the same way I used to put trade after trade when I used to have lost momentum. I realized that was because of my emotional interference with my trade plan. and step by step I took the emotion away from my trading.<\/p>\n<p><strong>How would you rate your experience with FTMO?<\/strong><\/p>\n<p>5star. Everything is in order to date. I hope for the same welcoming during my journey with FTMO as a trader.<\/p>\n<p><strong>What is the number one advice you would give to a new trader?<\/strong><\/p>\n<p>Do not rush after a losing trade. be patient you have all the time in the world to enter into your next trade.<\/p>\n<h3>Trader Simone &#8211; <em>&#8220;I&#8217;m now able to trade 40k euros, so the undercapitalization problem is immediately solved.&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/simponep.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-419211\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/simponep.jpeg\" alt=\"\" width=\"300\" height=\"440\" \/><\/a><\/p>\n<p><strong>How did you manage your emotions when you were in a losing trade?<\/strong><\/p>\n<p>I remained calm, knowing that the market is, for a non-negligible part, unpredictable, so even though my analysis was perfect, there was still a considerable probability of getting stopped, plus I diluted my emotional load by limiting the daily loss to 1 single trade, typically 1%. this is because the quality of the decisions taken decrease with the number increasing. It&#8217;s much better to call it a day after a loss instead of grinding, with the potential risk to ruin the entire month, plus, you systematically decrease the probability of consecutive losses, since you end up not trading the same scenario multiple times.<\/p>\n<p><strong>What do you think is the key to long-term success in trading?<\/strong><\/p>\n<p>Humility, perseverance, a strong mind and a decent IQ.<\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>I&#8217;m now able to trade 40k euros, so the undercapitalization problem is immediately solved, knowing that I can potentially earn my country&#8217;s average monthly wage with a single trade.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/simonem.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-419219\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/simonem.png\" alt=\"\" width=\"755\" height=\"900\" \/><\/a><\/p>\n<p><strong>Where have you learnt about FTMO?<\/strong><\/p>\n<p>A friend of mine told me about it.<\/p>\n<p><strong>How would you rate your experience with FTMO?<\/strong><\/p>\n<p>10\/10. I can&#8217;t find a single flaw, I love your business model and the fairness with which you act.<\/p>\n<p><strong>One piece of advice for people starting the FTMO Challenge now.<\/strong><\/p>\n<p>Be patient, manage risk, nobody is pointing a gun at you, If you end up not making the profit target it&#8217;s perfectly fine, you will try the next month for free. The moment you start thinking &#8220;I have to make x before date y otherwise ecc ecc&#8221; the quality of your trading drastically decrease.<\/p>\n<h3>Trader Christian &#8211; <em>&#8220;Always having a percentage mindset instead of a monetary viewpoint was the answer.&#8221;<\/em><\/h3>\n<p>&nbsp;<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/christianp.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-419225\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/christianp.jpeg\" alt=\"\" width=\"300\" height=\"400\" \/><\/a><\/p>\n<p><strong>What do you think is the most important characteristic\/attribute to become a profitable trader?<\/strong><\/p>\n<p>I feel like the most important attribute to a trader has to be their willingness to accept the trials and tribulations that come with being a trader<\/p>\n<p><strong>How did Maximum loss limits affect your trading style?<\/strong><\/p>\n<p>It forced me to follow my plan and risk management rules more effectively, which in turn made me a more profitable trader. So thank you guys for the rules you have created.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/christianm.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-419233\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/christianm.png\" alt=\"\" width=\"755\" height=\"918\" \/><\/a><\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>Freedom of time and location. Also, the fact that I am a new father, my daughter is also the reason I started learning how to trade because I knew a 9-5 would always get in the way of the time I spend with her which I wasn&#8217;t about to allow. If it wasn&#8217;t for her I probably wouldn&#8217;t have even tried to look for something outside of what I used to do career-wise.<\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>yes, I absolutely do and I follow it to the max.<\/p>\n<p><strong>What was more difficult than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p>The want to trade more volume due to higher account size, at first the amounts were definitely something to get used too. But always having a percentage mindset instead of a monetary view point was the answer, as well as always sticking to your rules.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>Take your time, aim for 2-3% a week. pick one session and only trade that. 1-2 pairs. and 1% risk per trade and do not go over that. Lastly do not force anything. the fastest way to fail in these markets is to rush yourself.<\/p>\n<h3>Trader Thiago &#8211; <em>&#8220;I feel fulfilled, I love forex and I want to live my life with freedom&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/ThiagoP.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-419239\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/ThiagoP.jpeg\" alt=\"\" width=\"300\" height=\"316\" \/><\/a><\/p>\n<p><strong>Do you plan to take another FTMO Challenge to manage even bigger capital?<\/strong><\/p>\n<p>My plan is to grow together with your company, I am focused on getting the account increase step by step, seeking the 90% division is also one of my goals. I performed some calculations and my prediction is that in 3 years I will reach the 400k account, but if I feel confident and with a much sharper trading plan, it&#8217;s okay to postpone this time and jump to a bigger account, but I have a long-term thought that will bring much fruit to both sides.<\/p>\n<p><strong>How does your risk management plan look like?<\/strong><\/p>\n<p>My management plan consists of dividing the daily loss by 5 in the case of my 35K account, the daily loss is £1,750, so entry on trades is this my £350 stop seeking 1:5 risk return, when the zone is too big I split that £350 in two, coming in with £175 and looking for a risk return of 1:10. Therefore, the return risk will always outweigh any loss.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/Screenshot-2021-10-25-at-10.45.31.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-419245\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/Screenshot-2021-10-25-at-10.45.31.png\" alt=\"\" width=\"755\" height=\"904\" \/><\/a><\/p>\n<p><strong>How did Maximum loss limits affect your trading style?<\/strong><\/p>\n<p>It doesn&#8217;t affect anything, the risk-free return will offset any loss. I have no intention of becoming a millionaire tomorrow is a very long and unhurried path, I know that for me to get bigger profits I have to have a bigger account, so I look for at least 5% to 10% of my account per month, without madness or despair to make money.<\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>It has completely changed, I feel fulfilled, I love forex and I want to live my life with freedom, being able to travel the world and making money at the same time, that&#8217;s what enchanted me in forex and I&#8217;m sure it&#8217;s your company that will make my dreams come true.<\/p>\n<p><strong>How would you rate your experience with FTMO?<\/strong><\/p>\n<p>Very good, excellent platform, metrix helps a lot to assess your situation, I work more with pending orders than with the live market, but I&#8217;m always watching and sometimes I was left out of some operations due to spreads, but for the rest everything is fine and the spread is not absurd, it is within the normal range.<\/p>\n<p><strong>What is the number one advice you would give to a new trader?<\/strong><\/p>\n<p>Believe in your dreams and believe in your strategy, because the market&#8217;s secret is capital and psychological management. All strategies will work and all strategies will give a loss, the market is sovereign, treat your capital well, treat your head well and everything will be all right.<\/p>\n<p>&nbsp;<\/p>\n<div class=\"entry-content\">\n<p>__________<\/p>\n<div class=\"entry-content\">\n<div class=\"entry-content\">\n<p><em>Editorial note<\/em>: <em>All responses are 100% organic and received from our new FTMO Traders during the contract signing process. All responders agreed to have their feedback published and all their answers are not being edited by FTMO, hence they can include grammatical mistakes or typos. <\/em><\/p>\n<\/div>\n<\/div>\n<\/div>\n<footer class=\"entry-footer\">\n<section class=\"author-box\">\n<div class=\"author_description\">\n<div class=\"author_description_text\"><\/div>\n<\/div>\n<\/section>\n<\/footer>\n","protected":false},"excerpt":{"rendered":"<p>It&#8217;s Wednesday and that means we once again spoke with a few of our new FTMO Traders to ask them about their trading journey. They were kind enough to share their experience and even several tips that helped them pass through the Evaluation Process, so do not hesitate to take a few moments and get [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":419601,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[672],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/419189"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=419189"}],"version-history":[{"count":10,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/419189\/revisions"}],"predecessor-version":[{"id":598291,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/419189\/revisions\/598291"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/419601"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=419189"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=419189"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=419189"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}