{"id":419585,"date":"2021-10-29T08:22:24","date_gmt":"2021-10-29T06:22:24","guid":{"rendered":"https:\/\/ftmo.com\/?p=419585"},"modified":"2022-01-11T17:03:50","modified_gmt":"2022-01-11T16:03:50","slug":"opening-range-breakout","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/opening-range-breakout\/","title":{"rendered":"Opening range breakout &#8211; a simple strategy for (almost) everyone"},"content":{"rendered":"<p><em>A trading strategy does not have to be complicated and does not have to require hundreds of hours spent studying charts. Surprisingly, the most popular approaches are often simple to understand and opening\/closing positions takes a minimum amount of time. Opening range breakout is one such approach. What are the rules of trading the opening range? We will break down the basic aspects in this article.<\/em><\/p>\n<p>The opening range breakout strategy belongs to the simplest and the most popular approaches forex traders use, it is especially popular among traders who do not have the opportunity to spend several hours each day studying charts.<\/p>\n<p>The principle is based on the idea that the market&#8217;s direction is determined by what happens at the beginning of the day or trading session. The range in which the trader operates at the beginning creates resistance and support levels, the breaking of which then gives the trader a signal to enter and also allows him to easily determine the Stop Loss level (traditionally the range of the range in a given time period).<\/p>\n<p>The strength of this approach is the fact that the trader can determine the reference period in which he\/she wants to trade. If the trader prefers a specific time, they adapt the instruments or the selected currencies (and currency pairs) that suit his settings the most. On the other hand, if the trader prefers a particular asset or currency\/currency pair, he\/she can adjust the time period to operate in.<\/p>\n<p>Traders can therefore focus just on one selected period during the day and later on, they do not need to worry about the markets at all. More active traders can also use several time windows and there are also no limits to the size of the time frames. The more skilled ones can also code an automated trading system that would follow a few basic principles.<\/p>\n<h2>Simple idea, many options<\/h2>\n<p>The whole strategy is based on an assumption that the overall market direction can be formed at the beginning of the trading day.  This remains unchanged for everyone, however, the time period in which the opening range forms can be different for every trader. A popular approach is to form the opening range in the first hour of your trading session, although recently, the access to more accurate and faster data has led many traders to use the first half or even quarter-hour of the trading day. However, a range can also be formed before the opening of the markets, at the turn of the calendar day, week, or even month.<\/p>\n<p>European traders often watch out for the first hour after the opening of the &#8220;old continent&#8221; stock exchanges (between 8:00 and 9:00 A.M. CET after the opening in Frankfurt, or between 9:00 and 10:00 A.M. CET after the opening in London), US traders watch the opening of the American stock exchanges, Asian traders Tokyo exchanges, etc.<\/p>\n<p>According to the specific time, the trader must of course choose the instrument to apply the strategy on. The opening of the stock exchanges in Europe is of course suitable for currency pairs with EUR or CHF, or the popular DAX index, etc. When opening US exchanges, the trader then has a choice of virtually all major pairs (thanks to USD), US indices, etc.<\/p>\n<h2>Beware of false signals<\/h2>\n<p>Like any other strategy, the opening range breakout has its drawbacks, that especially beginners should watch out for. The biggest issue with all breakout-based strategies is false breakouts. The price may break out of the range for a while, but then comes back and eventually heads in the opposite direction. Movement within the range is actually a perpetual battle between sellers and buyers, so the supports and resistances bounding the range may not be always 100% reliable.<\/p>\n<p>This can be partially solved by adding additional conditions required for entry (direction of the current trend, or direction on a higher timeframe, etc.) or indicators, according to which the positions will be opened only in one given direction. Smaller false breakouts are then dealt with by not entering exactly at the high and low of the range, but rather with using some margin such as 3 or 5 pips above resistance or below support.<\/p>\n<h2>Corrections may minimize your profits<\/h2>\n<p>It may happen that the price goes in the desired direction, a breakout occurs and the trader expects profits. However, the price comes back again, and an inexperienced trader, fearing a false signal, will close the position with a small profit. However, the price often eventually continues in the desired direction and the trader may become so mentally distraught that he\/she misses a strong move in the next trading session or realizes unnecessary losses by performing revenge trading. as in any other strategy, the trader must set fixed and sufficiently tested rules for his\/her market entries and exits.<\/p>\n<p>The picture below shows a situation on the EURJPY pair when the opening range was formed after the opening of the Frankfurt Stock Exchange (8:00 &#8211; 9:00 CEST). You can see the first breakout to the long direction just ten minutes after the range formation. The breakout is only at 1.9 pips, which might not mean anything in the case of well-placed entries. The price then pulls back and forms another signal, but after achieving an interesting rise, it goes back below resistance again, which is a signal to enter long. The price then goes back to a slight negative repeatedly a few times, but in the end, this could have been an interesting trade.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-419570\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/10\/EURJPY-ORB.png\" alt=\"\" width=\"1632\" height=\"709\" \/><\/p>\n<p>While traders often expect significant moves to come after a breakout, they have to take into account that moves like the one seen on the chart above are not that common. Thus, some form of money management during the duration of the trade is certainly useful.<\/p>\n<p>Traders should also be careful not to open trades with currencies of countries where there is a holiday on the given day, or currencies that may be affected by an announcement of very important macroeconomic news coming later that day. Markets with wide spreads are not very advisable as well as the SL and the required TP are usually too large while the market may have already made the most of its move.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A trading strategy does not have to be complicated and does not have to require hundreds of hours spent studying charts. Surprisingly, the most popular approaches are often simple to understand and opening\/closing positions takes a minimum amount of time. Opening range breakout is one such approach. What are the rules of trading the opening [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":419648,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[162],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/419585"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=419585"}],"version-history":[{"count":5,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/419585\/revisions"}],"predecessor-version":[{"id":424217,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/419585\/revisions\/424217"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/419648"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=419585"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=419585"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=419585"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}