{"id":420327,"date":"2021-11-10T09:10:25","date_gmt":"2021-11-10T08:10:25","guid":{"rendered":"https:\/\/ftmo.com\/?p=420327"},"modified":"2022-01-11T17:02:18","modified_gmt":"2022-01-11T16:02:18","slug":"ftmo-has-the-fairest-and-the-most-appropriate-conditions-for-a-trader","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/ftmo-has-the-fairest-and-the-most-appropriate-conditions-for-a-trader\/","title":{"rendered":"&#8220;FTMO has the fairest and the most appropriate conditions for a trader&#8221;"},"content":{"rendered":"<p>&#8220;FTMO has the fairest and the most appropriate conditions for a trader to be able to prove its abilities.&#8221; This quote comes from one of our new FTMO Traders as he was kind enough to share with us his journey and also dived deep into how FTMO helped him manage risk properly and highly advance his trading. Our other new FTMO Trader, Ryan, also explains what helped him to eliminate the luck factor. Another set of interviews with 4 new FTMO Traders is out, see their story and their advice to you below!<\/p>\n<p>&nbsp;<\/p>\n<h3>Trader Mihail &#8211; <em>&#8220;FTMO has the fairest and the most appropriate conditions for a trader to be able to prove its abilities.&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/mihailp.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-420328\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/mihailp.jpeg\" alt=\"\" width=\"350\" height=\"233\" \/><\/a><\/p>\n<p><strong>How does your risk management plan look like?<\/strong><\/p>\n<p>I am committed to aggressive risk management and capital preservation and I have clear rules for everything (pattern selection, risk measure, RRR, trade management and so on). I also have a very detailed trading journal with a lot of notes and screenshots from my trades. So, the most important thing that I do before I decide whether I place an order is to measure and manage the risk.<\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>I just entered in my fourth year of trading. And in this entire period, I invested in trading 12 to 14 hours per day, even in most of the weekends. So, I can say that during this period of time I went through a lot of ups and downs and at this moment I think that I can say that my psychology is in line with my trading style.<\/p>\n<p><strong>What was the most difficult during your Challenge or Verification and how did you overcome it?<\/strong><\/p>\n<p>I can&#8217;t say that I had something difficult during my challenge. And that&#8217;s because this would mean that there was also something easy, and it wasn&#8217;t. Trading is difficult in itself. I assumed from the start that if I do everything right it can simply happen to lose the Challenge and I accepted it. So, I focused to do everything right, from my side. Of course that I made some mistakes, but I was fortunate enough to get over them.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/Screenshot-2021-11-10-at-8.03.10.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-420334\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/Screenshot-2021-11-10-at-8.03.10.png\" alt=\"\" width=\"753\" height=\"919\" \/><\/a><\/p>\n<p><strong>How did Maximum loss limits affect your trading style?<\/strong><\/p>\n<p>It didn&#8217;t. I studied all the other proprietary trading firms that I could find on Google before I start my Challenge with FTMO. My conclusion was that, FTMO has the fairest and the most appropriate conditions for a trader to be able to prove its abilities. You can&#8217;t succeed in trading if you can&#8217;t handle the maximum loss limit which in FTMO&#8217;s case is a very decent one.<\/p>\n<p><strong>How would you rate your experience with FTMO?<\/strong><\/p>\n<p>I started my first Challenge on June 23rd, 2020 and I had 3 free Challenges until I managed to pass the last one (on September 9th). During this period I asked different questions the FTMO team through email and I must say that I had one of the best support experiences with the FTMO team. I must say that there were some issues during this time, but, again, the FTMO team was always fair and prompt. So, kudos to them!<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>I thought at my Challenge just like a trade. Therefore, I assumed from the start that I can fail it without doing something wrong. Welcome to trading! Therefore, my advice for any other trader and even for me, as I plan to reach a 300k funded account in the next 18 to 24 months, is to try to do his or her best and eventually the desired outcome will appear.<\/p>\n<h3>Trader Ryan &#8211; <em>&#8220;Anything other than your strategy is uncalculated gambling.&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/RyanP.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-420340\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/RyanP.jpeg\" alt=\"\" width=\"300\" height=\"340\" \/><\/a><\/p>\n<p><strong>Where have you learnt about FTMO?<\/strong><\/p>\n<p>I have learned that you guys really want traders to succeed. You&#8217;re objective goals and parameters are reasonable and you provide very clear and concise metrics for us to use. You guys are seriously one of the best companies in this space.<\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>I use a trading plan and I do reference it whenever I plan to make a trade(s). It helps keep me consistent and aware of my actions.<\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>Passing the verification showed me that anything is possible if you work hard and smart enough. It took me 3 attempts at the challenge before passing. There were times I felt discouraged and if I could become a successful trader, but by keeping at it I was able to pass. I have learned more about myself these past few months with trading than I have prior. I hope to achieve a 400k total FTMO account size and eventually scale up to $2M. I am manifesting it as I write this to you and I hope when I achieve those goals you guys share this with me 🙂<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/Screenshot-2021-11-10-at-8.21.43.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-420346\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/Screenshot-2021-11-10-at-8.21.43.png\" alt=\"\" width=\"753\" height=\"919\" \/><\/a><\/p>\n<p><strong>How did you manage your emotions when you were in a losing trade?<\/strong><\/p>\n<p>I stayed off the charts as best I could. Staring at the chart in drawdown makes holding your trade much harder.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>By creating a repeatable strategy. That takes time to develop with trial and error. Once you find your strategy on the charts you need to have conviction in the trade. Anything other than your strategy is uncalculated gambling.<\/p>\n<p><strong>What is the number one advice you would give to a new trader?<\/strong><\/p>\n<p>Have a strong understanding of trading fundamentals and technicals as well as understanding your psychology.<\/p>\n<h3>Trader Hunter &#8211; <em>&#8220;This money for my family will be able to keep us afloat.&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/hunterP.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-420352\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/hunterP.png\" alt=\"\" width=\"300\" height=\"180\" \/><\/a><\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>Yes, but my plan mostly consists of time of trading and criteria for entry.<\/p>\n<p><strong>What was easier than expected during the FTMO Challenge or Verification?<\/strong><\/p>\n<p>This challenge was easier since market conditions favored my trading during the completion, so trends often extended in the direction that was expected for longer durations.<\/p>\n<p><strong>What do you think is the key for long-term success in trading?<\/strong><\/p>\n<p>Risk management. Never risk more than 1 percent on a trade.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/Screenshot-2021-11-10-at-8.38.18.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-420358\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/Screenshot-2021-11-10-at-8.38.18.png\" alt=\"\" width=\"753\" height=\"918\" \/><\/a><\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>Yes occasionally. My trading mostly consists around gaining evidence of a movement in a potential direction before looking for an entry, but sometimes I can take impulsive entries when I occasionally get too greedy or leave trades too early.<\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>Currently, I am a university student who does not have many extra hours in a day, so being able to make money from trading only a few hours in the morning is amazing. After covid, this money for my family will be able to keep us afloat and can give me personally the opportunity to start my life with extra funds from trading and go on to find my passions and pursue them regardless of the income they provide . After 2 years of practicing trading, failing FTMO challenges, using bad strategies, and improving my self discipline, finally passing the FTMO trial has made all the hard work worth it.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>Test your strategy on demos first and then prove you are ready before jumping into a paid challenge. It’s better to wait and be sure before you lose money on the challenge and feel horrible about yourself. But if you do jump into the challenge (and fail multiple times like I did) it’s about learning from mistakes and trying again with a better plan of attack.<\/p>\n<p>&nbsp;<\/p>\n<h3>Trader MarioIlves &#8211; <em>&#8220;Work, patience and also improving your personal life &#8211; these all have huge implications on your trading.&#8221;<\/em><\/h3>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/MarioIlvesp.jpeg\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-420364\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/MarioIlvesp.jpeg\" alt=\"\" width=\"300\" height=\"300\" \/><\/a><\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>The freedom to be your own boss. Freedom to explore the world and discover the great secrets of universe. Life is full of experiences, enjoyment, love and self improvement.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>Understanding and adapting to new conditions in markets and also following a strict plan.<\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>This is a huge step for me in my trading career. This opens many doors for me in the world and also validating that I must be doing something right to accomplish something I worked for many many hours over the past 2.5 years.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/Screenshot-2021-11-10-at-8.45.46.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-420370\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/Screenshot-2021-11-10-at-8.45.46.png\" alt=\"\" width=\"753\" height=\"918\" \/><\/a><\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>Of course. This is what I was struggling for a long time. Every time I tried to follow a strict plan I always screwed it up. Until now I really understand what it means to have a plan. Doesn&#8217;t really matter what the plan is as long as you follow it and improve it as new market conditions come up.<\/p>\n<p><strong>How does your risk management plan look like?<\/strong><\/p>\n<p>Very strict. I split my trades into 3 parts. First profits will be secured 1:3, second will be closed at 1:5. And the rest will run into third high probability zone. This way I will guarantee that I will always pay myself and wont let my emotions control the amount of money I will extract from the markets.<\/p>\n<p><strong>What is the number one advice you would give to a new trader?<\/strong><\/p>\n<p>Don&#8217;t come into the markets expecting huge wins right away. Work, patience and also improving your personal life &#8211; these all have huge implications on your trading. Give trading time, learning this skill takes effort and a lot of patience. If you feel overwhelmed &#8211; it is okay to take a break. Not being in a position is also a position. Use this time to improve your skills and also if you have finished your work behind charts give yourself the benefit to enjoy other activities you enjoy &#8211; being with family, going out for a walk, working out or even cleaning your car.<\/p>\n<p>&nbsp;<\/p>\n<div class=\"entry-content\">\n<p>__________<\/p>\n<div class=\"entry-content\">\n<div class=\"entry-content\">\n<p><em>Editorial note<\/em>: <em>All responses are 100% organic and received from our new FTMO Traders during the contract signing process. All responders agreed to have their feedback published and all their answers are not being edited by FTMO, hence they can include grammatical mistakes or typos. <\/em><\/p>\n<\/div>\n<\/div>\n<\/div>\n<footer class=\"entry-footer\">\n<section class=\"author-box\">\n<div class=\"author_description\">\n<div class=\"author_description_text\"><\/div>\n<\/div>\n<\/section>\n<\/footer>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;FTMO has the fairest and the most appropriate conditions for a trader to be able to prove its abilities.&#8221; This quote comes from one of our new FTMO Traders as he was kind enough to share with us his journey and also dived deep into how FTMO helped him manage risk properly and highly advance [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":420385,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[672],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/420327"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=420327"}],"version-history":[{"count":6,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/420327\/revisions"}],"predecessor-version":[{"id":422667,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/420327\/revisions\/422667"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/420385"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=420327"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=420327"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=420327"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}