{"id":420427,"date":"2021-11-11T11:29:48","date_gmt":"2021-11-11T10:29:48","guid":{"rendered":"https:\/\/ftmo.com\/?p=420427"},"modified":"2022-01-11T17:01:47","modified_gmt":"2022-01-11T16:01:47","slug":"the-power-of-simplicity","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/the-power-of-simplicity\/","title":{"rendered":"The power of simplicity"},"content":{"rendered":"<p>Investors and traders in the capital markets often look for the ideal software instrument that would lead them to long-term consistent returns. Many traders then feel that such an ideal tool would have to combine as many indicators as possible in order to give them the best and guaranteed signals to enter the market. However, the reality is vastly different. Let&#8217;s dig a bit deeper into this topic in this article.<\/p>\n<p>Trading itself is not a simple business, and technical analysis is not a miraculous science that would give traders exact entry and exit signals with guaranteed profits on the spot. Achieving the status of a consistently profitable trader requires patience, strong will and often the ability to survive periods when things are not going well. Tough times are simply inevitable, and even a long-term profitable strategy can not protect a trader from a bad period with a series of losing trades.<\/p>\n<p>Every experienced trader knows that there&#8217;s no such thing as trading with no losses at all. Despite that, many traders are still looking for the one easy solution that will (at least in their opinion) ensure the greatest possible number of profitable trades while minimizing the number of losing ones.<\/p>\n<p>Some fear losses like the devil and want to do everything they can to avoid them. Instead of starting from the basics and trying to understand what is really happening in the markets, they see the ultimate solution in adding various indicators and other tools with the main goal of filtering out losing trades.<\/p>\n<p>The individual indicators are not an issue, but if traders start combining too many of them along with different lines and curves, it can easily get out of hand and result in a confusing mishmash.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-420396\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/Swing-Trading-02.jpg\" alt=\"\" width=\"1457\" height=\"677\" \/><\/p>\n<p><strong>Source:<\/strong><em> Swing Trading Strategies<\/em><\/p>\n<p>Of course, the most common reason is the desire to find some &#8220;holy grail&#8221; &#8211; a solution that will always unmistakeably lead to profitable trades with minimal losses (ideally without them). Another reason may be various training courses and seminars or the nowadays very popular videos on social media. Inexperienced traders see seemingly sophisticated solutions, which they do not understand, but the number of graphs, lines, and numbers creates the illusion of leading to profits. After all, the trainer or lecturer looks like a successful trader, so it must work. And even though the strategy they see in the video may not be explicitly cluttered with indicators, inexperienced traders start adding more and more indicators that should &#8220;improve&#8221; the original strategy after a few unsuccessful trades. Eventually, it ends up in chaos that no one understands.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-420414\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/FX-Trading-Revolution-01.png\" alt=\"\" width=\"1100\" height=\"558\" \/><\/p>\n<p><strong>Source:<\/strong> <em>FX Trading Revolution<\/em><\/p>\n<p>Another unfortunate reason that leads to the recombination of various indicators and graphical aids are the frequent recommendations of more experienced traders to conflate multiple factors when entering the market. The idea is that the more factors in the market that point to an entry signal, the more likely the trade will be successful.<\/p>\n<p>However, confluence works on the principle of combining several factors that use different principles and may not influence each other (trend, volatility, supports and resistances, candle formations, selected indicator, etc.). When a trader combines several oscillators and incorporates other indicators into the chart itself, it is rather nonsense than confluence.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-420402\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/innerfx-swing-trading-01.png\" alt=\"\" width=\"828\" height=\"473\" \/><\/p>\n<p><strong>Source:<\/strong> <em>Swing Trading Strategies<\/em><\/p>\n<p>Some traders think that the more complex the chart, the more professional it looks, and they can brag about it to their friends on social media. They then feel that they are experienced traders because others have no chance of understanding it. Of course, such an approach will never lead to profitable trading because forex trading is not about the image on Facebook or Instagram.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-420408\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/reddit-01.jpg\" alt=\"\" width=\"642\" height=\"603\" \/><\/p>\n<p><strong>Source:<\/strong> <em>Reddit<\/em><\/p>\n<p>In all these cases, the result is virtually the same. There are so many indicators, curves, and lines on the chart that often you cannot even see the price or the candles that show the price. Thus, the trader cannot even see what is actually happening in the market with the traded instrument. When waiting for a signal to enter the market, using many indicators together often leads to conflicting signals. The trader has no chance to enter the market and misses out on many potentially interesting opportunities. And, as if on purpose, when his holy grail finally gives him the signal to enter, a quick move in the market leads to execution at an unfavourable price, and the trade ends up in a loss or with a minimal profit.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-420420\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/11\/Swing-Trading-03.gif\" alt=\"\" width=\"1280\" height=\"800\" \/><\/p>\n<p><strong>Source:<\/strong> <em>Swing Trading Strategies<\/em><\/p>\n<p>The only &#8220;holy grail&#8221; that can help a trader to better results is to master the psychological side of trading and approach trading and technical analysis as simply as possible.<\/p>\n<p>Various indicators and oscillators are usually a decoy to inexperienced traders and are supposed to create the impression of sophisticated tools designed for professional traders. They may work, but only to a limited extent. The basis for a trader&#8217;s decision-making should be the price itself, reflecting what is happening in the market.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Investors and traders in the capital markets often look for the ideal software instrument that would lead them to long-term consistent returns. Many traders then feel that such an ideal tool would have to combine as many indicators as possible in order to give them the best and guaranteed signals to enter the market. However, [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":420516,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[88911,670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/420427"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=420427"}],"version-history":[{"count":7,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/420427\/revisions"}],"predecessor-version":[{"id":592902,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/420427\/revisions\/592902"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/420516"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=420427"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=420427"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=420427"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}