{"id":421669,"date":"2021-12-03T14:11:07","date_gmt":"2021-12-03T13:11:07","guid":{"rendered":"https:\/\/ftmo.com\/?p=421669"},"modified":"2022-01-11T17:00:17","modified_gmt":"2022-01-11T16:00:17","slug":"how-to-use-the-martingale-principle-to-your-own-benefit","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/how-to-use-the-martingale-principle-to-your-own-benefit\/","title":{"rendered":"How to use the martingale principle to your own benefit?"},"content":{"rendered":"<p><em>We have already written about the martingale principle in forex trading, and we would definitely not recommend this system to our traders. But what would it look like if we turned the tables and used the martingale principle responsibly to our benefit?<\/em><\/p>\n<p>Probably every trader has heard of the martingale-based systems. It is a reasonably well-known principle, widely used in betting, but also in automated trading systems.<\/p>\n<h2>Seeing profits with disproportionate risk<\/h2>\n<p>Martingale looks tempting at first glance because it promises attractive prizes for the bettor\/trader. The problem is that the trader\/bettor has to have unlimited capital in order for the &#8220;strategy&#8221; to be actually efficient. We have described the principle in this article, in which we also conducted a test of a simple strategy based on it. The basic idea is that after each loss, the trader\/bettor doubles his stake.<\/p>\n<p>For example, if a roulette player bets $10 on one colour and wins, his net profit will be $10 (deposit $10, win $20). If he\/she does not win, he\/she now has to bet $20. If he wins, he again makes a net profit of $10 ($40 winnings, total stake $30), and so on. If the bettor has unlimited resources and attempts, he can make a risk-free profit.<\/p>\n<p>In trading, the trader can have the SL to TP ratio set even more favourably (when the RRR is greater than 2:1, the net profit increases with each additional round), so the profits can grow faster in the case of extended winning series. The problem arises when the losing streak gets too long.<\/p>\n<p>Already on the tenth round, a bettor\/trader who started with a $10 stake, has to shell out $5,120. The total sum is now already $10,230. As the stakes double, a longer losing streak can be liquidating for most bettors\/traders (after 30 rounds of losses, the bettor\/trader would need a capital of at least $10,737,418,230).<\/p>\n<h2>Martingale and motivation<\/h2>\n<p>So how do you use this system to your benefit? It&#8217;s not so much about trading as it is about following the rules and having the discipline that determines a trader&#8217;s long-term profitability or failure.<\/p>\n<p>Perhaps every trader has experienced a period when he has failed and has a series of losing trades. But, of course, you cannot trade without losses. Sometimes this happens even if the trader follows his rules, but most of the time, it is caused by the trader starting to break his rules and making &#8220;unforced&#8221; errors.<\/p>\n<p>Traders can deal with these situations with various motivational exercises (if the incoming profits when sticking to the rules are not a sufficient motivation) or with penalties, if the number of mistakes grows too much. Such negative motivation may look unpleasant, but the truth is that it is one of the few ways to force themselves not to make unnecessary mistakes for many traders.<\/p>\n<h2>Punishment instead of a reward<\/h2>\n<p>One of the most effective tools seems to be financial penalties, where the trader sets a &#8220;fine&#8221; for every single lousy trade where he did not follow the rules and ended up with an unnecessary loss. Of course, the amount of the fine is individual, but this is where the aforementioned martingale principle comes in. The penalty amount will not remain, but will exponentially increase as the number of bad trades increases.<\/p>\n<p>Does this seem too harsh to you? We know from our own experience that if the rules or penalties are soft, it usually leads nowhere as you kind of get used to it. You start to consider the loss of money (or other bland punishment) in your decisions and your entries into trades. It is not just about trading. People try to stick to various diets, start exercising, quit smoking, etc. But unless they have sufficient motivation in the form of harsher punishments, most fail to keep their resolutions.<\/p>\n<p>So after the first losing trade, the trader pays (to the cash box, to a particular account, etc.), for example, $10. For the second lousy trade, he spends $20, for the next $40, then $80, and so on. Although the first losing trade will not be costly for him (you can start with a more significant amount), as the number of mistakes increases, the bad trades become more expensive.<\/p>\n<p>If a trader tends to make a series of unnecessary trades, he\/she can stay with this principle on one string and start from the beginning after a good trade. On the other hand, if the errors do not appear every day, the growth series can last, for example, one month. After all, the point is to make the trader pay more and more for repeated unnecessary mistakes, which should force him to behave more responsibly.<\/p>\n<p>The key, of course, is the ability to be aware of one&#8217;s mistakes. A trader who cannot identify his mistakes is unlikely to succeed in the long run, and any form of motivation will not help him.<\/p>\n<p>The martingale principle does look attractive on paper, and many investors and bettors will undoubtedly claim that they can achieve long-term stable returns using it. But, unfortunately, our experience is different, and we would not recommend a martingale system to anyone who wants to trade seriously.<\/p>\n<p>However, when it comes to motivation, this method can be beneficial to those traders with discipline problems. It can motivate the trader to be disciplined, and if he is unable to do so (perhaps only at the beginning), at least his &#8220;savings&#8221; will increase relatively quickly without having to worry about losing them for good.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We have already written about the martingale principle in forex trading, and we would definitely not recommend this system to our traders. But what would it look like if we turned the tables and used the martingale principle responsibly to our benefit? Probably every trader has heard of the martingale-based systems. It is a reasonably [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":421946,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[5184],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/421669"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=421669"}],"version-history":[{"count":11,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/421669\/revisions"}],"predecessor-version":[{"id":441589,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/421669\/revisions\/441589"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/421946"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=421669"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=421669"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=421669"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}