{"id":422666,"date":"2021-12-13T07:20:57","date_gmt":"2021-12-13T06:20:57","guid":{"rendered":"https:\/\/ftmo.com\/?p=422666"},"modified":"2023-09-25T13:50:56","modified_gmt":"2023-09-25T11:50:56","slug":"ftmo-traders-overtrading-is-usually-the-biggest-challenge","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/ftmo-traders-overtrading-is-usually-the-biggest-challenge\/","title":{"rendered":"FTMO Traders: Overtrading is usually the biggest challenge"},"content":{"rendered":"<p><em>The last month of 2021 is here and we bring you another batch of Q&amp;As with our new FTMO Traders and their experiences gained by overcoming our Evaluation Process. Trading is not easy, and we all have to get used to the fact that we can&#8217;t do it without losses. However, realizing this can greatly increase your chances of joining our FTMO Traders.<\/em><\/p>\n<h3>Trader Siwapon<em>: <\/em>“Just let it go, losing is a part of trader’s life”<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-422672 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/12\/Siwapon.jpeg\" alt=\"\" width=\"216\" height=\"324\" \/><\/p>\n<p><strong>What was more difficult than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p>Daily loss is the one thing that I think it’s harder than expected. I was making $100 to $1,000 in a month but this time is different and more difficult when the balance is much bigger than before. Second thing is profits target. It looks easy but actually that’s not easy.<\/p>\n<p><strong>What do you think is the most important characteristic\/attribute to become a profitable trader?<\/strong><\/p>\n<p>Discipline is the most important thing. I can win 10 trades but if I don’t have discipline in money management the 1 trade with loss can take all of profits I have made.<\/p>\n<p><strong>How does your risk management plan look like?<\/strong><\/p>\n<p>I usually set a loss at 1% of balance per trade and set profit at 2-3%. If I have reached the goal, then I stop. I can’t win every trade so I should stop when I am in profits than loss.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-422714 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/12\/Siwapon-trades-I.png\" alt=\"\" width=\"810\" height=\"1006\" \/><\/p>\n<p>&nbsp;<\/p>\n<p><strong>How did you manage your emotions when you were in a losing trade?<\/strong><\/p>\n<p>Just let it go, losing is a part of trader’s life. Close the chart and find something to release the stress, for me go to gym training hard and go to bed with a favorite movie.<\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p>Balancing the emotions, sometimes the greed takes control, so it’s become a huge loss and then the stress level increase.<\/p>\n<p><strong>What is the number one piece of advice you would give to a new trader?<\/strong><\/p>\n<p>Make sure before jumping in the trades, there’s 24 hrs. 5 day a week. You don’t have to rush to lose your money. You should trade often to know how your strategy works or not. Do it on demo before real money and record your trading journal, it’s helpful.<\/p>\n<h3>Trader Dirk: “If people say it’s easy, they probably don&#8217;t make any money trading, or they don&#8217;t know what they’re talking about.”<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-422687 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/12\/Dirk.jpg\" alt=\"\" width=\"300\" height=\"301\" \/><\/p>\n<p><strong>What was more difficult than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p>I think trading through drawdown and knowing you only have 20 days to get to the 10% mark was more mentally challenging than putting on the trades every day. I don&#8217;t trade cryptos, so my trading week is mostly around Tuesdays to some Fridays if there are good set ups. I also made the error of trading with tighter stops during the challenge, and it blew me into a 7K hole, once I readjusted to my &#8220;normal&#8221; stop sizes I got back to even and finished the evaluations with a couple of days to spare. I now only make adjustments to my strategy, not my trades&#8230;<\/p>\n<p><strong>What was easier than expected during the FTMO Challenge or Verification?<\/strong><\/p>\n<p>Trading towards a set goal definitely made the focus and work needed easier to manage every day.<\/p>\n<p><strong>Where have you learnt about FTMO?<\/strong><\/p>\n<p>I have been looking at joining firms for the past year, but it was very challenging to figure out who to join as larger\/ older firms have desk fees and the application processes were very expensive, so I eventually found a link on a review site and started doing research on FTMO and immediately knew they were the right firm to start with.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-422720 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/12\/Dirk-trades.png\" alt=\"\" width=\"812\" height=\"1010\" \/><\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p>I think all the mornings I had to run to work because I ran out of money to put fuel in my car was tough. Most of my last 2 years was dedicated to becoming a professional trader, and if I had to spend money on something to help with that I would do it and deal with the consequences later. I had nothing left to lose after lockdown and I already had some trading experience, so I took a job at a friend of mine&#8217;s company and spent all my time after work, before work and weekends becoming better. I can&#8217;t remember how many times I thought of quitting but eventually gave up on that as well. I just put in the work, sucked it up and still enjoy the process to this day. If people say it’s easy, they probably don&#8217;t make any money trading, or they don&#8217;t know what they’re talking about.<\/p>\n<p><strong>How did Maximum loss limits affect your trading style?<\/strong><\/p>\n<p>I had to reduce the number of positions I took per day, and it definitely helped me focus and define my strategy more.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>Make sure you know what you are doing, focus on yourself, forget about indicators, and learn how to read the tape. You&#8217;ll become a real professional trader if you put in the work and learn how to read price.<\/p>\n<h3>Trader Mohammed: “Overtrading is usually the biggest challenge.”<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-422693 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/12\/Mohammed.jpg\" alt=\"\" width=\"300\" height=\"298\" \/><\/p>\n<p><strong>What was the most difficult during your FTMO Challenge or Verification and how did you overcome it?<\/strong><\/p>\n<p>Most difficult was to stay disciplined with number of trades opened. Overtrading is usually the biggest challenge. I think practicing discipline in other areas of my life, and consistency, such as with training in the gym helps me to be more disciplined with trading. I am really starting to believe that feeling physically fit and strong makes helps me to feel mentally stronger.<\/p>\n<p><strong>What do you think is the key to long-term success in trading?<\/strong><\/p>\n<p>Discipline and consistency. Discipline with stop losses and take profits. consistency with analysis and entries using limits. consistency of trading over weeks \/ months \/ a year \/ 2 and beyond. These are all things I think about daily and remind myself actively of. The road ahead is long, got to constantly be evolving to grow for the challenge.<\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>Seeing the genuine success, it can bring me. My mentor is a trading success story and having studied at his trading school I feel well equipped to pursue a professional career in trading.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-422726 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/12\/Mohammed-trades.png\" alt=\"\" width=\"811\" height=\"1007\" \/><\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p>Biggest challenge has been to make investment in time and effort and money towards educating myself, having the time to learn and grow through experience whilst supporting my obligations towards my partner, family and friends, on my earnings as a food courier working in London for Deliveroo&#8230;Letting go of emotional attachment to gains and losses. Sticking disciplined to stop losses. Overcoming the mental barrier of believing that I was somebody who is capable of consistently earning the kind of numbers that I have produced both on FTMO and personal accounts since pursuing trading seriously.<\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>Gives me the opportunity to pursue trading as a full-time profession, whilst supplementing my income through a part time job as a food courier. For the last year and half up to this point, my employment situation has been full time as food courier, so the journey has been tough. Cold and rainy days delivering food on a motorbike on London&#8217;s busy roads has its positives but earning 80% of profits trading the markets on a 35K account literally gives me room to multiply my earnings massively. I&#8217;m not here to trade with FTMO to make pocket change&#8230;it’s time to make some serious money.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the Challenge?<\/strong><\/p>\n<p>Don&#8217;t give up. I failed the challenge at least 2\/3 times but saw it as part of the journey and part of the investment in my career. It&#8217;s not a loss if you review your performance seriously and take steps to improve. Good risk management is king.<\/p>\n<h3>Trader Vladimir:<em> <\/em>“Not every action is profitable; not every fight has a happy ending.”<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-422699 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/12\/Vladimir.jpg\" alt=\"\" width=\"290\" height=\"300\" \/><\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>The trading plan consists of looking at the drivers that drive the market, where their short-term cycles are relative to their long-term processes, here I mean primarily the USD and JPY crosses. Identifying whether to open an order or wait for a better price depends on the short-term Timeframes.<\/p>\n<p><strong>What was more difficult than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p>The biggest challenge is adapting my money management to your risk parameters. It certainly takes a lot of attention, patience, and time.<\/p>\n<p><strong>How does your risk management plan look like?<\/strong><\/p>\n<p>The routine begins with a review of the news, or fundamental drivers, from the previous day and the current day that awaits us. The next step comes down to a technical analysis of the major pairs, with a weekly review down to 1hour time frame and identifying short- and long-term cycles.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-422732 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/12\/Vladimir-trades.png\" alt=\"\" width=\"815\" height=\"1011\" \/><\/p>\n<p><strong>What do you think is the most important characteristic\/attribute to become a profitable trader?<\/strong><\/p>\n<p>Patience and discipline.<\/p>\n<p><strong>Describe your best trade.<\/strong><\/p>\n<p>The best trade in the past period is, of course, the purchase of the USD500.cash index on December 1. Following the sluggish market and the downturn during the Thanksgiving holiday in the US on Wednesday, December 1, conditions were created for the purchase of cheaper index values ​​followed by a bounce from the support area and positive fundamental reports on the danger of the new omicron variant.<\/p>\n<p><strong>What is the number one piece of advice you would give to a new trader?<\/strong><\/p>\n<p>To be selective. Be able to identify and select your battles. Not every action is profitable; not every fight has a happy ending.<\/p>\n<p>&nbsp;<\/p>\n<p>__________<\/p>\n<div class=\"entry-content\">\n<div class=\"entry-content\">\n<p><em>Editorial note<\/em>: <em>All responses are 100% organic and received from our new FTMO Traders during the contract signing process. All responders agreed to have their feedback published and all their answers are not being edited by FTMO, hence they can include grammatical mistakes or typos. <\/em><\/p>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>The last month of 2021 is here and we bring you another batch of Q&amp;As with our new FTMO Traders and their experiences gained by overcoming our Evaluation Process. Trading is not easy, and we all have to get used to the fact that we can&#8217;t do it without losses. However, realizing this can greatly [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":422756,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[672],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/422666"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=422666"}],"version-history":[{"count":13,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/422666\/revisions"}],"predecessor-version":[{"id":593996,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/422666\/revisions\/593996"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/422756"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=422666"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=422666"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=422666"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}