{"id":422786,"date":"2021-12-15T16:12:34","date_gmt":"2021-12-15T15:12:34","guid":{"rendered":"https:\/\/ftmo.com\/?p=422786"},"modified":"2022-01-11T16:59:22","modified_gmt":"2022-01-11T15:59:22","slug":"range-trading-what-to-do-when-the-market-is-not-trending","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/range-trading-what-to-do-when-the-market-is-not-trending\/","title":{"rendered":"Range trading &#8211; what to do when the market is not trending"},"content":{"rendered":"<p><em>Every strategy has strong and weak periods. Some can adapt to it by simply holding on even during the weaker periods and survive them without much stress and incurring many losses, while others prefer using multiple approaches in their inventory and applying them at different stages of the market. A lot has been said &amp; written about strategies that rely on trends, but today we will look at the fact that forex is not just about trends.<\/em><\/p>\n<p>Forex is considered to be a trending market, and many traders set their strategies to solely rely on trends. However, when the chosen market gets to the stage where it&#8217;s no longer trending for an extended period of time and the investor is only watching for sideways movement, there can be a problem. Virtually, there are two options traders have in such a situation: either be patient or look for alternative solutions. Multiple approaches give the trader more opportunities to make money in the market.<\/p>\n<h2>Range trading &#8211; when the market is missing a trend<\/h2>\n<p>Most markets are in a trend phase only 30% of the time. In addition, most traders are not able to stay in a trade for the entire duration of the trend and use its full potential. Therefore, trading in a range can be the answer for many traders as it is a suitable alternative to trend trading.<\/p>\n<p>When the market is not trending, it moves sideways or in a particular range marked by two horizontal areas: support and resistance.<\/p>\n<p>Ranges occur in markets at the end or beginning of trends, when the market is deciding which direction to go. They can also occur within a single longer trend when the market has been in consolidation for a while. At the support and resistance levels, either supply or demand wins, causing the price to move between the support and resistance until one side gains the upper hand.<\/p>\n<h2>Clear S\/R levels and good RRR<\/h2>\n<p>The main advantage of trading within a range is relatively well-defined prices for entering and exiting the market. When the price bounces off the support (long position) or resistance (short position), the investor enters the market. The trader then places the Stop Loss near this level, and the opposite side of the range can be used as a Take Profit. It is good to remember that neither support nor resistance is given by the exact price, but rather by certain price zones, which is especially important for the trader&#8217;s money management.<\/p>\n<p>The market does not move directly within one range but creates other S\/R levels where traders can place their partial TPs. This is true specifically for charts with longer timeframes, where several smaller trends with several S\/R levels can form within a single range.<\/p>\n<p>Trend traders can also use the market movement within a range. In fact, a break of support or resistance can indicate the start of a longer trend or the continuation of a trend that has been in consolidation for some time. In addition, the range makes it easier for the investor to determine the size of the SL, and when the trend is long term, and the trader is able to stay in it, such a trade can offer a very interesting RRR.<\/p>\n<p>The advantage of range trading (and it doesn&#8217;t matter if the trader is waiting for a particular trend or trades swings within the range) may also be that there is no need to use any indicators. Traders can, of course, help themselves with an indicator or oscillator, but even pure price action will serve very well here. Trend indicators such as moving averages are entirely pointless here.<\/p>\n<p>In the picture below, we see a case where a range formed on the EURUSD pair in early April 2020, in which the pair remained until the end of May. There were some interesting opportunities during this period, both long and short.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-422771\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/12\/eurusd-h4-21-12-15-H4.png\" alt=\"\" width=\"1320\" height=\"658\" \/><\/p>\n<p>As you can see on the daily chart, after breaking through resistance, the market formed a relatively strong trend that, with one longer consolidation (and another interesting range), lasted until the end of 2020. In this case, the April-May range served as a great signal for trend reversal and creating a new strong trend opportunity.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-422777\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/12\/eurusd-d1-21-12-15-D1.png\" alt=\"\" width=\"1320\" height=\"658\" \/><\/p>\n<p>One of the main disadvantages of trading within a certain range can be the low volume of trades. Since there is no one &#8220;prevailing&#8221; side (supply or demand) in the market, false breakouts of the range can occur due to lower liquidity.<\/p>\n<p>This can be a problem for both swing traders (hitting SL) and those waiting for a trend (false signal to enter). In this case, the aforementioned proper money management and risk management setup are essential.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every strategy has strong and weak periods. Some can adapt to it by simply holding on even during the weaker periods and survive them without much stress and incurring many losses, while others prefer using multiple approaches in their inventory and applying them at different stages of the market. A lot has been said &amp; [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":422829,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[162],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/422786"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=422786"}],"version-history":[{"count":7,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/422786\/revisions"}],"predecessor-version":[{"id":425892,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/422786\/revisions\/425892"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/422829"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=422786"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=422786"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=422786"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}