{"id":423770,"date":"2022-01-07T00:22:48","date_gmt":"2022-01-06T23:22:48","guid":{"rendered":"https:\/\/ftmo.com\/?p=423770"},"modified":"2022-01-28T16:23:04","modified_gmt":"2022-01-28T15:23:04","slug":"year-2021-in-numbers","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/year-2021-in-numbers\/","title":{"rendered":"The year 2021 in numbers"},"content":{"rendered":"<p><em>The beginning of a new year marks a perfect time to look back and evaluate what has been done in the past year and what can be improved in the upcoming one. We prepared a quick article to reveal some well-known as well as lesser-known statistics and figures that you might find interesting.<\/em><\/p>\n<p>It is probably pointless to talk about how well we did this year &#8211; our recent <a href=\"https:\/\/ftmo.com\/en\/ftmo-is-the-winner-of-deloitte-fast-50\/\">victory of Deloitte&#8217;s Fast 50 Award<\/a> speaks for itself. Our success is, of course, based on you, our clients, and potential FTMO traders.<\/p>\n<h2>Trading<\/h2>\n<p>Over the year, we have created more than 960,000 trading accounts through our platform for you. This total includes all FTMO Challenges, Verifications, FTMO Accounts, and Free Trials.<\/p>\n<p>More than 90,000,000 trades were executed on all accounts in 2021, indicating a reasonably active approach to trading. Just to put that number into perspective, we are talking about almost 3 new trades every second.<\/p>\n<p>And finally, the most important number: total payouts in 2021! In the past year, our FTMO Traders received an outstanding $29,000,000 in payouts. It is a truly incredible number and congratulations to all the traders! We have managed to reach merchants from more than 180 countries worldwide, and we regularly send payouts also to countries where, for example, $1,000 represents a truly significant amount of money, which makes us incredibly happy. In one trading period on FTMO Account, you executed on average 117.9 trades, and we paid you an average of $4,685.<\/p>\n<p>However, it&#8217;s not just about the payouts either. We perceive our project as a support of the whole retail trading industry. Just several years ago, the only options retail traders had were brokerage companies, where one needs tens or hundreds of his own dollars to get a chance to make decent money by trading. We&#8217;re glad that you&#8217;re helping us to change the world of trading and offer almost everybody a chance to make a living by trading.<\/p>\n<p>Perhaps not surprisingly, the most widely used account type was the Normal account type with classic trading conditions, which was chosen in almost 87% of orders. In the middle of the year, we also started offering the Swing account type, which was used by more than 11% of our clients in the remaining six months. The rest of our clients decided to go for the Aggressive risk account type.<\/p>\n<p>Gold (XAUUSD) was the most popular instrument in the past year, with EURUSD unsurprisingly leading among currency pairs, followed by GBPUSD, GBPJPY, USDCAD, and AUDUSD. Among indices, the most popular instruments were US Dow Jones (US30) and Nasdaq 100 (US100).<\/p>\n<p>The most widely used account currency among our traders was the US dollar, which was chosen by more than 70% of our traders. Over ten percent then opened an account in the euro (15%) and the British pound (13%). As we are a company based in the Czech Republic, we naturally also offer accounts in the Czech koruna, but it accounts for a small proportion of the total. The newly introduced currencies (CAD, AUD, CHF) are slowly gaining popularity month by month.<\/p>\n<h2>Blog<\/h2>\n<p>We realize that education in forex is critical, and that is why we have not neglected our blog at all. We have written 47 articles for you, in which we have covered various strategies and trading systems, and of course, we have not omitted articles on the psychological aspect of trading. The Q&amp;As with our successful traders who managed to pass the FTMO Challenge and Verification were also quite trendy, so we brought you 22 of them.<\/p>\n<h2>YouTube<\/h2>\n<p>Interviews with successful traders also got viral on our YouTube channel. The most-watched video with more than 200,000 views was an interview with a trader from the USA. He earned $101,609 in one month, which was clearly the highest Profit Split of the year.<\/p>\n<p>During the year, we made 73 videos for you. Apart from interviews with FTMO Traders, our Performance Coach Nelly has been explaining the basis of trading psychology, our colleague Peter helped our viewers with the basics of forex trading, and bearded Simon evaluated successful and unsuccessful FTMO Challenges and Verifications.<\/p>\n<p>You have watched our videos 3,087,076 times and spent lovely 273,667.6 hours watching them.<\/p>\n<h2>Facebook, Instagram, Twitter<\/h2>\n<p>We published 319 posts on good old Facebook in 2021, and you wrote 41,129 comments. <a href=\"https:\/\/www.facebook.com\/ftmocom\/videos\/552279639463551\">The post with the link to the Why FTMO video<\/a> got the most thumbs-up, over 2,100, and you also wrote the most comments on it &#8211; 214.<\/p>\n<p>We&#8217;ve published 135 posts on our Instagram in the past year. The post you liked the most was the <a href=\"https:\/\/www.instagram.com\/p\/CUCVH08qWHk\/?utm_source=ig_web_copy_link\">one about changing the payroll system and profit-sharing<\/a>, which got 7,115 likes. You wrote the most comments (588) on the <a href=\"https:\/\/www.instagram.com\/p\/CL9ZFGFildi\/?utm_source=ig_web_copy_link\">post about increasing the amount in the FTMO Account to $200,000<\/a>.<\/p>\n<p>The number of followers on our Instagram feed went over the 100,000 round mark at the beginning of the year, but you must have noticed that by now.<\/p>\n<p>There were 169 new posts on our Twitter account in 2021. In addition, 223,000 people visited our profile during the year, who mentioned us 1,166 times in their tweets.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The beginning of a new year marks a perfect time to look back and evaluate what has been done in the past year and what can be improved in the upcoming one. We prepared a quick article to reveal some well-known as well as lesser-known statistics and figures that you might find interesting. It is [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":425185,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[4809,670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/423770"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=423770"}],"version-history":[{"count":8,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/423770\/revisions"}],"predecessor-version":[{"id":425889,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/423770\/revisions\/425889"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/425185"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=423770"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=423770"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=423770"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}