{"id":424548,"date":"2022-01-19T16:06:43","date_gmt":"2022-01-19T15:06:43","guid":{"rendered":"https:\/\/ftmo.com\/?p=424548"},"modified":"2023-05-30T10:29:53","modified_gmt":"2023-05-30T08:29:53","slug":"what-to-watch-out-for-when-it-comes-to-rrr","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/what-to-watch-out-for-when-it-comes-to-rrr\/","title":{"rendered":"What to watch out for when it comes to RRR"},"content":{"rendered":"<p><em>Reward to risk ratio (RRR) is one of the significant factors of profitability, but still gets often overlooked by many novice traders. And what&#8217;s even worse, its definition and calculation may cause real confusion among traders. Not all RRRs mean the same thing.<\/em><\/p>\n<p>The RRR may seem as a subtle tool at first, but it is actually one of the most critical factors affecting long-term profitability. It is one of the essential money management tools of any serious trader. Combined with a strategy&#8217;s success percentage, RRR allows traders to estimate in advance what profits can be expected in the long run.<\/p>\n<h2>There is RRR and RRR<\/h2>\n<p>Before we talk about the RRR itself and its calculation, it is necessary to clarify the inconsistency in its description by different sources. In some web articles or books, we read that RRR stands for risk to reward ratio. In this case, the RRR is often portrayed as a ratio, for example 1:2, when the expected gain is double the loss. A value of 2:1 then means that losses are twice as high as gains, which does not bode well in the long run.<\/p>\n<p>The second interpretation (which is also used in FTMO) pictures RRR as a reward to risk ratio (or return to risk ratio). In this case, a higher RRR than 1 means that profits of successful trades are higher than losses of unsuccessful trades. This can be a bit confusing for traders, especially beginners, and should be kept in mind.<\/p>\n<p>So, in all our articles on this blog and in the Metrix app in the Client Area, we calculate the RRR as the ratio of expected profit to potential losses, in other words, the reward to risk ratio. Thus, the higher the RRR, the better for the trader, as even a smaller percentage of profitable trades may be sufficient to achieve long-term profitability.<\/p>\n<h2>Higher the RRR, the higher the chances of profits<\/h2>\n<p>If a trader wants to succeed in the long run, his reward to risk ratio should not fall below 1. This means that the expected average profits should be at least as large as the average losses. For an RRR of 1, a 50% success rate means that the trader stays break-even in the long run.<\/p>\n<p>If the RRR is less than 1, you need to achieve more than a 50% success rate. While this may not be an issue, a trader&#8217;s strategy with an RRR lower than one must account for relatively low drawdowns. This is because the more extensive the loss the trader has to make up for, the more difficult it is. For example, if the reward to risk ratio is at 0.5, a trader needs 67% of successful trades to stay at least break-even in the long run, while at a RRR of 0.2, it already needs to be 83% of all trades. And as far as FTMO traders are concerned, the 10% Max Loss rule is strict enough to prevent traders from trying for such a dangerous strategy.<\/p>\n<p>A higher RRR gives the trader a better chance of long-term success. A RRR value of 2 is enough for a trader with 33% of successful trades to end up at least with his initial balance.<\/p>\n<p>In this case, it only takes 3 profitable trades to wipe out the loss from five unsuccessful trades and put the trader in profit. If the trader calculates a Stop Loss of $100 and a Take Profit of $200 when opening each trade, after five losing trades, he will be $500 (5x$100) in the red. However, after the next three profitable trades (3&#215;200 USD), he will swing to a profit of 100 USD (after deducting commissions, the profit may be a little lower, but the trader will remain in green numbers).<\/p>\n<p>The higher the RRR, the lower the percentage of successful trades is necessary to make a trader profitable in the long run. With a high RRR strategy, traders can even afford a fairly long series of losing trades. In order to stay break-even, only a 25% success rate is enough with the reward to risk ratio value of 3. With a RRR of 5, you would need only a 17% success rate and with an RRR of 10, only 9% of successful trades would still be enough.<\/p>\n<h2>High reward to risk ratio is not for everyone<\/h2>\n<p>On the other hand, a similar high RRR approach may not be suitable for everyone. A high reward to risk ratio means that the trader has to set his Take Profits very far away (and a very significant move in the desired direction is necessary to reach it), or set very tight Stop Losses. In both cases, he must expect to realize losses even more often than profits.<\/p>\n<p>Sustaining a long losing streak, even if the trader has tested his strategy, requires very strong mental resilience. Again, for FTMO traders, a 10% Max Loss limit should be enough motivation not to overdo it with losing trades. And therefore before diving into the Forex market, every trader should first find and test a strategy that he\/she can follow and is suitable for his\/her trading style.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Reward to risk ratio (RRR) is one of the significant factors of profitability, but still gets often overlooked by many novice traders. And what&#8217;s even worse, its definition and calculation may cause real confusion among traders. Not all RRRs mean the same thing. The RRR may seem as a subtle tool at first, but it [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":425043,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/424548"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=424548"}],"version-history":[{"count":10,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/424548\/revisions"}],"predecessor-version":[{"id":611200,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/424548\/revisions\/611200"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/425043"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=424548"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=424548"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=424548"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}