{"id":425105,"date":"2022-01-27T16:33:50","date_gmt":"2022-01-27T15:33:50","guid":{"rendered":"https:\/\/ftmo.com\/?p=425105"},"modified":"2024-02-12T16:05:19","modified_gmt":"2024-02-12T15:05:19","slug":"a-few-answers-to-your-questions","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/a-few-answers-to-your-questions\/","title":{"rendered":"A few answers to your questions"},"content":{"rendered":"<p><em>Today&#8217;s article will be devoted to finding the answers to the several most frequent topics our support colleagues get asked about. If something still seems unclear even after reading the article, feel free to explore the FAQ section of our website as the answer is likely ready for you there.<\/em><\/p>\n<h2>Differences between individual account types<\/h2>\n<p>The Normal risk setup with <a href=\"https:\/\/ftmo.com\/en\/#objectives\">classic Trading Objectives<\/a> is the most popular choice among our clients, however, we also offer our clients one more type of account. The Swing account is a type of account designed for more conservative traders who hold positions for more extended periods. The main difference from the Normal account type is the ability to hold positions overnight and over the weekend even after passing the Verification. The Swing account is also <a href=\"https:\/\/ftmo.com\/en\/faq\/can-i-trade-news\/\">not restricted from trading macroeconomic news<\/a>.<\/p>\n<p>The trading period is the same for both risk setups, and the same fee refund applies here with the first payout from your FTMO Account. As you most likely know, there is no Profit Target once your trade on an FTMO Account, however, you can take advantage of our <a href=\"https:\/\/ftmo.com\/en\/scaling-plan\/\">Scaling Plan<\/a> to increase your balance by meeting certain conditions. For a balance increase, the trader has to generate at least 10% of net profit in four consecutive monthly cycles. Upon meeting these conditions, the balance of the FTMO Account gets increased by 25%.<\/p>\n<p>Another major change from the Normal account is the size of the leverage. Since the Swing account is designed for traders who hold positions for several days or even weeks and unpredictable market movements can occur, the base leverage is reduced to 1:30. Following are the leverages on each asset class: 1:30 for forex pairs (1:100 for the Normal account type), 1:15 for indices (1:50 for the Normal account type), 1:9 for metals (1:30 for the Normal account type) and 1:1 for cryptocurrencies, equity CFDs and for commodities, the leverage in a Swing account is 1:1 (1:3.3 for the Normal account type).<\/p>\n<p>For most traders, the lower leverage changes virtually nothing, especially with a large account size. If we open one lot on the EURUSD pair, the required margin for the Normal account type would be EUR 1,000, and for the Swing account, it would be EUR 3,333.33.<\/p>\n<h2>How about commission and margins<\/h2>\n<p>Another common question from clients is how commissions and margin sizes are calculated. Of course, we can offer you several formulas to calculate the size of the margin or the maximum position you can open in your account.<\/p>\n<p>Basic information about each instrument can be found on the <a href=\"https:\/\/ftmo.com\/en\/symbols\/\">Symbols page<\/a>. Each week our clients can find out all the changes for the next week on this page. There&#8217;s also a table of all the instruments and information regarding each instrument they can trade with FTMO (leverage, commission, contract size, etc.).<\/p>\n<p>Sometimes, however, the simplest solution is also the most effective solution. Instead of worrying about calculations and plugging values into formulas, the easiest approach is to try trading on the fly. We know very well that there is no substitute for hands-on experience, which is why we offer our potential clients the opportunity to try out trading in the wild, using our Free Trial account.<\/p>\n<p>Clients have 14 days to familiarize themselves with the platform, see how spreads change depending on the time or session for all the instruments we offer, etc. They can also see what commissions apply on each instrument depending on how large positions they open, while also learning how much margin they will need on a particular contract size for each instrument. The formulas may seem interesting when we want to brag to our non-trading friends and try to show off how complicated forex trading is, but in reality, they are only used by those who have the time to deal with the details instead of dealing with the trading and their approach to it.<\/p>\n<p>Every brokerage company now offers a similar free demo account service. But the problem with them is that the client has different conditions (execution speed, spread size, slippage, etc.) on the demo account compared to the live account. At FTMO, clients have the same conditions on the Free Trial version, FTMO Challenge\/Verification, and then directly on the FTMO Account. So, in addition to being able to experience the platform for free, clients have the opportunity to experience exactly what they will experience on the paid accounts.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Today&#8217;s article will be devoted to finding the answers to the several most frequent topics our support colleagues get asked about. If something still seems unclear even after reading the article, feel free to explore the FAQ section of our website as the answer is likely ready for you there. Differences between individual account types [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":425161,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/425105"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=425105"}],"version-history":[{"count":15,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/425105\/revisions"}],"predecessor-version":[{"id":607423,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/425105\/revisions\/607423"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/425161"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=425105"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=425105"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=425105"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}