{"id":425367,"date":"2022-02-04T08:34:43","date_gmt":"2022-02-04T07:34:43","guid":{"rendered":"https:\/\/ftmo.com\/?p=425367"},"modified":"2022-02-04T18:54:09","modified_gmt":"2022-02-04T17:54:09","slug":"what-to-look-out-for-when-choosing-an-expert-advisor","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/what-to-look-out-for-when-choosing-an-expert-advisor\/","title":{"rendered":"What to look out for when choosing an Expert Advisor"},"content":{"rendered":"<p><em>Expert Advisors or forex robots are popular tools especially for traders who want to eliminate the influence of psychology on trading. However, they are not independent money-makers, and there are several important factors that need to be considered when choosing which Exper Advisor should you use.<\/em><\/p>\n<p>Perhaps every trader has come across the term automated trading system, forex robot, or expert advisor (EA). We have already written a lot about EAs and algorithmic trading on our blog, <a href=\"https:\/\/ftmo.com\/en\/a-big-test-of-algo-trading-does-it-work\/\">we tested several systems<\/a> and we also provided you with a <a href=\"https:\/\/ftmo.com\/en\/mql4\/\">complete guide to MQL programming<\/a>, which allows traders to create their own EA in MetaTrader (traders also have a similar option with cTrader).<\/p>\n<h2>Psychology, discipline, and time<\/h2>\n<p>The use of an automated trading system is often considered by traders who have problems with the psychological side of trading. The most common advantage mentioned in connection with the use of EAs is namely the elimination of emotions and their influence on the results. EA has clearly defined rules based on which the positions are executed, so there is no psychological stress or problems with discipline.<\/p>\n<p>Another advantage is time-saving, especially if the EA is sufficiently tested and fine-tuned (of course, the testing itself can take some time and should not be underestimated by the trader, but the EA can do it much faster than if the trader did it manually).<\/p>\n<p>The trader does not have to interfere with the EA at all because the system can open and close orders by itself according to predefined rules. This is also related to the speed of the EA, which can react much faster to market moves so that the trader can realize trades despite not sitting in front of the open trading platform for days. The shorter the timeframe a trader uses, the more significant the speed advantage gets.<\/p>\n<p>If a trader wants to have at least some control over the system&#8217;s functioning, he can use EA to generate signals and execute trades himself. That however partly erases the time efficiency and creates more room for possible human errors.<\/p>\n<h2>Watch out for macroeconomic news<\/h2>\n<p>The main disadvantage of most EAs is the inability to react to important macroeconomic news. If the trader himself does not intervene in the functioning of his EA, the system may misjudge increased volatility in the markets at the time of the news and execute trades that will potentially lead to unnecessary losses.<\/p>\n<p>In addition to the ability to program their own EAs, traders have great options to purchase a ready-made solution on the Internet, but this is where the problems can begin. The fact that creators of these off-the-shelf solutions get paid for their products is not a problem in itself because a functional EA that generates enough profitable trades, in the long run, cannot be free. So it&#8217;s not the price that would be the issue here (although sometimes the price\/quality ratio can be worthless).<\/p>\n<p>Many products that a trader can buy give relatively little information about how they actually work. At best, a trader can look at the trade history, the evolution of the balance and equity in the account on which the system operates, possible drawdowns, etc., but he or she will likely not learn the details of the system.<\/p>\n<p>As far as drawdowns are concerned, traders who want to use the FTMO services should be cautious here. As our trading rules regarding maximum losses are pretty strict, traders must be careful not to choose an EA that commonly creates drawdowns greater than 10%.<\/p>\n<p>They also need to keep in mind that if they use a third-party EA, there may already be other traders using the same EA and, therefore, the exact same strategy. By using a third-party EA, traders run the risk of being denied an FTMO Account because they <a href=\"https:\/\/ftmo.com\/en\/faq\/which-instruments-can-i-trade-and-what-strategies-am-i-allowed-to-use\/\">exceed the maximum capital allocation rule<\/a>.<\/p>\n<h2>Over-optimization<\/h2>\n<p>When the trader gets to the trade history, he must pay attention to other details. Many EAs provide a view of the trade history that is somehow optimized to make the results look promising. But the results themselves are not the most important thing an investor should focus on. We&#8217;ve already mentioned balance and equity trends or drawdowns, but what&#8217;s essential is an indication of how many positions the AOS is opening to achieve a given outcome.<\/p>\n<p>In one of our articles, <a href=\"https:\/\/ftmo.com\/en\/martingale-forex-trading\/\">we wrote about martingale-based systems<\/a>, where the system opens a double position in the event of a failed exit. With such systems, it may be that too many funds are required to open a position that the ordinary trader does not even have in his account.<\/p>\n<p>Scalping-based systems may suffer from a similar problem. In addition to the size of positions, the problem here is the number of open trades, often lasting only a few seconds. It may look good in the results table, but you have to consider possible broker fees or spreads. These can put an enormous burden on a trader&#8217;s account if there are many open positions, and a strategy that works for one brokerage may be a significant loss for another broker.<\/p>\n<p>At the other extreme, in the pursuit of optimal results, the periods in which a trade is open may be too long. If a trader sees in the trading history of the chosen EA that some trades have lasted more than a few months (or years in extreme cases), it will probably be clear to him that this will not be a suitable system for trading forex or via CFDs. Trying to make a profit at any price in such a case makes no sense, especially when the trader has to reckon with fees in the form of swaps etc.<\/p>\n<p>Last but not least, traders need to be wary of strategies that do not use Stop Loss at all or only to a minimal extent. Although many traders do not use Stop Loss for one reason or another, and even with EA, this approach may work for a while, sooner or later, an unforeseen situation will arise that can mean a significant loss.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Expert Advisors or forex robots are popular tools especially for traders who want to eliminate the influence of psychology on trading. However, they are not independent money-makers, and there are several important factors that need to be considered when choosing which Exper Advisor should you use. Perhaps every trader has come across the term automated [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":425371,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/425367"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=425367"}],"version-history":[{"count":8,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/425367\/revisions"}],"predecessor-version":[{"id":425877,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/425367\/revisions\/425877"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/425371"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=425367"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=425367"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=425367"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}