{"id":427166,"date":"2022-03-10T10:04:26","date_gmt":"2022-03-10T09:04:26","guid":{"rendered":"https:\/\/ftmo.com\/?p=427166"},"modified":"2022-03-11T14:38:19","modified_gmt":"2022-03-11T13:38:19","slug":"why-overtrading-is-dangerous-and-how-to-prevent-it","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/why-overtrading-is-dangerous-and-how-to-prevent-it\/","title":{"rendered":"Why overtrading is dangerous and how to prevent it"},"content":{"rendered":"<p><em>If you have no experience with overtrading, it&#8217;s like you have never even traded. Soon or later, everyone gets to the stage where they make too many trades, in a hurry, without following the rules, and most importantly, completely unnecessarily. How to deal with this?<\/em><\/p>\n<p>Overtrading is a habit that most traders trying to make money in forex have already encountered. The ability to trade at virtually any time of the day, the large selection of trading instruments from which nearly everyone can choose, and perhaps even the pressure coming from advertisements that try to portray forex as a money machine and a source of certain high returns. All this can be behind the fact that traders start entering trades that one should not place at all, breaking the rules and taking unnecessary risks. The result is losses, unnecessary money paid in fees, and an upset psyche.<\/p>\n<p>This happens mostly to intraday traders who feel that they might miss out on something if they don&#8217;t make a trade during the day. Yet, intraday traders should also realize that in their case, there are always plenty of exciting opportunities in the market that can secure them interesting profits. However, overtrading does not avoid swing traders or those who usually hold trades for more than a few hours.<\/p>\n<p>Traders who struggle to meet the FTMO Challenge or Verification requirements are also vulnerable. Trying to make a profit of at least 10% in a month can lead to the feeling that more trades automatically mean a greater chance of success. It is important to remember that quality is still more important than quantity in forex.<\/p>\n<h2>Why do we tend to overtrade?<\/h2>\n<p>If we want to avoid overtrading, we must first understand why we are turning to it. As already mentioned, intraday traders often feel that they have to make a trade even when virtually no signal comes to them. As one of our colleagues says, they become more &#8220;creative&#8221; when looking for signals.<\/p>\n<p>This can happen after a series of profitable trades when the trader starts to feel invincible and gets greedy. Two or three trades a day are then no longer enough, and he\/she starts to see trading opportunities where he\/she would certainly not have seen them otherwise.<\/p>\n<p>The opposite reason is the desire to take revenge on the market after a series of losing trades. The trader feels that he needs to get into profit as soon as possible, and if he is not determined to do so by increasing positions volume (which is, of course, also wrong), he needs to make up for it with lots of trades. This is where creativity and trying to see signals everywhere come in.<\/p>\n<p>One of the reasons why traders end up overtrading is frequent strategy changes. When a trader feels that the current approach is not working, he\/she starts trying alternative methods and from there, overtrading is not far away.<\/p>\n<p>As you can see, the danger of overtrading is that it can be triggered by a whole number of different conditions. These factors can occur repeatedly over time to any trader, which makes it very difficult to defend against. This is because if a trader focuses on not overtrading after a series of losing trades, it can then easily happen after a series of gain trades.<\/p>\n<p>Trader&#8217;s current feelings and emotions can also make a difference, regardless of the results. Once it may be a feeling of excitement and the need to take risks at all costs, other times it may be boredom when the trader feels that nothing is happening in the market and he\/she should change that with an exciting trade.<\/p>\n<h2>What to do about it?<\/h2>\n<p>One of the main &#8220;cures&#8221; for overtrading is to responsibly stick to your long-established, sufficiently tested strategy and not try to extract more trades from it than it offers. It may well happen that an intraday trader does not get a good signal to enter during a trading session. In such a case, the key is to stay calm and not try to find a signal at any cost, no matter if it is after a series of profitable or losing trades. The more experienced traders know very well that it often takes just one good trade to restore their confidence, eroded by a series of unsuccessful trades. They rarely make such a good trade while breaking the rules.<\/p>\n<p>It is very convenient to set a maximum number of trades per session, and when the limit is reached, turn off the trading platform and forget about trading, focus on something else, go for a walk, etc. A simple limit on the number of instruments a trader follows should also help. There cannot be as many opportunities on one index as on seven currency pairs or five indices (despite how correlated they may be) in a day, even with great creativity on the trader&#8217;s part.<\/p>\n<p>An attractive solution may be to extend the time a trader spends deciding whether to enter the market. Instead of impulsively opening a trade immediately after the signal has formed, it is a good idea to take some time to think about why are you entering the trade, what its upside potential and RRR are, check the calendar to see if there is important news coming up, so once again, simply take your time. While it is possible that the trader, in the end, may not realize a few good signals, it is still better not to be in a profitable trade than to be in a losing one.<\/p>\n<p>Our performance coach Nelly also examined overtrading from the psychological point of view in her last video, <a href=\"https:\/\/www.youtube.com\/watch?v=PUV3EsADvUQ\">you can watch it on our YouTube channel<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you have no experience with overtrading, it&#8217;s like you have never even traded. Soon or later, everyone gets to the stage where they make too many trades, in a hurry, without following the rules, and most importantly, completely unnecessarily. How to deal with this? Overtrading is a habit that most traders trying to make [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":427279,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/427166"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=427166"}],"version-history":[{"count":12,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/427166\/revisions"}],"predecessor-version":[{"id":611258,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/427166\/revisions\/611258"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/427279"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=427166"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=427166"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=427166"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}