{"id":428244,"date":"2022-03-24T22:54:58","date_gmt":"2022-03-24T21:54:58","guid":{"rendered":"https:\/\/ftmo.com\/?p=428244"},"modified":"2022-03-25T15:11:02","modified_gmt":"2022-03-25T14:11:02","slug":"if-you-want-to-make-money-dont-be-afraid-to-take-risk","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/if-you-want-to-make-money-dont-be-afraid-to-take-risk\/","title":{"rendered":"If you want to make money, don&#8217;t be afraid to take risk"},"content":{"rendered":"<p><em>Forex trading is a risky sport. Anyone who does not realize this has no business in forex. Yet, many people get involved in trading while trying way too hard to limit their risks. However, the returns always depend on the level of risk a trader is willing to take.<\/em><\/p>\n<p>Taking risks does not mean that we should open excessive positions at any cost for a quick profit. Responsible trading is not a sprint, it is a long run, and nothing should be overdone. On the other hand, even an overly cautious approach may not lead to the desired result.<\/p>\n<p>Managing risk is not about trying to remove it completely &#8211; that is simply impossible. Instead, it is about accepting the risk and looking for an approach that allows us to make a profit even in high-risk markets.<\/p>\n<p>The days when retail traders could not afford to risk more significant nominal losses are now a thing of the past, thanks to firms such as FTMO as talented and skilled traders are provided with accounts large enough to mitigate the need for unnecessarily significant risks. But on the other hand, some under-shooting of positions is also going nowhere. Ultimately, it can also lead to the frustration of the trader who is aware that he has more-than-sufficient funds to trade, but the results do not really match it.<\/p>\n<p>Sometimes traders tend to open small positions with large accounts because they are not used to higher amounts. Ultimately, you just need to remember that it&#8217;s a game of percentages. While it may seem at first glance that a 1% loss on a $200,000 account is a lot of money, from the trader&#8217;s perspective, it should feel the same as risking $500 on a trade on a $50,000 account. A stop loss of 1% of the account is simply acceptable in both cases.<\/p>\n<h2>Higher volatility may not be a problem<\/h2>\n<p>Current market conditions may also be one of the reasons why some traders are unwilling to take reasonable risks and are reducing their positions. This may seem logical because unexpected news that swing the price often lead to losses that the trader would not have realized.<\/p>\n<p>But on the other hand, more volatile periods can be opportunities for unexpected gains too. When a trader has a properly tested strategy, a more volatile market period should not derail him. Assuming the trader has devoted sufficient effort and time to test the strategy, it is very likely that his approach during periods of increased volatility will be as profitable as when the volatility is average.<\/p>\n<h2>When things are going well, risk is not a sin<\/h2>\n<p>Sometimes it seems that traders are not afraid to lose because they tend to increase their initially small stop loss when the price does not move in the desired direction. On the other hand, they are afraid of making a profit because if their trade goes into profit, they try to close it as soon as possible to make at least some profit. Correctly, it should be just the opposite. When a trade goes in a loss, and it is clear that the loss will only increase given the market trend, it is better to close the trade before the price breaks the stop loss. Conversely, when the price moves in the direction we want after opening the position, it is not a mistake to move the Take Profit and increase the initial RRR.<\/p>\n<p>We often write in our articles that traders should not take unnecessary risks in a rush for big and fast profits. This still remains true, but unnecessary fears and needlessly small positions will also not lead to success in Forex. Long story short &#8211; if you can’t stand the heat, get out of the kitchen.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Forex trading is a risky sport. Anyone who does not realize this has no business in forex. Yet, many people get involved in trading while trying way too hard to limit their risks. However, the returns always depend on the level of risk a trader is willing to take. Taking risks does not mean that [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":428301,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/428244"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=428244"}],"version-history":[{"count":8,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/428244\/revisions"}],"predecessor-version":[{"id":428324,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/428244\/revisions\/428324"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/428301"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=428244"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=428244"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=428244"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}