{"id":428553,"date":"2022-04-01T07:26:25","date_gmt":"2022-04-01T05:26:25","guid":{"rendered":"https:\/\/ftmo.com\/?p=428553"},"modified":"2022-04-01T15:52:12","modified_gmt":"2022-04-01T13:52:12","slug":"want-feedback-try-the-trading-journal","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/want-feedback-try-the-trading-journal\/","title":{"rendered":"Want feedback? Try the trading journal"},"content":{"rendered":"<p><em>Psychology, money management, risk management, discipline, all of these must be in the toolbox of a successful trader before he executes a trade. However, opening and closing a position is not the end of the story here. Keeping a trading journal can also make a difference between success and failure.<\/em><\/p>\n<p>Few traders realize the importance of keeping a trading journal. In fact, it is a process that most traders underestimate and consider a waste of time. At first glance, it may seem that it has nothing much to do with trading itself because the trade is already over (no matter if in profit or loss) and the trader should rather focus on new opportunities. However, the reality could not be further from the truth and it is a misunderstanding of the function of a trading diary.<\/p>\n<p>A trading journal should function not only as a feedback tool suitable for recording your executed trades. It is its primary function, but we can download the trade statistics directly from the trading application too. Numbers are important when creating a trading strategy and creating a trading plan or when testing and evaluating the strategies we use.<\/p>\n<p>All of this is important, of course, so that we can fine-tune our strategy in such a way that we can then rely on it even when things aren&#8217;t going so well. Thus, the journal comes in handy in finding the ideal timing of entries, the appropriate instruments for a given strategy, the ideal position size, or the appropriate stop loss.<\/p>\n<p>The statistics written in the diary help us find the strengths and weaknesses of a strategy, but they tell us nothing about ourselves, our character. The strategy itself may not always be the path to successful trading.<\/p>\n<h2>A trading diary is not just about statistics<\/h2>\n<p>Trading is about emotions just as it is about numbers, and emotions can not be found in statistics among plain numbers. Describing our emotions and thoughts when entering and exiting a trade can be one of the greatest added values of a trading diary. When we write down our thoughts and feelings in the journal immediately after the trade, the thoughts are still clear, fresh and make an accurate record of the situation. We cannot rely on remembering the details of a trade even a month or six months later.<\/p>\n<p>Therefore, it is important to write down our thoughts as soon as possible after the deal is made and to describe our feelings as accurately and honestly as possible. When we then look at the trade on the chart in hindsight, we may feel that the trade was not logical or did not meet our rules.<\/p>\n<p>Comments on trade help us to get a better perspective, to see what led us to make the trade and ideally to learn from it. Such feedback will help us to identify the most common mistakes that lead to losing trades, when we are making profitable trades, whether we are disciplined enough and whether and to what extent we are following our trading plan.<\/p>\n<p>In the long run, the diary can thus help us not only to achieve a statistical advantage, but also to be better disciplined, have a higher percentage of success and be more consistent in our trading. Just by sitting down each day and writing our thoughts in our journal, we are exercising our discipline.<\/p>\n<h2>FTMO Account MetriX<\/h2>\n<p>Within the Account MetriX application we offer our traders the possibility to write notes in their own trading diary. By linking to our trading account, we eliminate the need to write down basic data such as entry and exit time, entry and exit price, instrument name, position size and SL and TP levels. Together with the trading journal, we also have access to other data about our trades, a chart of asset development or basic long-term statistics (e.g. RRR, trade success rate, profit factor, etc.), which adds even more value to this tool.<\/p>\n<p>In addition to the basic data, we have the option to write down our entry and exit strategy in the journal. This is important information when analysing a trade backwards, so that we know why we entered the trade and under what conditions we eventually exited. Chart previews at the opening and closing of a position will also help us to do this.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-428674\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture.png\" alt=\"\" width=\"1179\" height=\"852\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture.png 1179w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture-300x217.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture-1030x744.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture-768x555.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture-705x509.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture-24x17.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture-36x26.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture-48x35.png 48w\" sizes=\"(max-width: 1179px) 100vw, 1179px\" \/><\/p>\n<p>The commentary on the trade is equally important because here we can describe our mood and feelings at the opening and closing of the trade, whether we are satisfied with the trade or what we didn&#8217;t like about the entry or exit. We can also tag each trade for better orientation and filtering of the trades.<\/p>\n<p>If you haven&#8217;t tried the trade diary to date and feel that your trades are not what they could be, you should probably change your attitude. Nowhere is it written that keeping a trading journal will make you a professional trader. But it can help you to better results.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Psychology, money management, risk management, discipline, all of these must be in the toolbox of a successful trader before he executes a trade. However, opening and closing a position is not the end of the story here. Keeping a trading journal can also make a difference between success and failure. Few traders realize the importance [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":428645,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/428553"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=428553"}],"version-history":[{"count":9,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/428553\/revisions"}],"predecessor-version":[{"id":600284,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/428553\/revisions\/600284"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/428645"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=428553"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=428553"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=428553"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}