{"id":523651,"date":"2022-04-13T11:23:35","date_gmt":"2022-04-13T09:23:35","guid":{"rendered":"https:\/\/ftmo.com\/?p=523651"},"modified":"2022-04-15T17:46:34","modified_gmt":"2022-04-15T15:46:34","slug":"are-you-new-to-trading-less-is-sometimes-more","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/are-you-new-to-trading-less-is-sometimes-more\/","title":{"rendered":"Are you new to trading? Less is sometimes more"},"content":{"rendered":"<p><em><span data-preserver-spaces=\"true\">Do you want to start trading and think of going ahead without any preparation because you don&#8217;t want to waste time?<\/span> Forget it. Without trying out trading on a demo account, you&#8217;re likely to become just another source of money in an already liquid market.<\/em><\/p>\n<p>&nbsp;<\/p>\n<p>Although it may sound discouraging and boring, it won&#8217;t work for you in forex (as in any other business) without a theoretical foundation. We can&#8217;t think that we could just go ahead and open an account and get straight into trading with no previous experience. The basics of how financial markets work, the most important rules of leveraged trading (money management, risk management, SL, TP, etc.), the difference between technical and fundamental analysis, the instruments that we can trade, all this we need to know long before we even start thinking about our first trade, creating a trading plan and strategy.<\/p>\n<p>Having mastered the theoretical basics, nothing should prevent us from opening an account with a brokerage firm or using the services of firms like FTMO. However, before we actually start thinking about trading, we should not skip trading on a demo account or Free Trial account, as we call it at FTMO.<\/p>\n<p>By trading on a Free Trial account, not only we can try out the platform itself and new strategies, but we can also learn patience and follow the basic rules of money management and risk management, which we cannot do without even when we can consider ourselves experienced traders.<\/p>\n<h3>There is no need to rush<\/h3>\n<p>Too much rush for dream profits and unwillingness to take the time to study and trade on a Free Trial account is one of the reasons why the vast majority of forex traders lose all their money in a relatively short period of time. While it is true that undercapitalization is often the reason, this is something that companies like FTMO are helping to solve these days. Patience is such an important skill to learn in a Free Trial account. If one deal doesn&#8217;t work out, another will come along; there&#8217;s no rush. And that&#8217;s true on a Free Rrial as well as on any other account.<\/p>\n<h3>One instrument, one strategy<\/h3>\n<p>When it comes to testing a strategy, it&#8217;s a good idea to choose one that is as simple as possible and fits you the best. <a href=\"https:\/\/ftmo.com\/en\/more-strategies-bring-more-profitable-trading-opportunities\/\">We recently wrote an article here about how more experienced traders can benefit from a portfolio of strategies to trade on a larger number of instruments<\/a>.<\/p>\n<p>Beginners on Free Trial accounts who are still getting to grips with the forex environment do not have to deal with this problem. In their case, it should be about the most straightforward possible approach to trading and understanding how the markets work, not about making big profits in the first place.<\/p>\n<p>The more complex and &#8220;sophisticated&#8221; the approach that requires us to concentrate and follow many conditions, the greater the chances of losing trades due to non-compliance with the strategy. There is no need to overdo it with the number of instruments either. Ideally, we pick one currency pair or index that fits the chosen approach and focus on that.<\/p>\n<h3>Responsible approach and account size<\/h3>\n<p>We need to trade on a demo account as if we were trading on the real account. Otherwise, it is meaningless. Executing trades that are not in line with the strategy just to try it out or opening unnecessarily large positions to make up for past losses is not the way. It leads to incorrect strategy results, and, in the case of a large number of randomly successful trades, to a false sense of being successful and ready for the real account.<\/p>\n<p>Also, the size of the capital in the demo account should be the same as in the planned &#8220;live&#8221; account. We will get used to the size of the positions we will be opening, and we will also get used to the size of the expected losses and profits in financial terms. If we get used to a loss of $1,000 on a Free Trial account (which is one per cent on a $100,000 account), we will have a hard time getting used to a stop loss of $250 on a $25,000 FTMO Account.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Do you want to start trading and think of going ahead without any preparation because you don&#8217;t want to waste time? Forget it. Without trying out trading on a demo account, you&#8217;re likely to become just another source of money in an already liquid market. &nbsp; Although it may sound discouraging and boring, it won&#8217;t [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":523820,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/523651"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=523651"}],"version-history":[{"count":16,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/523651\/revisions"}],"predecessor-version":[{"id":524015,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/523651\/revisions\/524015"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/523820"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=523651"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=523651"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=523651"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}