{"id":524174,"date":"2022-04-22T14:00:35","date_gmt":"2022-04-22T12:00:35","guid":{"rendered":"https:\/\/ftmo.com\/?p=524174"},"modified":"2023-05-11T13:09:07","modified_gmt":"2023-05-11T11:09:07","slug":"strict-discipline-is-the-prime-way-to-success-in-trading","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/strict-discipline-is-the-prime-way-to-success-in-trading\/","title":{"rendered":"Strict discipline is the prime way to success in trading"},"content":{"rendered":"<p><em>Novice traders who want to pass FTMO Challenge should not only be concerned with the Maximum Loss or Maximum Daily Loss rules. While these are important from the risk management and money management perspective, there are many more factors a trader must consider for long-term success.<\/em><\/p>\n<p>All traders should follow some basic rules in their strategy to help them achieve a statistical edge in the long run. Today, we&#8217;ll cover a few basic ones that may be what separates successful traders from the unsuccessful ones.<\/p>\n<h2>Letting the trades work<\/h2>\n<p>One of the essential rules recommendable especially to newbies is to keep the Stop Loss and Take Profit levels fixed. When a trader has a tested strategy with a long-term RRR of 3:1, such an approach should be followed not only in the test and Free Trial, but also in the FTMO Challenge, Verification, and FTMO Account. Once there is an open position, do not carelessly modify your SL and TP unless there is a truly solid reason for doing so. Many traders move their SL, use a trailing stop, or <a href=\"https:\/\/ftmo.com\/en\/scaling-out\/\">close parts of their position (scaling out)<\/a>. However, they should only do this if they have properly backtested the profitability of such approach.<\/p>\n<h2>RRR<\/h2>\n<p>Having mentioned RRR, it is also necessary to think of long-term trading results. In the vast majority of cases, <a href=\"https:\/\/ftmo.com\/en\/what-to-watch-out-for-when-it-comes-to-rrr\/\">you can&#8217;t make long-term profits with an RRR of less than one.<\/a> If you get more losses than profits, your average profit simply must exceed the average loss. Not that this is impossible, but most traders are not able to keep their success percentage above 60% in the long run. On top of that, a trader has to account for relatively small drawdowns because the more significant the loss, the harder it is for a trader with a low RRR to make a profit. With an RRR of 2:1 (which is relatively simple to achieve and is used by many traders), the trader needs a success rate of only 33% to end up at least at break-even in the long run.<\/p>\n<h2>Maximum number of positions<\/h2>\n<p>In any case, intraday traders should determine in advance how many positions they plan to open per day. Overtrading has never been a profitable approach. If a trader executes three or four profitable trades in a day, the profit made should usually be enough. The possibility of opening more trades in a state of extreme euphoria increases and the rules are easiest to break. After a series of losing trades, there is again the risk of revenge trading, which also is never a good idea.<\/p>\n<h2>Trading hours<\/h2>\n<p>Traders should also be clear about the appropriate to trade the chosen instruments. For example, traders in Europe who like the DAX index should generally avoid opening positions before 8:00 AM when the liquidity peaks. Similarly, traders favouring US equity indices should start trading no earlier than 15:30 CET, when US stock markets open. Due to the global focus of forex, trading hours for specific majors and minors are not as heavily influenced by the opening hours of individual markets, but even there, traders should use backtests to determine when it is best to enter a position and when it is best to avoid the markets.<\/p>\n<h2>Wait for the signal<\/h2>\n<p>Once a trader has determined when to trade, he should also be able to wait for a signal to enter the market. Many traders make the fundamental mistake of being impatient and trying to enter the market at any cost and simply do not wait for a signal. Yes, sometimes it may work out, but in the long run, you&#8217;re on your best way toward the stop-out level (or Max Loss limit). Traders simply have to wait for a good signal. Test your strategy and perfect your entries to the point where it pays out to wait, and if a signal doesn&#8217;t appear in the market, then simply don&#8217;t trade.<\/p>\n<p>We may sound like a broken record, but practice makes perfect. Forex trading is not a sprint, but a long-distance run, and if a trader cannot follow at least the basic rules, the probability of success is very low.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Novice traders who want to pass FTMO Challenge should not only be concerned with the Maximum Loss or Maximum Daily Loss rules. While these are important from the risk management and money management perspective, there are many more factors a trader must consider for long-term success. All traders should follow some basic rules in their [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":524379,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/524174"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=524174"}],"version-history":[{"count":10,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/524174\/revisions"}],"predecessor-version":[{"id":594392,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/524174\/revisions\/594392"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/524379"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=524174"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=524174"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=524174"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}