{"id":525661,"date":"2022-05-06T13:00:09","date_gmt":"2022-05-06T11:00:09","guid":{"rendered":"https:\/\/ftmo.com\/?p=525661"},"modified":"2022-05-06T11:32:14","modified_gmt":"2022-05-06T09:32:14","slug":"economic-calendar-watch-out-for-volatility-during-nfp","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/economic-calendar-watch-out-for-volatility-during-nfp\/","title":{"rendered":"Economic calendar &#8211; Watch out for volatility during NFP"},"content":{"rendered":"<p><em>Forex traders are primarily looking for signals to enter the market based on technical analysis and chart studying. A lot of traders do not follow fundamentals at all, and many try to avoid them. However, the important news in the economic calendar should not be completely overlooked by any serious trader.<\/em><\/p>\n<p>Regular monitoring of the economic calendar expands traders&#8217; ability to navigate market events and can significantly help to plan trade entries. When traders know that critical information that can sway asset prices and currency pair rates is headed to the market, it is easier for them to adjust their style or possibly avoid trading altogether.<\/p>\n<p>An excellent example of the usefulness of calendar tracking was the first week of May 2022, when some major macroeconomic data hit the market and three central banks were adjusting interest rates. Of course, this had a significant impact on market volatility, where there was a lot to be gained and a lot to be lost.<\/p>\n<h2>Most important news<\/h2>\n<p>While the calendar is often packed with news, not all of it might necessarily be important to you, and not all of it has the same impact on market events. Often, we can filter the news and select only news related to the currency or country of our choice. Our calendar on the FTMO website highlights important news where trading restrictions apply (more <a href=\"https:\/\/ftmo.com\/en\/faq\/can-i-trade-news\/\">HERE<\/a>) and which traders should definitely watch out for. When a surprising value is published, its impact on the given currency or investment instrument can cause a lot of short-term volatility in the market and often cause spreads to widen. This can lead to significant losses even if traders have set a reasonable SL.<\/p>\n<p>Such important releases include data related to the labour market, inflation or GDP developments, purchasing managers&#8217; indices, trade balance, consumer confidence, retail sales, and last but not least, central banks&#8217; monetary policy decisions and interest rate settings.<\/p>\n<p>We will cover all these important data, their significance, and their impact on the markets in more detail in the series of articles we are starting today on the so-called NFP report, which is a report on non-farm employment in the US.<\/p>\n<h2>Change in nonfarm employment<\/h2>\n<p>The change in nonfarm employment, commonly referred to as Nonfarm Payrolls, is one of the most critical data points on the economic calendar. The report is published on the first Friday of each month and shows the change in the number of employees in the previous month, excluding the agricultural sector.<\/p>\n<p>This report is published in the US at the same time as other labour market data, which we will write more about in the future part of this series. The data are published by the Bureau of Labor Statistics (BLS), which surveys approximately 141,000 firms and government agencies representing about 486,000 separate worksites as part of the Current Employment Statistics (CES) program. Thus, it provides detailed data on employment hours and earnings of employees outside the agricultural sector.<\/p>\n<p><iframe loading=\"lazy\" src=\"https:\/\/tradingeconomics.com\/embed\/?s=nfp+tch&amp;v=202204011243v20220312&amp;h=300&amp;w=600&amp;ref=\/united-states\/non-farm-payrolls\" width=\"600\" height=\"300\" frameborder=\"0\" scrolling=\"no\"><\/iframe><br \/>\nSource: <a href=\"https:\/\/tradingeconomics.com\/united-states\/non-farm-payrolls\">tradingeconomics.com<\/a><\/p>\n<p>Job creation is one of the most important indicators of consumer spending, which accounts for the majority of economic activity. NFP is thus one of the first data points that give investors a picture of the state of the US economy. The importance of this data and the fact that it is published at the beginning of the month leads to significant movements not only in forex, but also in the stock or bond market. In the image below, we see the volatility on the EURUSD currency pair after the NFP numbers released in December were much worse than expected, which led to a weaker USD.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-525700\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/eurusd-m15-NFP.png\" alt=\"\" width=\"1631\" height=\"731\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/eurusd-m15-NFP.png 1631w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/eurusd-m15-NFP-300x134.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/eurusd-m15-NFP-1030x462.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/eurusd-m15-NFP-768x344.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/eurusd-m15-NFP-1536x688.png 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/eurusd-m15-NFP-1500x672.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/eurusd-m15-NFP-705x316.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/eurusd-m15-NFP-24x11.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/eurusd-m15-NFP-36x16.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/eurusd-m15-NFP-48x22.png 48w\" sizes=\"(max-width: 1631px) 100vw, 1631px\" \/><\/p>\n<p>Although the labour market data from Automatic Data Processing (ADP Employment change) is published before the NFP, it is data from private firms, and the NFP is the first official monthly government labour market statistic (Initial jobless claims are released weekly, with a one-week lag). Along with the NFP, investors will also see data on the unemployment rate, the labour force participation rate and average hourly earnings.<\/p>\n<p>Given the impact of employment on the country&#8217;s economic situation, the NFP is an important indicator in the central bank&#8217;s interest rate decisions. When the NFP figure is worse than expected, and on a downward trend, the central bank usually tends to consider easing monetary policy and cutting rates. The aim is to boost economic activity and increase employment. Thus, a worse than expected figure is harmful to the USD and a better than expected figure is positive for the USD.<\/p>\n<p>However, there can also be a situation like in 2022 where the central bank tightens monetary policy despite worse labour market data because the main objective is to contain rapidly rising inflation. Economists are thus concerned that fighting inflation will dampen economic activity and possibly steer the economy towards recession. Moreover, the situation in 2022 is further complicated by political uncertainty in Ukraine, making it more difficult for investors to predict what will happen in the markets.<\/p>\n<h2>Caution is appropriate<\/h2>\n<p>The NFP data mainly affects pairs with the US dollar, so all traders who trade pairs in the majors&#8217; group (EURUSD, USDJPY, GBPUSD, AUDUSD, USDCHF, USDCAD and NZDUSD) should pay attention to it. However, it is not uncommon for NFP data to affect pairs where the USD is not present, so all forex traders need to be careful.<\/p>\n<p>Given the aforementioned significant volatility that occurs in the markets, it is not recommended to enter the market shortly before the NFP data is released. However, if traders already have open positions at the time of the NFP, it is a good idea to either close them before the release or adjust the SL in such a way as to avoid unnecessary losses.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Forex traders are primarily looking for signals to enter the market based on technical analysis and chart studying. A lot of traders do not follow fundamentals at all, and many try to avoid them. However, the important news in the economic calendar should not be completely overlooked by any serious trader. Regular monitoring of the [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":525763,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/525661"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=525661"}],"version-history":[{"count":14,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/525661\/revisions"}],"predecessor-version":[{"id":592809,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/525661\/revisions\/592809"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/525763"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=525661"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=525661"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=525661"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}