{"id":526108,"date":"2022-05-13T13:50:09","date_gmt":"2022-05-13T11:50:09","guid":{"rendered":"https:\/\/ftmo.com\/?p=526108"},"modified":"2022-08-29T19:26:52","modified_gmt":"2022-08-29T17:26:52","slug":"technical-analysis-history-of-candlestick-charts","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/technical-analysis-history-of-candlestick-charts\/","title":{"rendered":"Technical analysis &#8211; history of candlestick charts"},"content":{"rendered":"<p><em>Candlestick charts are now commonplace for most traders. However, many may not even know that the history of candles dates back to the 18th century when a rice trader on the Osaka Stock Exchange in Japan figured out how to use candle charts to predict price movements in this commodity.<\/em><\/p>\n<p>Today, candle charts are one of the most widely used ways to display the price of certain asset. However, until relatively recently, candle charts were not as widespread in technical analysis as they are today. For example, it was not until the early 1990s, when Steve Nison published the books &#8220;Japanese Candlestick Charting Techniques&#8221; and &#8220;Beyond Candlesticks&#8221; in which he introduced and described the concept of candles and candlestick patterns, that candlestick charts became more prominent in &#8220;Western markets&#8221;.<\/p>\n<p>Until then, primarily bar charts were used in technical analysis. These provided traders with information regarding OHLC (open, high, low, close) and were therefore quite popular. However, unlike bar charts, candles allow the creation of various formations (patterns), which traders can use to predict future price movements of investment instruments. This ability to predict price movements made the Japanese rice trader famous in the 18th century and hence, he is known today as the creator of candlestick charts.<\/p>\n<p>His name is Munehisa Homma, but he is also known as Sokyu Honma (this is due to the complexity of translating from Japanese to English, as the same Japanese characters can be translated as Munehisa or Sokyu, just as a surname can be translated as Homma or Honma). He was a rice trader who worked at the Dojima Rice Exchange in Osaka. Rice was the most valuable and essential commodity in Japan at that time, and the Osaka exchange was the centre of trade for this commodity. It was founded in 1697, and in 1710, it began to issue &#8216;rice coupons&#8217;, which today can be considered the first futures contracts to be actively traded.<\/p>\n<p>In the second half of the 18th century, Munehisa Homma, who came from a very wealthy family of rice traders, also started trading on this exchange. Thanks to that, Homma had an excellent knowledge of the trade in this commodity going back several decades. Based on years of rice price movements and thorough analysis, Homma began to study the psychological side of trading and investors&#8217; behaviour in the market. In addition to a wealth of information on prices and market events, including the study of weather and seasonal influences, Homma also developed his own information system. At designated times, he placed several people on the roofs of buildings at certain intervals, sending signals using flags. There were so many that they covered the entire distance between the cities of Osaka and Sakata, which was a major distribution centre in the rice trade.<\/p>\n<p>Based on his studies, Homma developed a strategy that included a set of rules and actions based on different market scenarios. While the original method did not include candles, Homma later created candle charts using his patterning. The candles allowed Homma to understand what was happening in the market because the candle&#8217;s body, representing the &#8220;essence of price movements&#8221;, its colour and size gave the trader a clear idea of whether sellers or buyers dominated the market.<\/p>\n<p>Homma called his technique &#8220;Sakata Five&#8221; after the name of the city he came from and the five basic price patterns he used to predict price movements. These patterns were based on the idea that market events constantly repeat themselves in specific patterns, which can then be used in predicting price movements.<\/p>\n<p>Because of his approach, he became one of the first famous traders and made up to $10 billion in today&#8217;s money. It is even claimed that he was able to make 100 profitable trades in a row. His achievements later earned him a promotion to the rank of honorary samurai, and he became a financial advisor for the Japanese government.<\/p>\n<p>His approach was secret at first, but in 1755, he published &#8220;The Fountain of Gold &#8211; The Three Monkeys&#8217; Record of Money&#8221;, which is now considered the first book on trading psychology. Homma had by then already understood the importance of the psychological aspects of trading, which was then reflected in price movements. His insights and knowledge became the basis of Japanese investing philosophy. He referred to the bull market as the Yin and the bear market as the Yang and described their interaction and rotation in detail. His adage that &#8220;when everyone is bearish, there is a reason for prices to rise&#8221; still holds true.<\/p>\n<p>Many legends and myths have developed around the person and trading of Munehisa Homma over the years. However, his fundamental legacy in the form of candlestick charts and patterns and his approach to the psychological side of trading still help traders around the world today.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Candlestick charts are now commonplace for most traders. However, many may not even know that the history of candles dates back to the 18th century when a rice trader on the Osaka Stock Exchange in Japan figured out how to use candle charts to predict price movements in this commodity. Today, candle charts are one [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":526242,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[162],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/526108"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=526108"}],"version-history":[{"count":13,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/526108\/revisions"}],"predecessor-version":[{"id":533481,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/526108\/revisions\/533481"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/526242"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=526108"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=526108"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=526108"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}