{"id":526759,"date":"2022-05-20T06:53:20","date_gmt":"2022-05-20T04:53:20","guid":{"rendered":"https:\/\/ftmo.com\/?p=526759"},"modified":"2022-05-20T15:14:08","modified_gmt":"2022-05-20T13:14:08","slug":"economic-calendar-inflation-can-be-tricky","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/economic-calendar-inflation-can-be-tricky\/","title":{"rendered":"Economic calendar &#8211; inflation can be tricky"},"content":{"rendered":"<p><em>In the second part of our series on important dates in the economic calendar and their impact on forex trading, we will be talking about inflation. Inflation is a hot topic today, and traders should know what to watch out for when a country announces its inflation data.<\/em><\/p>\n<p>By inflation, we mean a rise in the price level and a decrease in the purchasing power (or real value) of a given currency which consumers use to buy goods and services. The term consumer price index (CPI), the increase in which is a measure of inflation, is usually used in connection with inflation. The annual inflation rate in a given month is thus expressed as the increase in the CPI over the same month of the previous year.<\/p>\n<p>The CPI is calculated as the average of the price changes of individual items in the consumer basket. The composition of the consumer basket is predetermined and individual items have different weights, which may change at certain intervals. Food, alcohol, housing, energy, etc. are represented. Each country also has different weights for the different categories that make up the consumption basket, from which inflation is calculated.<\/p>\n<p>Inflation or CPI is a very important economic indicator because the purchasing power and price growth of goods and services can tell traders and investors a lot about how a country&#8217;s monetary policy will evolve. Higher inflation, which many economies are also facing in mid-2022, is leading central banks to raise interest rates. On one hand, this has an impact on economic activity, which is dampened at higher interest rates (more expensive credit, less money available for companies), but on the other hand, higher rates make the currency more attractive to investors who buy it. Higher inflation and the subsequent rise in interest rates then lead to a strengthening of the currency.<\/p>\n<p><iframe loading=\"lazy\" src=\"https:\/\/d3fy651gv2fhd3.cloudfront.net\/embed\/?s=ukrpcjyr&amp;v=202205180644V20220312&amp;d1=19970526&amp;h=300&amp;w=600\" width=\"600\" height=\"300\" frameborder=\"0\" scrolling=\"no\"><\/iframe><br \/>\nsource: <a href=\"https:\/\/tradingeconomics.com\/united-kingdom\/inflation-cpi\">tradingeconomics.com<\/a><\/p>\n<p>However, high inflation does not always lead to higher rates. For example, if too much of inflation occurs in an economy with unhealthy growth, a recession may follow, which is unlikely to lead to a rapid rise in interest rates. Thus, high inflation and its growth may not always mean a chance for currency appreciation, which traders should consider.<\/p>\n<p>Most countries publish information  on inflation on a monthly basis. The exceptions are Australia and New Zealand, where inflation data is published quarterly, and then Europe, where the ECB announces Eurozone inflation data twice a month, at the end of the month as a preliminary figure, and then final data in the second half of the month.<\/p>\n<p>In addition to the CPI, the Core CPI, which is just a regular CPI adjusted for the most volatile items in the consumer basket, such as food and energy, is also often announced. Another indicator of inflation is producer price inflation, or PPI, which measures the change in the prices of goods and services sold on the wholesale market.<\/p>\n<p>In the US, the PCE (personal consumption expenditures) index, which measures households&#8217; implicit spending defined over a certain period, is also closely monitored. Unlike the CPI, which is based on a fixed consumption basket that can remain unchanged for several years, the PCE index uses a formula that allows for changes in consumer behaviour and changes that take place over a short period. The PCE takes into account a much wider range of goods and services and is generaly less volatile. Since 2012, the PCE index has been the leading indicator of inflation on which the US Federal Reserve bases its decisions.<\/p>\n<p>Traders should take care when inflation data is announced and should not enter into trades before the inflation data is reported. Currency markets may experience increased volatility and spread widening just after the announcement, which can negatively affect trading accounts. This happens especially at times when the published data is very different from analysts&#8217; expectations.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the second part of our series on important dates in the economic calendar and their impact on forex trading, we will be talking about inflation. Inflation is a hot topic today, and traders should know what to watch out for when a country announces its inflation data. By inflation, we mean a rise in [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":526853,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/526759"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=526759"}],"version-history":[{"count":8,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/526759\/revisions"}],"predecessor-version":[{"id":611475,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/526759\/revisions\/611475"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/526853"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=526759"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=526759"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=526759"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}