{"id":526954,"date":"2022-05-25T09:43:29","date_gmt":"2022-05-25T07:43:29","guid":{"rendered":"https:\/\/ftmo.com\/?p=526954"},"modified":"2022-05-25T13:54:35","modified_gmt":"2022-05-25T11:54:35","slug":"the-hardest-obstacle-was-me","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/the-hardest-obstacle-was-me\/","title":{"rendered":"“The hardest obstacle was me”"},"content":{"rendered":"<p><i>Do you have a strategy that seems to work well for others, risk management and money management rules in place, but in the end, you still can&#8217;t achieve consistent results? The problem might be you and your mindset and until you realize this, you will not move forward. And the FTMO Traders who shared their trading experiences with us this time know it too.<\/i><\/p>\n<h3>Trader Sean: Putting my emotions aside and regaining focus was the most difficult thing for me to do.<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-526958 size-medium\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Sean-284x300.jpeg\" alt=\"\" width=\"284\" height=\"300\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Sean-284x300.jpeg 284w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Sean-24x24.jpeg 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Sean-34x36.jpeg 34w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Sean-45x48.jpeg 45w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Sean.jpeg 511w\" sizes=\"(max-width: 284px) 100vw, 284px\" \/><\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p>The hardest obstacle on my trading journey to date has been changing my mindset to think in probabilities and to not become emotionally attached to trades on an individual basis.<\/p>\n<p><strong>What was the most difficult during your FTMO Challenge or Verification and how did you overcome it?<\/strong><\/p>\n<p>I passed my FTMO on the 5th attempt, so there was a lot of learning for me to understand what it took to pass the challenge. I became aware of my weaknesses throughout each challenge I took and each time I became closer and closer to passing. I found that the last 5% is harder to achieve then the first 5% as emotions grew the closer I got to achieving what was\/is for me a dream. Putting my emotions aside and regaining focus was the most difficult thing for me to do. I overcame this by trial and error and most importantly journaling my mistakes and learning from them.<\/p>\n<p><strong>Where have you learnt about FTMO?<\/strong><\/p>\n<p>FTMO is the premier league of trading. If you are trading, you know of FTMO. I believe I first heard of it through a friend.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-526987\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Sean-trades.png\" alt=\"\" width=\"910\" height=\"1221\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Sean-trades.png 910w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Sean-trades-224x300.png 224w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Sean-trades-768x1030.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Sean-trades-525x705.png 525w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Sean-trades-18x24.png 18w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Sean-trades-27x36.png 27w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Sean-trades-36x48.png 36w\" sizes=\"(max-width: 910px) 100vw, 910px\" \/><\/p>\n<p><strong>What was easier than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p>I believe that there is nothing easy about FTMO&#8217;s challenge of verification. But I would say that once you pass the challenge it gives you the confidence in yourself that &#8220;wow&#8221; you actually can do it. Having this belief going into the verification process for me made it slightly easier.<\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>Yeah. Of course. It is key to all trading success.<\/p>\n<p><strong>What would you like to say to other traders that are attempting their FTMO Challenge?<\/strong><\/p>\n<p>Keep going! Please keep going! Personally 2 years ago I dropped out of my engineering degree to pursue a career in trading. Personally, none of my family or friends knew anything about trading and they all thought I was crazy and to be honest they did not believe it was legit. Respect yourself enough to believe in your ability and keep pushing because you will have a breakthrough. Focus on yourself and not the progress of others because this will only hinder your own success. And remember that it&#8217;s your life. Stop letting other people’s opinions stop you from living the life you want! Go get it.<\/p>\n<h3>Trader Shelby: Trading for me, is a vehicle to help me achieve what God is calling for me to do.<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-526965 size-medium\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-300x200.jpg\" alt=\"\" width=\"300\" height=\"200\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-300x200.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-1030x686.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-768x512.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-1536x1024.jpg 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-1500x1000.jpg 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-705x470.jpg 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-24x16.jpg 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-36x24.jpg 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-48x32.jpg 48w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby.jpg 2048w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/p>\n<p><strong>How did loss limits affect your trading style?<\/strong><\/p>\n<p>Having a maximum loss made me tighten up my trading more. I risked a bit less (about 0.25-0.50% per trade). If I lost two trades, I stopped for the day and knew it was best to see how tomorrow goes &#8211; while taking the time to study more mindset work. Besides the change in risk amount, nothing changed about my trading. I love to scalp in the mornings US30.<\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>Freedom. Self-Mastery. Purpose. The more time passes, the more I am becoming aware of how important my energy is, who I spend my time with, my thoughts, my beliefs &amp; the words I speak are for creating my reality. These markets are simply a current of energy and human emotion. When you show up to them in alignment &amp; in confidence that is what you will get back. If you show up in fear or doubt- you lose. It&#8217;s fascinating to witness myself grow stronger physically, mentally, emotionally, spiritually &amp; financially along this path. This whole journey of trading to me has been about who I am becoming as a soul more so than any amount of money I can make. The money I do make is being attracted for me to live my life&#8217;s purpose and create my dream of having healing centers around the world. Trading for me, is a vehicle to help me achieve what God is calling for me to do.<\/p>\n<p><strong>What was the most difficult during your FTMO Challenge or Verification and how did you overcome it?<\/strong><\/p>\n<p>The most difficult thing I faced during this journey was my own mind &amp; the expectations put on me from loved ones that I am meant to be at a certain place financially in my life or in my career. One resource that I feel really helped me overcome the weight others and myself were putting on me was reading the book by Neville Goddard <em>The Power Of Awareness<\/em>. I read it over and over again while going through the challenge &amp; by using the power of assumption every night before going to sleep. I used my imagination to visualize me passing the challenge and verification in detail. I also had an FTMO Statement I read to myself before I took a trade in the mornings.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-526994\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-trades.png\" alt=\"\" width=\"911\" height=\"1218\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-trades.png 911w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-trades-224x300.png 224w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-trades-770x1030.png 770w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-trades-768x1027.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-trades-527x705.png 527w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-trades-18x24.png 18w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-trades-27x36.png 27w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Shelby-trades-36x48.png 36w\" sizes=\"(max-width: 911px) 100vw, 911px\" \/><\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p>I began trading leverage in October 2020. I must have blown at least 10 demos and 3 real accounts until I had had enough of the self-punishment. I was quite literally self-sabotaging even though I had mentors helping me and telling me what to do to be profitable. I was stubborn at first and tried to do it my way- I was humbled quickly. I began to submit to the mentorship and began focusing on falling in love with the set up rather than trying to quickly make money &#8211; that&#8217;s when I stopped blowing accounts and started seeing more consistent growth on my demo account. The hardest obstacle was me.<\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>Completely. Trading is a mental game. The days I am not feeling well or mentally feeling off I don&#8217;t trade because in the past I used to make bad decisions or rush which resulted in my losing money. I now have a set of rules I stick to as a trader that I don&#8217;t like to deviate from. I risk a certain amount, I know where I am stopping if I lose and where I will stop if I win, I calculate out my risk before I trade, if my trade is in profit a good amount there is no need for me to now lose that trade- I move my SL into profit.<\/p>\n<p><strong>What would you like to say to other traders that are attempting their FTMO Challenge?<\/strong><\/p>\n<p>Take time to do your research, watch the previous successful traders interviews, don&#8217;t just rush into the challenge, only risk what you are okay losing when you are considering what amount you want to start with, practice with the account size you intend to start with, prove to yourself that you can consistently trade before embarking on the journey of the real challenge. Trade without fear. Realize how you do one thing is how you do everything so ask yourself where in my life am I not showing up patient &amp; disciplined like how I want to be in trading? Know that your success is inevitable if you take the time each day to visualize it and become the version of you who is an FTMO funded trader in the present moment.<\/p>\n<h3>Trader Harry: If a setup doesn&#8217;t completely meet the plan you have do not take it.<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-526972 size-medium\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-225x300.jpg\" alt=\"\" width=\"225\" height=\"300\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-225x300.jpg 225w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-773x1030.jpg 773w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-768x1024.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-529x705.jpg 529w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-18x24.jpg 18w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-27x36.jpg 27w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-36x48.jpg 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry.jpg 960w\" sizes=\"(max-width: 225px) 100vw, 225px\" \/><\/p>\n<p><strong>Describe your best trade.<\/strong><\/p>\n<p>My best trade I have had so far is a trade I recently took on the 10th May on EURCAD which was pulling back on the 4 hour chart into a previous area of resistance and I was able to catch a 4\/1 risk to reward<\/p>\n<p><strong>What was easier than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p>I found the verification easier than expected due to having more time to trade and I also had a lower target to meet (5%) therefore I felt less stressful and was able to deal with emotions better than I was during the challenge phase.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>I have a trading plan and in the plan I use a technical analysis tool called the A1 edge finder which allows me to use different types of data such a seasonality, institutional data\/COT data, and market projections which allows me to find the best pairs to currently trade, whether it be a strong sell bias or strong buy bias. This tool allows me to find pairs with a strong trend reading which I can then use to find set ups during the day.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-527001\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-traddes.png\" alt=\"\" width=\"911\" height=\"1204\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-traddes.png 911w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-traddes-227x300.png 227w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-traddes-779x1030.png 779w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-traddes-768x1015.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-traddes-533x705.png 533w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-traddes-18x24.png 18w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-traddes-27x36.png 27w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Harry-traddes-36x48.png 36w\" sizes=\"(max-width: 911px) 100vw, 911px\" \/><\/p>\n<p><strong>What was more difficult than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p>The FTMO challenge was a difficult task due to the time however the time extension allowed me to complete the challenge in the end. I also during the challenge phase went into some bad drawdown due to not sticking to my plan but after a few weeks I was able to start to find some momentum by following my plan and trying my best to remove my emotions from my trades. This allowed me to pass and I took this into the verification phase which helped me to pass as well as I was able to learn from my previous mistakes I made at the beginning of the FTMO challenge.<\/p>\n<p><strong>How did you manage your emotions when you were in a losing trade?<\/strong><\/p>\n<p>I found it difficult at the beginning but when I started to stick to my plan, and I was losing a trade I accepted the trade was most likely going to be a losing trade and I knew there would be more opportunities in the coming days. Therefore, I was able to manage any emotions during my trades as I was confident in my trading plan<\/p>\n<p><strong>One piece of advice for people starting their FTMO Challenge now.<\/strong><\/p>\n<p>My biggest advice would be sticking to a plan and if a setup doesn&#8217;t completely meet the plan you have do not take it. There will be plenty more setups during the challenge and verification. I would also say never cut winners early. On a few occasions I did this due to my emotions and I ended up missing out on 0.5% and 1% on some occasions. If this is continued for a long period, you can miss out on a lot of profit<\/p>\n<h3>Trader Barbara: I believe that trading is the final test of one&#8217;s character and determination.<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-526979 size-medium\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-225x300.jpg\" alt=\"\" width=\"225\" height=\"300\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-225x300.jpg 225w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-773x1030.jpg 773w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-768x1024.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-1152x1536.jpg 1152w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-1536x2048.jpg 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-1125x1500.jpg 1125w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-529x705.jpg 529w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-18x24.jpg 18w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-27x36.jpg 27w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-36x48.jpg 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-scaled.jpg 1920w\" sizes=\"(max-width: 225px) 100vw, 225px\" \/><\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>I believe that trading is the final test of one&#8217;s character and determination and requires more than just technical knowledge. I personally had hard time with major mindset issues. I eventually managed to sort them out using various NLP techniques. Therefore, I consider trading as a great incentive for self-development. This benefits other areas of life, apart from better results in trading. Ultimately, I love this game of probabilities and the freedom it gives.<\/p>\n<p><strong>What does your risk management plan look like?<\/strong><\/p>\n<p>I am a short-term swing trader. My idea is to strive to catch impulsive moves which follow well established periods of compression. I always risk 0.5 per cent of my equity per position and double when my analysis proves correct and when it is safe to lower the stop loss to remain within the 0.5 per cent limit progressing to risk free. I trail my stop safely to the end of the impulsive move. I stay within the FTMO limits for daily and overall loss allowed. I close positions by 23:00.<\/p>\n<p><strong>How did loss limits affect your trading style?<\/strong><\/p>\n<p>Obviously, we all have better and worse days which shows up in our results. The Maximum Loss is great because it instills self-discipline and protects against bad trading at times when one should stay away from the markets. I personally gained a lot by using this structured and clean approach.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-527008\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-trades.png\" alt=\"\" width=\"913\" height=\"1222\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-trades.png 913w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-trades-224x300.png 224w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-trades-770x1030.png 770w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-trades-768x1028.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-trades-527x705.png 527w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-trades-18x24.png 18w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-trades-27x36.png 27w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/05\/Barbara-trades-36x48.png 36w\" sizes=\"(max-width: 913px) 100vw, 913px\" \/><\/p>\n<p><strong>Do you plan to take another FTMO Challenge to manage even bigger capital?<\/strong><\/p>\n<p>I will certainly try to move up the scale and taking another FTMO Challenge is a great way to do it.<\/p>\n<p><strong>What was more difficult than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p>I think it depends on your personality type. I found the Challenge stage more intense and so I enjoyed it immensely. The Verification is obviously easier to complete because it has relaxed rules &#8211; 60 days to do so and half the profit required. At the same time, I found that less focus and concentrated effort in my individual case resulted in a less satisfactory equity curve. This proves to me that I thrive on adrenaline:)<\/p>\n<p><strong>One piece of advice for people starting their FTMO Challenge now.<\/strong><\/p>\n<p>Even if this is your yet another FTMO Challenge &#8211; go for it! Even if this time round you will not succeed, this will be yet another opportunity to learn and develop. Carry on until you pass and think of your failures as chances to find out what you do wrong and what you need to do to improve your trading. Your winning attitude will take you to the end and you will fulfill your dream of trading for FTMO &#8211; the best fund there is for retail traders. Good luck!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Do you have a strategy that seems to work well for others, risk management and money management rules in place, but in the end, you still can&#8217;t achieve consistent results? The problem might be you and your mindset and until you realize this, you will not move forward. And the FTMO Traders who shared their [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":527040,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[672],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/526954"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=526954"}],"version-history":[{"count":6,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/526954\/revisions"}],"predecessor-version":[{"id":527833,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/526954\/revisions\/527833"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/527040"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=526954"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=526954"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=526954"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}