{"id":527142,"date":"2022-05-26T15:39:07","date_gmt":"2022-05-26T13:39:07","guid":{"rendered":"https:\/\/ftmo.com\/?p=527142"},"modified":"2022-05-27T14:22:25","modified_gmt":"2022-05-27T12:22:25","slug":"technical-analysis-who-is-the-father-of-modern-technical-analysis","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/technical-analysis-who-is-the-father-of-modern-technical-analysis\/","title":{"rendered":"Technical analysis &#8211; who is the father of modern technical analysis?"},"content":{"rendered":"<p><em>Technical analysis is one of the oldest and most controversial methods of analyzing and predicting market trends, but it is an indispensable tool in making trading decisions for most forex traders. In today&#8217;s article, we&#8217;ll cover its basics and modern history.<\/em><\/p>\n<p>Technical analysis can be simply described in a few points:<\/p>\n<p>&#8211; all information (fundamental, psychological, economic, political) is included in the price. Studying financial statements and looking for intrinsic value is therefore unnecessary,<\/p>\n<p>&#8211; due to the emotional behaviour of investors, who behave similarly and herd-like in certain situations, history repeats itself in the markets. Traders can thus find patterns and formations in charts that help them in determining future price movements,<\/p>\n<p>&#8211; prices move in trends that are characterized by momentum. When a trend forms in the market, it tends to continue for some time,<\/p>\n<p>&#8211; technical analysis shows traders &#8220;what&#8221; the price is, not &#8220;why&#8221; it is where it is. The relationship between supply and demand creates price and its change.<\/p>\n<p>Technical analysis is most often used by short-term forex traders today, but it can be used when trading any investment instrument. It is also often used by fundamental investors who want to gain a different perspective on the market or simply to time their investment better.<\/p>\n<h2>History of technical analysis<\/h2>\n<p>In the last article of our series, we wrote about the history of candlestick charts, which were &#8220;discovered&#8221; by the Japanese rice trader Munehisa Homma in the 18th century and today are the basis of technical analysis. However, we can consider the emergence of the so-called Dow Theory as the beginning of modern technical analysis. It is based on a series of articles by Charles H. Dow, published in The Wall Street Journal between 1900 and 1902. After his death, Dow&#8217;s ideas were further developed by William Hamilton, and in 1922, Robert Rhea published them as an unified set, or theory, in a book entitled The Dow Theory.<\/p>\n<h2>Dow Theory<\/h2>\n<p>The Dow started with the stock market, which he considered a barometer of the entire economy. Stocks, in his view, tended to move very similarly, so he put together several stock titles representing the whole market and averaged them. This resulted in two indices, the Dow Jones Rail Average (later renamed the Dow Jones Transportation Average), representing the railroad or transportation sector, and the Dow Jones Industrial Average, representing the industry. These indices covered the two main economic segments and faithfully characterized developments in the economy as a whole. Dow&#8217;s theory is based on six basic principles that anyone who wants to use technical analysis should learn.<\/p>\n<h3>The market takes all information into account<\/h3>\n<p>All past, present, and future information is already factored into the asset&#8217;s price. This information considers all the fundamental and psychological factors affecting supply and demand, including the emotions and knowledge of all market participants, as well as data on inflation, interest rates or news about expected company results.<\/p>\n<h3>The market has three trends<\/h3>\n<p>The basis of Dow Theory and today&#8217;s technical analysis is the search for and analysis of trends. While markets do move in trends, they do not do so in a straightforward manner but through several shorter stretches that have local highs and lows. In an uptrend, each local high will be at a higher level than the previous local high, and each local low will be at a higher level than the last local low. In a downward trend, the local maximums and minimums will be followed by further local minimums and maximums at a lower level. Dow then defined three types of trends: a primary trend, a secondary trend, and a minor trend.<\/p>\n<p><strong>The primary trend<\/strong> is the leading and most important market trend that influences the market and affects secondary and minor trends. A primary trend can last from one year to several years and, regardless of length, is valid unless a reversal is confirmed.<\/p>\n<p><strong>A secondary trend<\/strong> goes in the opposite direction to the primary trend and acts as a correction. The secondary trend is downward in a rising primary trend and vice versa. The usual duration of a secondary trend is from three weeks to three months, and the pullback created by it usually has a range of one to two-thirds of the primary trend.<\/p>\n<p><strong>A minor trend<\/strong> is a correction of a secondary trend and is a movement that usually lasts less than three weeks.<\/p>\n<h3>The primary trend has three phases<\/h3>\n<p>The primary trend was most important to Dow, with each primary trend going through three phases: accumulation, public and distribution.<\/p>\n<p>The accumulation phase occurs at the end of the preceding trend when only well-informed investors enter the trades. Most of the news is already reflected in prices, limiting the possibility of the trend continuing.<\/p>\n<p>In the public phase, an increasing proportion of investors, including technical investors, betting on confirmation of the trend, begin to engage in exits.<\/p>\n<p>In the distribution phase, the investing public appears in the market and buys, especially those who can be lured into a nice-looking strong trend. Investing at the highs or lows is almost a certainty of profit for most of these investors as the first group of investors who invested during the accumulation phase begin to withdraw from the market.<\/p>\n<h3>Market indices must confirm each other<\/h3>\n<p>According to Dow, the trend had to be signaled by the DJIA and DJTA indices, which served as indicators of economic developments. If the industry is doing well, so must transportation, which provides imports of raw materials and exports of finished goods. Even today, traders often look for confluences of multiple factors before entering the market.<\/p>\n<h3>The trend should be confirmed by the volume<\/h3>\n<p>According to Dow, volume, which was a secondary indicator, confirms the trend&#8217;s strength. Thus, in the direction of the trend, the volume of trades should increase, and against the direction of the trend, it should decrease.<\/p>\n<h3>The trend is valid until there is a clear signal of a reversal<\/h3>\n<p>As long as the trend is strong, there is a high probability of its continuation despite corrections and &#8220;noise&#8221; in the markets. Therefore, if possible, the aim is to avoid trading against the trend, which often leads to unnecessary losses.<\/p>\n<p>Although Charles H. Dow applied his ideas only to stocks and was not a technical trader in the modern sense of the word, his thoughts are still considered the basis of modern technical analysis. This is even though investing and the economy have undergone significant changes since his death.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Technical analysis is one of the oldest and most controversial methods of analyzing and predicting market trends, but it is an indispensable tool in making trading decisions for most forex traders. In today&#8217;s article, we&#8217;ll cover its basics and modern history. Technical analysis can be simply described in a few points: &#8211; all information (fundamental, [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":527255,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[162],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/527142"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=527142"}],"version-history":[{"count":9,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/527142\/revisions"}],"predecessor-version":[{"id":611133,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/527142\/revisions\/611133"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/527255"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=527142"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=527142"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=527142"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}