{"id":527548,"date":"2022-06-03T14:00:39","date_gmt":"2022-06-03T12:00:39","guid":{"rendered":"https:\/\/ftmo.com\/?p=527548"},"modified":"2022-06-03T13:58:20","modified_gmt":"2022-06-03T11:58:20","slug":"want-to-trade-exotic-currency-try-the-mexican-peso","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/want-to-trade-exotic-currency-try-the-mexican-peso\/","title":{"rendered":"Want to trade exotic currency? Try the Mexican peso"},"content":{"rendered":"<p><em>Do you trade exclusively just the most liquid currency pairs and CFDs, or do you sometimes take the opportunity to trade even exotic instruments? Exotic currency pairs can be an attractive instrument for many investors. The Mexican peso, for example, is one of them.<\/em><\/p>\n<p>Exotic currency pairs and some lesser-known investment instruments may not be as popular among FTMO traders as gold or the EURUSD and GBPUSD pairs, but that doesn&#8217;t mean they must be unattractive to investors.<\/p>\n<h2>Higher volatility, lower liquidity<\/h2>\n<p>Most traders avoid them because higher volatility associated with lower trading volume, and relatively large spreads are typical with these instruments. Thus, most of these pairs are unsuitable for scalpers and intraday traders who open multiple positions daily.<\/p>\n<p>Some pairs involving currencies of emerging countries or countries with unstable political environments may experience unpredictable fluctuations leading to unexpected losses. This is also why most of these currencies are more susceptible to changes in investor sentiment and do not fare well in a risk-off environment. As a result, investors during this period typically sell emerging market currencies and invest in currencies that are considered safe havens. In addition, EM currencies are more susceptible to news of natural disasters, international trade agreements and standard fundamentals such as GDP, interest rates, CPI, etc.<\/p>\n<h2>What is an exotic currency pair<\/h2>\n<p>An exotic currency pair can be considered practically any pair that includes a lesser-known currency in combination with one of the currencies that belong to the major pairs (usually USD, EUR, possibly JPY or GBP). There are many exotic pairs, and we also offer the most attractive ones to our clients within FTMO applications.<\/p>\n<h2>Why trade the exotics?<\/h2>\n<p>The main advantage and reason traders choose exotic pairs for their trades may be the low correlation with other pairs and other investment instruments (commodities, stocks, indices). However, for more experienced investors, the volatility mentioned above can also be an advantage, offering the possibility of higher appreciation in a shorter period.<\/p>\n<p>In addition, large intraday movements of a currency pair limit the disadvantage of a higher spread. When the spread is calculated as a percentage of the daily movement, even a relatively large spread may not be a disadvantage. All a trader needs to do is to adjust the size of his SL to the daily volatility. Traders who hold their positions for multiple days can <a href=\"https:\/\/ftmo.com\/en\/what-is-a-swap-and-for-whom-is-it-important\/\">use carry trades<\/a> on many of these pairs because most emerging countries have higher interest rates.<\/p>\n<h2>Mexican peso offers interesting opportunities<\/h2>\n<p>One of the exotic currency pairs traders will find on offer at FTMO is USDMXN, the US dollar against the Mexican peso. This is one of the most liquid exotic currencies, making it an ideal tool for traders who want to include a currency in their portfolio reflecting developments in emerging markets and countries south of the US.<\/p>\n<h2>Strong U.S. partner<\/h2>\n<p>One of the Mexican peso&#8217;s significant advantages over other exotic currencies is Mexico&#8217;s relatively close relationship with the US. The countries share a long common border, which gives Mexico a solid link to international trade through the US. The country has strong trade relations with the US, supported by trade agreements, which only increases the liquidity of this currency pair. On the other hand, problems in adhering to trade agreements or revising them, such as under President Donald Trump, can lead to increased volatility in the MXN.<\/p>\n<h2>Oil<\/h2>\n<p>Another advantage of the Mexican peso over other currencies is Mexico&#8217;s large oil reserves. The country is one of the largest producers of black gold, which again helps Mexico to assert itself in international trade. On the other hand, fluctuations in the price of oil, such as at the beginning of 2020, can lead to a significant depreciation in the value of the MXN, which investors and traders must take into account, as well as the fact that the country&#8217;s oil production has fallen by 50% since 2004.<\/p>\n<h2>Higher interest rates<\/h2>\n<p>The interest rate differential is one of the typical advantages of exotic currencies over the most well-known currencies, and the Mexican peso is no exception. The country has long kept interest rates much higher than in the US, and long-term traders, in particular, can profit from this difference. In stable economic and geopolitical times, traders can benefit from carry trades. Selling a low interest rate currency (USD) and buying a higher interest rate currency to profit from the interest rate differential can lead to the appreciation of exotic currencies.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-527540\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/mexico-usa-interest-rate.png\" alt=\"\" width=\"730\" height=\"340\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/mexico-usa-interest-rate.png 730w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/mexico-usa-interest-rate-300x140.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/mexico-usa-interest-rate-705x328.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/mexico-usa-interest-rate-24x11.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/mexico-usa-interest-rate-36x17.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/mexico-usa-interest-rate-48x22.png 48w\" sizes=\"(max-width: 730px) 100vw, 730px\" \/><\/p>\n<p><strong>Source:<\/strong> tradingeconomics.com<\/p>\n<p>Even high interest rates compared to the US may not always help a currency like the Mexican peso to appreciate against the US dollar. The last time this was very evident was during the spread of the Covid-19 disease when although the difference between US and Mexican rates was more than 5.5 percentage points, the flight of investors to the safe haven that was the US dollar and US Treasury bonds led to a significant depreciation of the MXN against the USD.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-527619\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/usdmxn-w1-ftmo-s-r.png\" alt=\"\" width=\"1576\" height=\"727\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/usdmxn-w1-ftmo-s-r.png 1576w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/usdmxn-w1-ftmo-s-r-300x138.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/usdmxn-w1-ftmo-s-r-1030x475.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/usdmxn-w1-ftmo-s-r-768x354.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/usdmxn-w1-ftmo-s-r-1536x709.png 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/usdmxn-w1-ftmo-s-r-1500x692.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/usdmxn-w1-ftmo-s-r-705x325.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/usdmxn-w1-ftmo-s-r-24x11.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/usdmxn-w1-ftmo-s-r-36x17.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/usdmxn-w1-ftmo-s-r-48x22.png 48w\" sizes=\"(max-width: 1576px) 100vw, 1576px\" \/><\/p>\n<p>Traders should keep an eye out for news releases when trading the Mexican peso, both in Mexico and the US, given the country&#8217;s close ties to its northern neighbour. The Mexican peso can react much more strongly to news than the US dollar, so increased caution is in order when news is commonly reported. In addition, trading hours in Mexico and the US are virtually identical, so when markets are closed in America, a significant spread widening must be accounted for, and traders may experience unpleasant slippages.<\/p>\n<p>The USDMXN currency pair can be an interesting alternative for traders looking for new appreciation opportunities in their portfolio with a lower correlation to the most liquid investment instruments. Sometimes it takes extra caution, but it is a great diversification tool for experienced traders looking for higher volatility.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Do you trade exclusively just the most liquid currency pairs and CFDs, or do you sometimes take the opportunity to trade even exotic instruments? Exotic currency pairs can be an attractive instrument for many investors. The Mexican peso, for example, is one of them. Exotic currency pairs and some lesser-known investment instruments may not be [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":527670,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[89041],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/527548"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=527548"}],"version-history":[{"count":12,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/527548\/revisions"}],"predecessor-version":[{"id":585068,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/527548\/revisions\/585068"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/527670"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=527548"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=527548"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=527548"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}