{"id":528159,"date":"2022-06-17T13:00:26","date_gmt":"2022-06-17T11:00:26","guid":{"rendered":"https:\/\/ftmo.com\/?p=528159"},"modified":"2022-07-15T10:49:46","modified_gmt":"2022-07-15T08:49:46","slug":"chat-with-charts-share-your-ideas","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/chat-with-charts-share-your-ideas\/","title":{"rendered":"Chat with charts &#8211; share your ideas"},"content":{"rendered":"<p><em>Want to share your trading ideas with other traders? Are you interested in other traders&#8217; ideas and thoughts? Do you feel your strategy is underperforming and need the inspiration to move in the right direction? Then try our new feature, <a href=\"https:\/\/community.ftmo.com\/\">Chat With Charts<\/a>.<\/em><\/p>\n<p>FTMO&#8217;s new feature is aimed at clients who want to interact with like-minded people, exchange their investing and trading experiences, or share their insights, thoughts, and trading ideas. This is not only in text form, but charts provided by TradingView with FTMO data feed are available directly in the discussion forum as well. This is another service that we use to help our clients to be able to achieve long-term positive results.<\/p>\n<h2>Individual sport? Yes and no<\/h2>\n<p>Many people see trading as a purely individual matter. A trader has to make his own decisions about his trades. The strategy is tailor-made for him because he has to devise and test it himself, and other people&#8217;s opinions and ideas can be distracting.<\/p>\n<h2>Our own experience<\/h2>\n<p>In reality, however, it often may be the other way around. One of our colleagues from FTMO, previously our client, had a similar approach to trading. He didn&#8217;t talk much about trading to anyone because most people thought of him as a gambler trying to make a profit on something that resembled roulette. As a result, he didn&#8217;t defend this approach himself and took it as a reality and a confirmation that trading is simply an individual thing.<\/p>\n<p>But when he started talking about trading with his colleagues in the office, he found that the feedback and insights could give him much more than he expected. It was also thanks to these regular meetings with colleagues who are also involved in trading that he finally managed to complete his first FTMO Challenge after a long time (before that, he usually met the conditions for a repeat but never managed to earn 10% in a month), Verification and today he manages his first FTMO Account.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-528277\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/Renko-Masters-1030x687.jpg\" alt=\"\" width=\"1030\" height=\"687\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/Renko-Masters-1030x687.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/Renko-Masters-300x200.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/Renko-Masters-768x512.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/Renko-Masters-1536x1024.jpg 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/Renko-Masters-2048x1365.jpg 2048w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/Renko-Masters-1500x1000.jpg 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/Renko-Masters-705x470.jpg 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/Renko-Masters-24x16.jpg 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/Renko-Masters-36x24.jpg 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/Renko-Masters-48x32.jpg 48w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<p>Debating with like-minded people can help a trader look at his trades from a different perspective. This is especially true for traders who have been trading for a relatively long time and reached a stage where they can no longer perceive their mistakes and shortcomings objectively and get into a vicious cycle of irregular short-term gains and regular losses from which they cannot break out on their own.<\/p>\n<h2>We prefer not to use social networks<\/h2>\n<p>Unfortunately, many such traders do not seek contact with someone who will give them objective feedback (often, it can be a pretty harsh criticism) but start looking for easy and especially quick solutions (the typical search for some Holy Grail). As a result, standard social networks are now teeming with investment recommendations, guaranteed guides and paid services that promise traders a quick and easy way to make them rich and provide for their entire families for generations to come.<\/p>\n<p>The current situation in the financial markets (mid-June 2022) clearly shows that investing or trading based on social media recommendations is not a good idea. Sometimes a recommendation can work and even help to make a profit in the short term, but in the long term, such a &#8216;strategy&#8217; rarely has any chance of success.<\/p>\n<p>Social networks are simply not the ideal place for traders to be inspired and seek advice on where to invest or how to trade. More than anywhere else, it is true that if two people do the same thing, it may not be the same. When someone shares their system on social media, which is (rather rarely) profitable in the long term, it doesn&#8217;t necessarily mean that whoever copies it will also immediately make a profit.<\/p>\n<p>Trading is an individual business in the sense that the trader has to find his own way and the way he wants to operate in the market. He has to try out what suits him and what he can trust the most, and only such a solution can bring long-term results. Feedback in the form of communication with other traders who have similar interests and are in the same boat can then be an exciting bonus that can push them to the next level and help them overcome many obstacles. FTMO&#8217;s <a href=\"https:\/\/community.ftmo.com\/\">Chat With Charts<\/a> is the tool that will provide our clients with this feedback.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Want to share your trading ideas with other traders? Are you interested in other traders&#8217; ideas and thoughts? Do you feel your strategy is underperforming and need the inspiration to move in the right direction? Then try our new feature, Chat With Charts. FTMO&#8217;s new feature is aimed at clients who want to interact with [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":528338,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[5184],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/528159"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=528159"}],"version-history":[{"count":12,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/528159\/revisions"}],"predecessor-version":[{"id":529793,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/528159\/revisions\/529793"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/528338"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=528159"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=528159"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=528159"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}