{"id":528491,"date":"2022-06-24T13:30:29","date_gmt":"2022-06-24T11:30:29","guid":{"rendered":"https:\/\/ftmo.com\/?p=528491"},"modified":"2022-06-23T21:43:48","modified_gmt":"2022-06-23T19:43:48","slug":"technical-analysis-do-you-use-indicators-when-trading","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/technical-analysis-do-you-use-indicators-when-trading\/","title":{"rendered":"Technical analysis &#8211; do you use indicators when trading?"},"content":{"rendered":"<p><em>Technical indicators are one of the cornerstones of technical analysis for many traders. Although many experienced traders claim that a &#8220;clean&#8221; chart and price action should be enough for a trader to trade successfully, many traders cannot imagine their trading and trading strategy without indicators.<\/em><\/p>\n<p>Indicators in technical analysis extend the capabilities of classic price charts, and some traders also use them to complement price action. However, one of the disadvantages of price action is the possibility of different interpretations of price patterns and the need to have some experience in reading charts. This is also why indicators are very common among beginners and less experienced traders.<\/p>\n<p>Indicators are essentially mathematical functions applied to the price of an asset or trading volume. There are many different indicators, but in reality, none can clearly predict the future development of the price. They are merely derivations of the price, which in most cases are lagged. However, a well-chosen and tested indicator consistent with the chosen strategy can be quite a powerful tool in the hands of an experienced trader, which can help to identify the trend better or to determine a more appropriate entry and exit price.<\/p>\n<p>Even in the case of indicators, too much of anything is bad for you. Some novice traders tend to overcrowd their chart with <a href=\"https:\/\/ftmo.com\/en\/the-power-of-simplicity\/\">many different indicators in their search for the perfect strategy<\/a>. Trying to find a solution that will only give profitable signals can lead to a cluttered chart that is virtually impossible to read and often offers contradictory information.<\/p>\n<h2>Classification of indicators<\/h2>\n<p>Indicators can be classified according to different criteria. Most simply, indicators can be divided into trend indicators and oscillators. Then some indicators can be classified into both groups, such as MACD (Moving Average Convergence\/Divergence) or ADX (Average Directional Index). And in addition, we have groups of indicators that are based on other aspects of the markets.<\/p>\n<h2>Trend indicators<\/h2>\n<p>This group of indicators is used to define the trend. It is the most popular group of indicators (because &#8220;trend is your friend&#8221;), and they are mostly easy to understand. Their main disadvantage is that they are lagged behind the price. They are usually plotted as curves directly on the price chart. The most famous trend indicators include Moving Averages, Bollinger Bands, Envelopes, Parabolic SAR (Stop And Reverse), Ichimoku Cloud, etc.<\/p>\n<h2>Oscillators<\/h2>\n<p>The second group is based on the general rule that market events repeat in cycles, pointing to oversold or overbought markets and trying to predict market events. Oscillators are plotted off the price chart in a separate window and can work very well in markets where there is no clear trend and are moving sideways. We can divide them into oscillators with a non-standardized oscillation band, whose value oscillates around a centre line, and oscillators with a standardized oscillation band, which move within a predefined band. These include Momentum, Stochastic Oscillator, William&#8217;s Percent Range, RSI (Relative Strength Index), CCI (Commodity Channel Index), etc.<\/p>\n<h2>Volume, Sentiment, Market Breadth<\/h2>\n<p>In addition to trend indicators and oscillators, traders have several other tools at their disposal that do not follow the trend and do not try to predict it, and their basis for calculation may not be the asset&#8217;s price.<\/p>\n<p>Volume indicators are based on trading volume as an essential indicator of trader activity. Some of the best known are Volume Rate of Change, Money Flow Index, Volume Accumulation\/Distribution, etc.<\/p>\n<p>Sentiment indicators track market sentiment and are based on the fact that investors often behave herd-like and are subject to psychological pressures. Some of the best known are Put\/Call Ratio, Bull\/Bear Ratio, Odd-Lot Indicators, Short Sales Indicators, and Barron&#8217;s Confidence Index.<\/p>\n<p>Market breadth indicators help analyze stock markets as a whole. They track the performance of individual titles relative to the whole and are not suitable for other instruments or individual titles. These include New Highs\/New Lows, Absolute Breadth Index, Advance\/Decline Line, TRIN, and McClellan Oscillator.<\/p>\n<p>Technical indicators can be a good servant in the hands of an experienced trader but a bad master for traders looking for the holy grail. In the next episodes of our new series, we will describe the most famous and interesting ones, which you could use in your trading if you are interested.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Technical indicators are one of the cornerstones of technical analysis for many traders. Although many experienced traders claim that a &#8220;clean&#8221; chart and price action should be enough for a trader to trade successfully, many traders cannot imagine their trading and trading strategy without indicators. Indicators in technical analysis extend the capabilities of classic price [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":528613,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[162],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/528491"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=528491"}],"version-history":[{"count":11,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/528491\/revisions"}],"predecessor-version":[{"id":592843,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/528491\/revisions\/592843"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/528613"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=528491"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=528491"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=528491"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}