{"id":528923,"date":"2022-07-01T14:00:06","date_gmt":"2022-07-01T12:00:06","guid":{"rendered":"https:\/\/ftmo.com\/?p=528923"},"modified":"2023-11-08T12:32:28","modified_gmt":"2023-11-08T11:32:28","slug":"what-role-does-luck-play-in-trading","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/what-role-does-luck-play-in-trading\/","title":{"rendered":"What role does luck play in trading?"},"content":{"rendered":"<p><em><span style=\"font-weight: 400;\">You can not rely on luck in trading. We have posted several blog articles about this topic in the past. It may be controversial to say that luck is important in trading, however, the special role luck plays in trading needs to be acknowledged.<\/span><\/em><\/p>\n<p><span style=\"font-weight: 400;\">This is not to question the ability of successful investors to make large long-term profits through detailed market analysis and research. However, we should acknowledge the fact that luck often plays a significant role in investment success. Famous investor Howard Marks wrote in his book <b><i>”The Most Important Thing: Uncommon Sense for the Thoughtful Investor” <\/i><\/b>that “<i>the world of investing is not an orderly and logical place where the future can be predicted and where specific actions always produce specific results. The truth is that in investing, luck largely rules. Some may prefer to call it chance or randomness, and these words sound more sophisticated than luck. But the point is the same: a large part of the success of everything we do as investors is largely determined by the roll of the dice.”<\/i><\/span><\/p>\n<p><span style=\"font-weight: 400;\">Ask the best investors and traders if luck plays a role in their success, and if they tell you “no”, they are probably not telling the truth. Don’t get us wrong, trading is definitely not about luck. You will see from the following examples that we are talking more about investments where luck played a role and made the rewards much more fulfilling.<\/span><\/p>\n<h2>GEICO vs. Graham<\/h2>\n<p><span style=\"font-weight: 400;\">A perfect example of this is the case of the famous investor Benjamin Graham, whose fund invested $712,500 in GEICO stock in 1948. By 1972, the value of this investment had grown to $400 million. The interesting fact about this investment is that Graham broke several of his own rules by investing more than 5% of the fund’s assets in one company (it was actually more than 20%) and held the company’s stock long after it matured and met the investment requirements. Graham himself later said, “<\/span><i><span style=\"font-weight: 400;\">In 1948, we made our GEICO investment, and from then on, we seemed to be very brilliant people.<\/span><\/i><span style=\"font-weight: 400;\">” According to Graham, the profits from this investment eventually exceeded the sum of the profits from all his other investments.<\/span><\/p>\n<h2>GEICO vs. Buffett<\/h2>\n<p><span style=\"font-weight: 400;\">The company’s stock dropped dramatically after 1972, falling from $61 per share to $2 per share. By that time a student of Graham, Warren Buffett, was also involved in the company and began buying shares of the company through his company Berkshire Hathaway (incidentally, this was the second time he bought shares of GEICO, having made a profit on his first investment, but sold the stock too soon). It is estimated that he eventually earned over $20 billion on this investment alone. In his case, however, one cannot speak of luck, although he admitted that GEICO was the best investment of his life (and he never sold it because GEICO is now part of Berkshire Hathaway).<\/span><\/p>\n<h2>Soros vs. BoE<\/h2>\n<p><span style=\"font-weight: 400;\">A well-known example of successful speculation is the so-called Black Wednesday of 17 September 1992 when George Soros speculated on the fall of the British pound and made $1 billion in profits. Of course, the trade itself is not so much about luck because Soros knew exactly what he was doing. He correctly analysed the market conditions and knew how much money he had to invest. But he did have a certain amount of luck as he admitted after the successful trade that “<\/span><i><span style=\"font-weight: 400;\">our total position by Black Wednesday had to be worth almost $10 billion. We planned to sell more than that. In fact, when Norman Lamont [the British finance minister] said just before the devaluation that he would borrow nearly $15 billion to defend sterling, we were amused because that was about how much we wanted to sell.<\/span><\/i><span style=\"font-weight: 400;\">”<\/span><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-529013\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/What-role-does-luck-play-in-trading.png\" alt=\"\" width=\"4962\" height=\"2340\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/What-role-does-luck-play-in-trading.png 4962w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/What-role-does-luck-play-in-trading-300x141.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/What-role-does-luck-play-in-trading-1030x486.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/What-role-does-luck-play-in-trading-768x362.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/What-role-does-luck-play-in-trading-1536x724.png 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/What-role-does-luck-play-in-trading-2048x966.png 2048w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/What-role-does-luck-play-in-trading-1500x707.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/What-role-does-luck-play-in-trading-705x332.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/What-role-does-luck-play-in-trading-24x11.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/What-role-does-luck-play-in-trading-36x17.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/06\/What-role-does-luck-play-in-trading-48x23.png 48w\" sizes=\"(max-width: 4962px) 100vw, 4962px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">So, what is the difference between a good trader\/investor and a bad trader\/investor who has made a lot of money due to luck? A lousy trader\/investor can not build his success on that one lucky trade and, in the long run, will lose the money he has made sooner or later. On the other hand, a good trader\/investor can use a lucky trade to his advantage. It can give him healthy confidence, allow him to open larger positions without breaking risk management rules and increase his potential profits in absolute terms.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It is still true that we cannot rely on luck in trading. If we are lucky enough to make a perfect trade, we must treat it as part of trading, try to use it to our advantage, but not rely on it becoming the norm. Benjamin Graham put it well when he said that “<\/span><i><span style=\"font-weight: 400;\">behind the luck, or the crucial decision, there must usually exist a background of preparation and discipline capacity. One needs to be sufficiently established and recognized so that these opportunities will knock at his particular door. One must have the means, the judgment, and the courage to take advantage of them.<\/span><\/i><span style=\"font-weight: 400;\">”<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Did you make any profits with a lucky trade that broke all your trading rules? Congratulations, you just had a lucky day, and that counts too. But never forget that it was just a coincidence! You don’t want to do it again and again. Go back to your strategy and your rules and stay consistent. That’s the only way to make profits in the long run.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>You can not rely on luck in trading. We have posted several blog articles about this topic in the past. It may be controversial to say that luck is important in trading, however, the special role luck plays in trading needs to be acknowledged. This is not to question the ability of successful investors to [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":529041,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[5184],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/528923"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=528923"}],"version-history":[{"count":17,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/528923\/revisions"}],"predecessor-version":[{"id":597969,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/528923\/revisions\/597969"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/529041"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=528923"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=528923"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=528923"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}