{"id":529752,"date":"2022-07-15T14:00:59","date_gmt":"2022-07-15T12:00:59","guid":{"rendered":"https:\/\/ftmo.com\/?p=529752"},"modified":"2022-07-17T21:43:41","modified_gmt":"2022-07-17T19:43:41","slug":"economic-calendar-how-do-retail-sales-reflect-economic-activity","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/economic-calendar-how-do-retail-sales-reflect-economic-activity\/","title":{"rendered":"Economic calendar &#8211; how do retail sales reflect economic activity?"},"content":{"rendered":"<p><em><span style=\"font-weight: 400;\">Retail sales are among the most watched data in the economic calendar. Their importance for the central banks&#8217; interest rate decisions increases as consumer behaviour is affected by rising inflation. <\/span><\/em><\/p>\n<p><span style=\"font-weight: 400;\">Retail sales are an estimate of total sales in retail stores in the US (it is similar in other countries, but in this article, we will mainly talk about retail sales in the world&#8217;s largest economy). It is the leading indicator of consumer spending, which accounts for the majority of the economic activity in the country, so it is an important indicator of the economy&#8217;s health. The core retail sales data omits auto sales, which are quite volatile and tend to skew the final numbers.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The numbers are based on the accounting records provided by 5,500 randomly selected retail businesses of various sizes, grouped by the type of retail, not by the type of merchandise. These include retail stores, food and non-food stores, merchandise stores, appliance stores, clothing &amp; clothing accessories stores, health &amp; personal care stores, furniture stores, departmental stores, beverage stores, electronic stores, miscellaneous retail stores, and other types of stores. Once the data is collected, the Census Bureau then publishes the approximate amount consumers spent during the previous month. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The retail sales are reported in nominal terms in millions of dollars and as a percentage change between the actual month and the previous month. The report is published once a month, with about a two-week delay, and shows the month-on-month change (which is more closely tracked because it reflects current changes in the economy) and the year-on-year change (which takes into account seasonal effects). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The data is not inflation-adjusted, which can be a disadvantage in tracking some volatile sectors such as energy. However, the data is adjusted for seasonal effects, taking into account holidays when consumer spending rises rapidly for a short period of time (for example, Christmas accounts for up to 20% of all retail sales) and the number of working days in each month.<\/span><\/p>\n<h2>An important figure on which services are missing<\/h2>\n<p><span style=\"font-weight: 400;\">For investors and traders, this data provides important insights into consumer behaviour and information on which products and commodities consumers spend the most at any given time. However, some economists consider the biggest drawback of the retail sales data to be the fact that the report only takes into account services related to the direct sale of goods and does not take into account sales of services such as travel, culture, plumbing or healthcare, etc. These represent a relatively large part of the US economy.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Generally, any positive percentage figure means that consumer spending rose in a given month, while a figure below zero implies that consumer spending fell. However, as with any other figure in the macro calendar, economists&#8217; and investors&#8217; expectations are decisive. For example, bad weather can affect retail sales, where the numbers temporarily drop, which investors have to consider. Similarly, tax increases may affect retail sales, where sales will also fall for a while.<\/span><\/p>\n<h2>Sales growth = currency appreciation<\/h2>\n<p><span style=\"font-weight: 400;\">The higher-than-expected actual figures for the previous month mean that consumer spending growth is accelerating at a higher pace, and economic activity is picking up. This should be seen as positive information for a country&#8217;s currency, as the likelihood of interest rates rise increases as economic activity increases. Thus, lower than expected numbers are considered negative for a given currency.<\/span><\/p>\n<h2>Nothing is so clear-cut<\/h2>\n<p><span style=\"font-weight: 400;\">However, it does not always have to be so clear-cut, as many factors influence the functioning of the economy. A good example would be countries that rely on imports for consumer goods, whereby a rise in retail sales can mean a greater demand for foreign currencies and, therefore, a fall in the country&#8217;s currency. Also, a decline in industrial production combined with rapid growth in retail sales may lead to an increase in imports into a country, which has a negative effect on the country&#8217;s trade balance but also on prices, which may rise more sharply, leading to a decline in retail sales in the future and, again, a depreciation of the currency.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In addition to inflation, central bankers in the US now consider personal consumption expenditures (PCE), which account for more than two-thirds of GDP, when deciding on interest rates. Retail sales, which account for around half of total consumer spending, can thus provide them with an essential indication of likely PCE growth in the current and next quarters. And consequently, investors and traders can better predict what steps the central bank will take to fight inflation and how willing it will be to continue raising interest rates.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Retail sales are among the most watched data in the economic calendar. Their importance for the central banks&#8217; interest rate decisions increases as consumer behaviour is affected by rising inflation.  Retail sales are an estimate of total sales in retail stores in the US (it is similar in other countries, but in this article, we [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":529840,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/529752"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=529752"}],"version-history":[{"count":10,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/529752\/revisions"}],"predecessor-version":[{"id":531756,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/529752\/revisions\/531756"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/529840"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=529752"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=529752"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=529752"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}