{"id":530055,"date":"2022-07-22T14:00:33","date_gmt":"2022-07-22T12:00:33","guid":{"rendered":"https:\/\/ftmo.com\/?p=530055"},"modified":"2022-07-22T13:11:41","modified_gmt":"2022-07-22T11:11:41","slug":"can-the-new-brics-reserve-currency-compete-with-the-us-dollar","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/can-the-new-brics-reserve-currency-compete-with-the-us-dollar\/","title":{"rendered":"Can the new BRICS reserve currency compete with the US dollar?"},"content":{"rendered":"<p>In June 2022, the BRICS countries announced plans to introduce a new reserve currency as an alternative to the US dollar. Will we see the new currency in the forex market to compete with the US dollar and the euro?<\/p>\n<p>In mid-June, at one of the last meetings of the BRICS countries (Brazil, Russia, China, India, and South Africa), the Russian President Putin announced that Russia, China and the other countries of the community have plans to introduce a new global reserve currency that should work on the principle of a basket of currencies of the mentioned countries (something like the SDR of the International Monetary Fund). It should also be a direct competitor to the US dollar.<\/p>\n<p>The US dollar has long been the most traded currency in the currency market and is used as a reserve currency, it is also used in most international transactions and is traded in most commodities. In addition, it is considered by traders as a safe-haven that investors buy in times of uncertainty. The US dollar has long been a thorn in the side of some countries, led by Russia and China, which are trying to come up with something that could reduce their dependency on the US currency.<\/p>\n<p>Given that the Russian invasion of Ukraine and the sanctions imposed by the West make it impossible for Russia to make its payments in US dollars, the question of a currency in which the Russian ruble would play an important role is certainly logical. The relatively rapid recovery of the Russian ruble after the sanctions which have been imposed on Russia gives Russia courage, but it will certainly not guarantee the new project&#8217;s success. The BRICS countries may now account for almost a third of the world’s GDP, but the differences between the countries are abysmal and will probably remain so for some time.<\/p>\n<h2>BRIC as an acronym, nothing more<\/h2>\n<p>The BRICS grouping is an artificially created entity of countries with different developed economies (although so is the European Union), with different potential for future development. It was created virtually only because the economist Jim O&#8217;Neill in 2001 coined an acronym for the four major emerging economies (which he said had the potential to become the world&#8217;s most dominant economies by 2050) that sounded funny (BRIC is pronounced like a “brick”) and caught on in the media and among economists.<\/p>\n<p>Individual countries did maintain some form of cooperation at various levels before the acronym was coined, but not in the way it began after 2009 when the first meeting of the BRIC leaders took place. After the accession of South Africa and the formation of BRICS, the organisation became more of a political grouping, as it did not make much sense economically, according to O&#8217;Neill.<\/p>\n<h2>BRIC vs. US dollar<\/h2>\n<p>Proponents of the new currency present it as a serious threat to the US dollar, arguing in particular that (along with Iran and Argentina, which want to join the BRICS grouping) the countries together account for more than a quarter of the world&#8217;s oil production, half of iron ore production, 40% of corn production and 46% of wheat production. This could give the new reserve currency a good start in the world economy.<\/p>\n<p>Another argument is that the US dollar&#8217;s share in the world&#8217;s foreign exchange reserves has been recently declining. This is true (from over 70% in 1999, the US dollar&#8217;s share has fallen to 59% by the end of 2021), but most of this change is not a shift of funds into the currencies of some of the BRICS countries (about 25% is a shift into the renminbi), but into the currencies of smaller economies such as the Australian dollar, the Canadian dollar, or the Swedish krona.<\/p>\n<p>The most common issues the mentioned countries have are socio-economic problems, underdevelopment of infrastructure, a large share of the shadow sector, high levels of corruption in state institutions, sanctions, significant social stratification, etc. All of this worsens the business and the economic environment in the countries in question.<\/p>\n<p>Today, Russia is waging war in Ukraine, costing the country a massive amount of money, and most of the Western world practically does not want to trade with it and does not consider it a serious partner. Russia will not get rid of this label any time soon, and the other countries in the grouping are maintaining a reserved attitude in this regard rather than taking its side unequivocally.<\/p>\n<p>There may be a demand for a competing currency to end the US dollar&#8217;s hegemony from small emerging countries, but this may not be enough for the new currency to succeed. Bond yields in the BRICS countries may look attractive, but this is due to the high credit risk of the countries, not their quality. Like the BRICS grouping itself, this currency is thus more of a political project that will probably never see the actual implementation.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In June 2022, the BRICS countries announced plans to introduce a new reserve currency as an alternative to the US dollar. Will we see the new currency in the forex market to compete with the US dollar and the euro? In mid-June, at one of the last meetings of the BRICS countries (Brazil, Russia, China, [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":530105,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[89041],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/530055"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=530055"}],"version-history":[{"count":8,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/530055\/revisions"}],"predecessor-version":[{"id":530141,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/530055\/revisions\/530141"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/530105"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=530055"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=530055"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=530055"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}