{"id":530976,"date":"2022-08-05T12:34:05","date_gmt":"2022-08-05T10:34:05","guid":{"rendered":"https:\/\/ftmo.com\/?p=530976"},"modified":"2023-11-10T14:51:25","modified_gmt":"2023-11-10T13:51:25","slug":"gambling-is-not-the-right-way-to-make-money","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/gambling-is-not-the-right-way-to-make-money\/","title":{"rendered":"Gambling is not the right way to make money"},"content":{"rendered":"<p><em>Trading in the financial markets is, in the eyes of the broad public, often perceived as some sort of gambling. Although this statement has little to do with the truth, there are plenty of traders who actually behave like gamblers when trading and unknowingly support this claim.<\/em><\/p>\n<p>People are driven to gamble by the desire to make a quick buck. The problem is that a quick profit usually equals high risk and a low probability of success. And since financial markets are considered a risky markets where one can make a lot of money, many people automatically associate trading in financial markets with gambling.<\/p>\n<p>However, the reality is different, and at FTMO we try to stress to our traders as often as possible that trading is not a sprint for quick money, but a marathon leading to consistent results over the long term. So what should traders look out for when trying to prevent gambling?<\/p>\n<p>Choosing an untrustworthy prop trading firm can already be considered a type of gambling. Check the firm&#8217;s history, reputation and more. In the age of the internet, it is easy to obtain almost any information. Take the trouble to do a little research.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=gambling\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546397 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p>Look around social media, ask in groups, go through reviews from real customers. You should look for whether the company pays out money, what are their spreads and commissions, if they use their own technical solutions or if you’ll have to rely on the services of their contracted broker you&#8217;ve never even heard of.<\/p>\n<p>Will anyone even answer you with sufficient professionalism when you ask their customer support a question, or will you wait several days for an email? And does it actually care about the trading community or is collecting fees the only interest here?<\/p>\n<p>Are you intrigued by the overly simple account terms, extremely low prices and nonsensical payout terms? Simple terms and millions of dollars available right from the start may look appealing, but past examples from some companies clearly show that this model may not be really sustainable. A trader who is tempted by the simplicity of the terms may make money on the paper, but may not see them in his bank account.<\/p>\n<p>Let us now take a look at some examples of risk trading.<\/p>\n<h2>Overleveraging<\/h2>\n<p>A classic example of gambling seen with many traders is overleveraging. Some traders feel that the larger the positions they open, the sooner they will make a fortune. Unfortunately, the reality is that such large positions often tend to increase trader&#8217;s stress due to a possibility of a large loss and ultimately result in a negative effect on the psyche, which in turn leads to more mistakes being done and initial trading plan sabotaged.<\/p>\n<p>At the same time, trading of large positions (opened as a single entry or entered into gradually by further reinforcements of the trade) limits the trader&#8217;s options as in the case of trading for FTMO, a trader has to think about the Maximum Daily Loss objective. With each additional position being open, the trader increases the risk of exceeding the Maximum Daily Loss limit in case markets do not go their way. Thus, they have to reduce their Stop Losses (in points\/pips) or simply cannot open another position that could potentially be profitable.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=gambling\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546404 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p>Increasing positions while revenge trading is also problematic, especially when a trader has had a series of bad trades and wants to &#8220;make up&#8221; for them with one big trade.<\/p>\n<p>Since the trader in such a case is certainly not in an ideal state of mental well-being, such a trade is likely to be an attempt outside the strategy, without risk management and with little chance of success, again with the risk of violating the terms and conditions.<\/p>\n<p>In some cases, even a trader who has had a good run of trades may resort to excessive use of leverage, and his buoyant confidence tells him that if it works with smaller positions, why shouldn&#8217;t it work with the large ones?<\/p>\n<p>Unfortunately, Murphy’s Law also works in the financial markets and usually, such a trade means an unnecessarily large loss and again the risk of violating the basic terms of the Trading Objectives.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-531000\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/Trading-Crypto-and-Indices-1030x486.jpg\" alt=\"\" width=\"1030\" height=\"486\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/Trading-Crypto-and-Indices-1030x486.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/Trading-Crypto-and-Indices-300x141.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/Trading-Crypto-and-Indices-768x362.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/Trading-Crypto-and-Indices-1536x724.jpg 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/Trading-Crypto-and-Indices-2048x966.jpg 2048w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/Trading-Crypto-and-Indices-1500x707.jpg 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/Trading-Crypto-and-Indices-705x332.jpg 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/Trading-Crypto-and-Indices-24x11.jpg 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/Trading-Crypto-and-Indices-36x17.jpg 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/Trading-Crypto-and-Indices-48x23.jpg 48w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<p>&nbsp;<\/p>\n<h2>Overexposure<\/h2>\n<p>Some traders tend to trade multiple instruments to diversify their risk. However, even here it may happen that a trader opens several positions representing several instruments or currency pairs, but at the same time, the trader is exposed to more risk on one instrument or currency. A typical case may be the opening of several positions on different major pairs. What looks like a diversified position could simply be one big dollar bet.<\/p>\n<p>However, scaling in, or in the opposite case, diluting positions, is a similar case. Let us imagine a simple situation. You have caught a trend movement, everything is positive and you are merrily buying to make the highest possible profit. But is this the right approach?<\/p>\n<p>Isn&#8217;t it actually the same trading idea all the time? Are you really living up to sound risk and money management in this case?<\/p>\n<p>Dangerous are also situations when a trader opens a position or a combination of positions that are so large that they use the maximum potential of the available margin. Although the trading account technically allows it, from a risk and money management perspective this is not a safe approach, even if the trader has entered Stop Losses. An experienced trader understands concepts such as slippage, order execution at a different value, sudden price fluctuations, gaps, flash crashes, etc. Since the trading account behaves according to the real market liquidity, no one is ever guaranteed to execute according to the order entered.<\/p>\n<p>In a nutshell, large positions or the sum of the sizes of a combination of several positions at the same time is a very risky approach and certainly not recommended at FTMO. A more conservative approach and risk control is always better, rather than trading in volumes that even the big players often do not trade. Remember that professionals usually risk only 1% and still make very interesting profits in a safe and stable environment and long term. No one wants to make rookie mistakes and quit trading prematurely due to the consequences of imprudent risk management and too large positions. Again, less is often more.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/scaling-plan\/?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=gambling\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546367 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h2>One-sided bets<\/h2>\n<p>A form of gambling can be opening one larger position on one instrument. Alternatively, this can also include buying up positions in profit or, heaven forbid, in loss, which we mentioned above.<\/p>\n<p>If the first position itself is large and exceeds the limits of reasonable risk management, opening additional positions is pure gambling.<\/p>\n<p>While it is true that opening additional positions on a profitable trade can be a profitable strategy in the event of a strong trend, are you really that confident about the long-term trend?<\/p>\n<p>This is doubly true for opening a position at a loss because the desire to change the direction of the market as positions grow leads to unnecessary stress and a possible big loss, from which a trader can take a long time to recover.<\/p>\n<p>Simply put, something like this has nothing to do with serious trading at all. A real serious trader has qualities, he has an advantage in his strategy that he can use, but not once, not twice, he can use it day after day, month after month and year after year.<\/p>\n<p>A one-sided bet usually looks so tricky that the trader simply risks a large amount of free margin on a single market event, usually driven by macroeconomic factors. The market tends to move quickly in one direction, which of course may work once, but not the second or third time. Targeting the limits is always unnecessarily dangerous and risky.<\/p>\n<p>The Evaluation Process in this case actually misses the point, as it says nothing about the trader at all, except that he likes undue risk and will not be much of a strategic long-term investment.<\/p>\n<p>We don&#8217;t have to go far for example.<\/p>\n<p>Can someone who bought Bitcoin for $500 in 2016 and remembered it at the end of 2021 be considered a trader? God forbid a consistent trader?<\/p>\n<p>When bitcoin was hitting its highs, there were constant articles about bitcoin millionaires and their enjoyment of luxury and the endless bull trend. Suddenly (August 2022) when bitcoin is depreciating an incredible %, it is very hard to find such articles and photos with actual dates anymore. On the other hand, luxury goods classifieds sites are starting to fill up with ads to keep these &#8220;net traders&#8221; at least some cash flow.<\/p>\n<p>This behaviour has nothing to do with trading at all. Those who hold an instrument for several years are more like investors and on the other hand, those who bet all their chances on one card belong more to the casino. If you want to experience the feelings associated with one-sided betting, go to the aforementioned casino, but avoid trading.<\/p>\n<h2>Account Rolling<\/h2>\n<p>An interesting case and form of gambling specific to prop trading firms is account rolling. In this case, traders will buy multiple evaluation courses at the maximum amount available. They manage to complete these (including Verification). However, due to the limitation of the maximum allocation for one trader\/strategy, they can not trade on all accounts at the same time, nor can they combine them into one account.<\/p>\n<p>This leads them to believe that they can open unnecessarily risky trades on the account they have received first, because if they recklessly breach that account, they can start trading in the next one almost immediately.<\/p>\n<p>Yet FTMO tries to encourage traders to take exactly the opposite approach. Thanks to the Scaling plan, not only traders can get extra funds every four months, but also the payout ratio will improve from the classic 80% to a staggering 90% on the first top-up.<\/p>\n<p>Something like this is impossible to achieve with excessive ordering, as the merchant recklessly violates one account after another.<\/p>\n<p>Once a trader is able to complete several Verifications, he should have no trouble achieving an account increase, costing him much less money and receiving a larger percentage of his profits.<\/p>\n<p>If someone is ordering accounts more than is healthy, according to mathematical probabilities, he has a pretty good chance of succeeding on several accounts, while breaking many of them. This is true, but it is certainly not something we would support because again it misses the point of our Evaluation Process where we are trying to test the trader and the robustness of their strategy. Anyone can keep rolling accounts one by one, but that says nothing about the trader. To some extent, we can also talk about abuse of the system and we would not like to see that in our traders, who are ultimately entrusted with the management of FTMO Account and from whom we expect consistent accountability.<\/p>\n<p>Gambling is a very risky business. Trading is often demonised and it is no wonder nowadays. Remember why you started trading in the first place. Was your goal to make a quick buck? Wasn&#8217;t it instead about finding a consistent source of income that you can even make from anywhere in the world and over the long term?<\/p>\n<p>We at FTMO are not indifferent to the mental health of our traders, nor to the image of trading as a whole. We actively monitor gambling practices and do not turn a blind eye to them. Come and help us and change the situation for the better. Let’s show that real traders are professionals who deserve respect. Professionals who are not afraid to take risks, but predefined risks. Professionals who have found a real edge in the market which gives them a long-term advantage. Serious traders are not get-rich-quickers who have made one trade, but professionals who have sacrificed a lot of time to learn what may seem just like lines and numbers to others.<\/p>\n<p>And if the motivation for trading was to get rich quick, try the lottery or casino, that&#8217;s where you might actually succeed (better not do that either, it&#8217;s not the most sensible way to go).<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Trading in the financial markets is, in the eyes of the broad public, often perceived as some sort of gambling. Although this statement has little to do with the truth, there are plenty of traders who actually behave like gamblers when trading and unknowingly support this claim. People are driven to gamble by the desire [&hellip;]<\/p>\n","protected":false},"author":29,"featured_media":531410,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/530976"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/29"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=530976"}],"version-history":[{"count":18,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/530976\/revisions"}],"predecessor-version":[{"id":598325,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/530976\/revisions\/598325"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/531410"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=530976"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=530976"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=530976"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}