{"id":532515,"date":"2022-08-19T13:30:33","date_gmt":"2022-08-19T11:30:33","guid":{"rendered":"https:\/\/ftmo.com\/?p=532515"},"modified":"2022-08-19T13:49:54","modified_gmt":"2022-08-19T11:49:54","slug":"want-to-invest-in-the-us-economy-try-the-sp-500-index","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/want-to-invest-in-the-us-economy-try-the-sp-500-index\/","title":{"rendered":"Want to invest in the US economy? Try the S&#038;P 500 Index"},"content":{"rendered":"<p><em>Instruments linked to US equity indices belong to the most popular and the most traded ones worldwide (and FTMO Traders are no exception). One of the most well-known indices, covering most of the market capitalisation in the US, is the S&amp;P 500 index, which will be discussed today.<\/em><\/p>\n<p>S&amp;P 500 is not the most famous stock index in the US; such honour belongs to its older &#8220;brother&#8221;, Dow Jones Industrial Average. However, the DJIA is far from being the best indicator of what is happening in the US stock market. If you want to get a truly complex picture, S&amp;P 500 does a better job.<\/p>\n<p>The companies included in the index represent more than 83% of the market capitalisation in the US. Moreover, this index is one of the indices to which most investment instruments are linked. The S&amp;P 500 is the underlying benchmark for more than USD 13,5 trillion in assets and has nearly USD 5,4 trillion of passive index instruments directly linked to it (at the end of 2020).<\/p>\n<p><em>Wells Fargo and American National Bank launched the first mutual fund for institutional investors to track the S&amp;P 500 in 1973. The first mutual fund for retail investors tied to the S&amp;P 500 was launched in 1976 by Vanguard under the name Vanguard First Index Investment Trust, now the Vanguard 500 Index Fund. Then in 1993, the first ETF with the S&amp;P 500 Index as an underlying asset was created called Standard and Poor&#8217;s Depository Receipts, now known as the SPDR S&amp;P 500 Trust ETF (known by its acronym Spider).<\/em><\/p>\n<p>Although it is one of the most well-known indices, a lot of false information is circulating about it. For example, it is not true that the index brings together the 500 largest companies in the U.S. Rather, it focuses on leaders in all sectors and industries (according to the Global Industry Classification Standard, there are 11 sectors, which are further divided into 24 industry groups of 69 industries and 158 sub-industries), thus occupying the entire industry spectrum in the US stock markets virtually.<\/p>\n<h2>History<\/h2>\n<p>It is also not entirely true that the index was created in 1957. The predecessor of Standard and Poor&#8217;s founded in 1923 compiled several indicators that tracked 26 industries and 233 stock titles weekly. In 1926, the S&amp;P 90 Composite Index was created, comprising 50 industrial companies, 20 railroad companies, and 20 utilities. In 1941, the number of stocks in the first composite index was expanded from 233 to 416, and together with the S&amp;P 90 index, their original value was recalculated to a starting point of 100 points as of 1935 and 1939, respectively.<\/p>\n<p><em>Standard and Poor&#8217;s was formed in 1941 when Standard and Poor&#8217;s Statistical Co. and Poor&#8217;s Publishing Co. merged. As early as 1860, businessman Henry Varnum Poor had published a book, &#8220;History of Railroads and Canals in the United States,&#8221; which sought to provide investors with a comprehensive view of the operation of the then rapidly developing railroads. Together with his son Henry William Poor, they founded the H.V. and H.W. Poor Co., which published annually updated versions of &#8220;Poor&#8217;s Manual of the Railroads of the United States&#8221; and &#8220;Poor&#8217;s Directory of Railway Officials&#8221;. The Standard Statistics Bureau was founded in 1906 by Luther Lee Blake to provide investors with information on companies outside the railroad industry.<\/em><\/p>\n<p>On March 4, 1957, the number of companies in the first composite index was expanded to 500, creating the S&amp;P 500 index, which was calculated on an intraday hourly basis. To maintain a long and continuous time series, the S&amp;P 90 index was chosen as the base, with data now officially available back to 1928 daily and to 1926 weekly.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-532505\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/spx_ind-1.png\" alt=\"\" width=\"1918\" height=\"950\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/spx_ind-1.png 1918w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/spx_ind-1-300x149.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/spx_ind-1-1030x510.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/spx_ind-1-768x380.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/spx_ind-1-1536x761.png 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/spx_ind-1-1500x743.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/spx_ind-1-705x349.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/spx_ind-1-24x12.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/spx_ind-1-36x18.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/08\/spx_ind-1-48x24.png 48w\" sizes=\"(max-width: 1918px) 100vw, 1918px\" \/><\/p>\n<p>This was a rather revolutionary step in the field of stock indexes, as the index was calculated by a new electronic method from Melpar, which allowed tracking all companies on the NYSE. But not all titles were liquid enough at the time, so the index&#8217;s authors, Lew Schellbach and George Olsen, selected 500 companies that would best represent the entire US stock market.<\/p>\n<h2>Composition<\/h2>\n<p>Initially, the industrial sector represented the majority of the index (425 firms), with 60 firms in the utility sector and 15 railroad companies. The composition of the index did not change until 1976. In that year, financials were added to the index for the first time, but the majority were industrial giants even then. From 1988 onwards, the strict sectoral classification no longer served its function, as changes in the economy were very rapid. Since 1989, the index&#8217;s composition can be changed as often as necessary (currently done quarterly), and the last change was on June 8 and June 21, 2022.<\/p>\n<p>The S&amp;P 500 was also the first equity-weighted index (today, this method of measuring the weighting of individual titles, which depends on the market value of companies, is quite common); since 2005, the index has been weighted based on the volume of stocks freely available to investors in the market (so-called float-adjusted). This category does not include stocks held by strategic investors that do not make it to the market, but only those that are theoretically freely available.<\/p>\n<p><span data-preserver-spaces=\"true\">The committee decides the composition of the index on the basis of several criteria. The committee meets on monthly basis and, among other things, assesses the companies that could be included in the index. At the same time, it tries to keep the turnover of the included companies to a minimum. For example, companies in the index must be US companies (foreign companies were allowed to be in the index until July 2002), have a total market capitalisation of at least USD 14.6 billion, have a certain proportion of free float, meet liquidity conditions, etc.<\/span><\/p>\n<p><span data-preserver-spaces=\"true\">S&amp;P Dow Jones Indices, a subsidiary of S&amp;P Global, handles the updating (which takes place every second) and disseminating of the index data. If an investor or trader wants to invest in stocks and is looking for a tool that covers most of the companies in the world&#8217;s largest economy, the S&amp;P 500 Index may be an excellent tool for them. Investors can capitalise on the growth of the most influential stocks traded on the NYSE, NASDAQ and CBOE through one tool, and FTMO traders can also capitalise on their declines through a leveraged CFD under the ticker US500.cash. Given the low spreads and zero commissions (which apply to all index instruments), it is no wonder that it is one of the very popular instruments among FTMO traders today.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Instruments linked to US equity indices belong to the most popular and the most traded ones worldwide (and FTMO Traders are no exception). One of the most well-known indices, covering most of the market capitalisation in the US, is the S&amp;P 500 index, which will be discussed today. S&amp;P 500 is not the most famous [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":532585,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[89041],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/532515"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=532515"}],"version-history":[{"count":8,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/532515\/revisions"}],"predecessor-version":[{"id":532517,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/532515\/revisions\/532517"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/532585"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=532515"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=532515"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=532515"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}