{"id":535655,"date":"2022-09-09T13:00:02","date_gmt":"2022-09-09T11:00:02","guid":{"rendered":"https:\/\/ftmo.com\/?p=535655"},"modified":"2022-09-09T13:04:26","modified_gmt":"2022-09-09T11:04:26","slug":"oil-a-fossil-fuel-but-also-the-most-traded-commodity","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/oil-a-fossil-fuel-but-also-the-most-traded-commodity\/","title":{"rendered":"Oil: a fossil fuel, but also the most traded commodity"},"content":{"rendered":"<p><em><span style=\"font-weight: 400;\">Oil is one of the most traded commodities. Its influence on world trade and its relatively volatile price development increase its attractiveness among traders and speculators in commodity markets. Recent developments in the oil market prove that oil still has a great potential as an investment instrument.<\/span><\/em><\/p>\n<p><span style=\"font-weight: 400;\">Although the demand for greater use of clean and renewable forms of energy has been growing in recent years, and the impact of green policies on the energy sector is increasing, oil is still one of the most important energy commodities. Moreover, developments in recent months show that oil and its price still have a relatively strong influence on the global economy and the political situation.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The importance of fossil fuels, one of which is oil, only began to rapidly grow with the rise of the Industrial Revolution. The oil itself did not become the most important fossil fuel until the second half of the 20th century, and its price was relatively stable for a long time. It was not until the oil shocks of the 1970s that oil became a commodity that influenced economic and often political events on a global scale. Its strategic position as one of the most important energy commodities (together with natural gas) is still maintained today.<\/span><\/p>\n<h2>Oil shocks and futures<\/h2>\n<p><span style=\"font-weight: 400;\">The oil shocks, which caused significant fluctuations in oil prices due to the political crises, led to the introduction of the first oil futures contracts on the US commodity exchanges CBOT and NYMEX in 1983. Until then, oil was traded at the spot price, i.e. the current market price for a short-term delivery. However, oil traders and refiners needed to limit the risk of sudden price shocks, and long-dated futures contracts allowed them to lock in the oil price at the desired level without the risk of future fluctuations.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Over time, futures contracts have become one of the leading price-determining indicators in the oil market, and, in addition to hedging operations, they are also very popular instruments for speculators and short-term traders.<\/span><\/p>\n<h2>Density and sulphur content are important<\/h2>\n<p><span style=\"font-weight: 400;\">Today there are several dozen types of oil on the oil market. Their price varies depending on the region where the oil comes from and its quality, but it can also be influenced by other factors such as the cost of transport, etc. In terms of quality, oil density and sulphur content are the main factors affecting the price. The density of oil is measured by API gravity, and the lighter the oil, the easier to refine it is and, therefore, the more valuable it is. Sulphur content is measured as a percentage of total weight, with low sulphur crude oil (less than 0,5 %) being referred to as sweet and higher sulphur crude oil (more than 1 %) being referred to as sour. Again, sweet crude is more easily refined and more expensive.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The main oil products that determine the price of crude oil on the world markets and affect the price of other types of oil are Brent and WTI. In addition to these two types of crude oil, Dubai crude oil, known as Fateh (heavy sour crude), OPEC Reference Basket (a mix of heavy and light crude oil produced in OPEC member countries), or Canadian Edmonton Par (light sweet crude) and Western Canadian Select (heavy sour crude) are quite often tracked.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Traders using FTMO’s services can trade crude oil through CFD contracts linked to both of these types of crude oil, i.e. Brent (an instrument called UKOIL.cash) and WTI (USOIL.cash).<\/span><\/p>\n<h2>Brent as the main world benchmark<\/h2>\n<p><span style=\"font-weight: 400;\">North Sea Brent crude oil is produced at several locations in the North Sea, with the main delivery point being the terminal at Sullom Voe Bay in Shetland. It is a light and sweet crude oil which is now mainly produced from the Forties, Oseberg, Ekofisk and Troll oil fields (production from the Brent field, after which it takes its name, where oil was produced since 1976, fell to zero in 2021).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">When people talk about the price of Brent crude oil, they mean the price of the Brent Crude Oil futures contract traded on the Intercontinental Exchange (ICE). Brent futures contracts are also traded on the NYMEX, but the price is based on the contracts traded on ICE. Brent is considered the primary benchmark for oil trading in Europe and Africa, with nearly two-thirds of all oil contracts worldwide linked to Brent. It is thus the most widely used benchmark in the commodities market.<\/span><\/p>\n<h2><b>WTI is of better quality but cheaper<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Unlike Brent, US WTI (West Texas Intermediate) crude is not produced in one specific location but rather in multiple fields with Cushing, Oklahoma being the main delivery point. Originally, crude oil was produced and processed in Cushing, Oklahoma and Midland, Texas, today WTI crude oil can be referred to as crude oil from anywhere in the USA as long as it meets the quality requirements.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As with Brent, the price of WTI is primarily based on futures contracts traded on the New York Mercantile Exchange (NYMEX). This is a very light and sweet crude oil and is the leading benchmark for oil trading in the US.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Although WTI crude is lighter and sweeter than Brent crude (both of which are of very high quality), its price is lower today. Historically, the difference between the two has been minimal, with WTI crude being $2-3 per barrel more expensive due to its higher quality and transport costs. After the financial crisis of 2007-2008, when the price of oil experienced an extreme rise and a subsequent fall, the price between Brent and WTI started to drift apart in 2010 and 2011. Brent was much more expensive, and in 2012 the difference between the prices peaked at $26.<\/span><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-535646\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/fredgraph.png\" alt=\"\" width=\"1168\" height=\"450\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/fredgraph.png 1168w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/fredgraph-300x116.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/fredgraph-1030x397.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/fredgraph-768x296.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/fredgraph-705x272.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/fredgraph-24x9.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/fredgraph-36x14.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/fredgraph-48x18.png 48w\" sizes=\"(max-width: 1168px) 100vw, 1168px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Several factors have influenced the growth of this difference, but the main ones are considered to be the increased production of tar sands in Canada and the boom of fracking in the USA. Excess crude oil has overwhelmed the transportation infrastructure, complicating the transport of crude oil, and Cushing has seen record increases in inventories. The situation normalised only after the infrastructure improved, and the inventories returned to normal.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Even today, Brent crude is more expensive, probably because its reserves are dwindling much faster than in the US. In addition, oil production in North America is still increasing, and transporting it from the interior is still relatively difficult and expensive. Brent, produced offshore and easier to transport, is thus now considered to be a more critical and reliable indicator of the oil price.<\/span><\/p>\n<h2>Prices below zero<\/h2>\n<p><span style=\"font-weight: 400;\">The development in recent years shows that the price of oil is still quite volatile and, therefore, it is also of interest to speculators and traders. Something happened in April 2020 that probably no one could have imagined before then (and certainly not today), as at one point the price of oil on the markets fell into negative territory. With the rapid decline in the oil demand due to the Covid-19 disease pandemic and the disagreements over oil production cuts between the OPEC countries and Russia, there was a significant excess of supply over demand. Insufficient storage capacity and slow production curtailment eventually led to some oil traders holding futures contracts paying to get rid of their contracts because they feared they would be unable to store the commodity.<\/span><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-535639\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/oil-price-low.png\" alt=\"\" width=\"1450\" height=\"707\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/oil-price-low.png 1450w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/oil-price-low-300x146.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/oil-price-low-1030x502.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/oil-price-low-768x374.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/oil-price-low-705x344.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/oil-price-low-24x12.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/oil-price-low-36x18.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/09\/oil-price-low-48x23.png 48w\" sizes=\"(max-width: 1450px) 100vw, 1450px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Today, the price of oil is affected by the geopolitical uncertainty caused by Russia’s military campaign in Ukraine, and the price was above $100 per barrel from March until July. High inflation and the associated rise in interest rates, together with the economic slowdown in China, which is still battling Covid, may harm the demand for the commodity, which has likely led to the price falling below $90 per barrel. However, further price developments are uncertain, which may not be good news for ordinary consumers. On the other hand, it may be a positive boost for traders who can find exciting opportunities due to the volatile price.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Oil is one of the most traded commodities. Its influence on world trade and its relatively volatile price development increase its attractiveness among traders and speculators in commodity markets. Recent developments in the oil market prove that oil still has a great potential as an investment instrument. Although the demand for greater use of clean [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":535740,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[89041],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/535655"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=535655"}],"version-history":[{"count":10,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/535655\/revisions"}],"predecessor-version":[{"id":535956,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/535655\/revisions\/535956"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/535740"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=535655"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=535655"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=535655"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}