{"id":537538,"date":"2022-10-07T13:45:22","date_gmt":"2022-10-07T11:45:22","guid":{"rendered":"https:\/\/ftmo.com\/?p=537538"},"modified":"2022-10-07T13:47:27","modified_gmt":"2022-10-07T11:47:27","slug":"why-does-quick-success-not-always-mean-long-term-earnings","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/why-does-quick-success-not-always-mean-long-term-earnings\/","title":{"rendered":"Why does quick success not always mean long-term earnings?"},"content":{"rendered":"<p><em>Completing the FTMO Challenge with one trade may sound like a great achievement worth chasing. But it may not be quite the path you want to take as a trader.<\/em><\/p>\n<p>On the other hand, it&#8217;s understandable, whether you&#8217;ve been trading for a long time and just aren&#8217;t quite there yet, or you&#8217;re just starting out, the motivation to do so is pretty clear. You want to achieve success as quickly as possible. Also, who would want to wait for something like this, surely it would be great to have success right away.<\/p>\n<p>It&#8217;s certainly not helped by social networks where traders (but maybe we&#8217;d better not even call them traders) compete with each other to see who can make the most profit on a single trade. But that is not what we are going to focus on here. If you want to learn why social networks are dangerous when trading, listen to the podcast with our <a href=\"https:\/\/www.youtube.com\/watch?v=gQlQ0t1CwGw\">FTMO Performance coaches &#8211; Performance Talks, they devoted one whole episode to this topic and it&#8217;s definitely worth it<\/a>!<\/p>\n<p>It may seem illogical at first, but quick success is almost a sure way to trading hell for traders, especially the less experienced ones. The joy of a trader managing to make a larger sum of money in the shortest possible time can mean significant problems in the future. It is certainly a great feeling, but unfortunately it is accompanied by several, primarily, psychological pitfalls.<\/p>\n<h2>Beginner&#8217;s luck<\/h2>\n<p><span style=\"font-weight: 400;\">We would like to highlight the following as the biggest problem. Most of these traders are not sure of their trading strategy. They may not fully admit it, but they know very well that it was just a pure chance. They just got lucky.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">They haven’t tested their strategy, they can’t trust it enough, and they certainly can’t trust themselves enough to replicate those results. They haven’t had those successful months, they’re just trying to find a shortcut. Do you want to guess how most of these seemingly lucky people end up?<\/span><\/p>\n<h2>Great expectations<\/h2>\n<p><span style=\"font-weight: 400;\">The excitement of initial success leads marketers to having high expectations. <\/span> But it is impossible to repeat the luck that has befallen them before. If we were talking about a sensible consistent strategy, it&#8217;s a different story. But here exaggerated expectations are at work, which can then lead to overtrading, which is obviously not the way to long-term profits. After a series of losing trades, the trader feels that the more trades he makes, the faster he will make up for the losses, but this is a wrong assumption.<\/p>\n<p>High confidence is usually rather detrimental, and again, all it takes are a few losing trades in a row to turn a profitable trader into a trader with a clear endgame. The markets and psychology are simply a bit against traders and more trades won&#8217;t change that.<\/p>\n<h2>Pointless overleveraging and gambling<\/h2>\n<p><span style=\"font-weight: 400;\">After achieving partial success, traders often feel that they have to earn again and even more as soon as possible. Let’s use the FTMO Account as an example. It is the FTMO Account phase that doesn’t force traders to do anything, because the need to achieve any amount of profit after obtaining it is eliminated. However, the vision of a big profit and the first successes lead them to, instead of taking a more conservative approach, trying to make the most of everything and to make as much profit as possible and as quickly as possible.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Perhaps they are led to believe that this is the right thing to do because they have had positive previous experience with it. In completing the FTMO Challenge, especially at the end, with a few days to go, they resort to breaking perhaps all the rules of risk and money management. In an attempt to meet the FTMO Challenge rules at all costs they open excessively large positions that they would not normally open at all.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">With a bit of luck, these positions end up in profit and the trader gets the feeling that this is actually the right approach and that they can make a quick and easy profit. Unfortunately, this is an approach that cannot work in the long run and the trader has set himself up for a really big problem that will hold him back in trading for a long time to come.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As has been written and said countless times, Forex is simple at first glance, but it is not an easy way to make money. Success in Forex is destined only for the most patient and responsible traders. They may not succeed right away. But when they do, they know exactly what to expect from trading and what the risks are. Most importantly, they know that there is no rush, because trading is not a sprint, but a long run.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Let’s take a small example. You won’t find any of the above with our FTMO Traders who have more than 12 payouts under their belt. No extreme fluctuations in position sizes, no tens of percent appreciation per trade, no meeting the FTMO Challenge with one trade and competing with the environment to see who can do it better. Their recipe is gradual consistent results that they can repeat week after week.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Who do you think will get more out of trading? Trader A, whose luck smiled at him and who managed one payout and will now try to repeat that luck, or Trader B, who may not have topped the leaderboard but has consistent results and can repeat them for the rest of his life? <\/span> 🙂<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Completing the FTMO Challenge with one trade may sound like a great achievement worth chasing. But it may not be quite the path you want to take as a trader. On the other hand, it&#8217;s understandable, whether you&#8217;ve been trading for a long time and just aren&#8217;t quite there yet, or you&#8217;re just starting out, [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":537589,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/537538"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=537538"}],"version-history":[{"count":8,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/537538\/revisions"}],"predecessor-version":[{"id":611248,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/537538\/revisions\/611248"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/537589"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=537538"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=537538"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=537538"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}