{"id":538271,"date":"2022-10-21T13:00:07","date_gmt":"2022-10-21T11:00:07","guid":{"rendered":"https:\/\/ftmo.com\/?p=538271"},"modified":"2022-10-21T13:06:06","modified_gmt":"2022-10-21T11:06:06","slug":"technical-analysis-bollinger-bands-as-a-combination-of-trend-and-volatility","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/technical-analysis-bollinger-bands-as-a-combination-of-trend-and-volatility\/","title":{"rendered":"Technical analysis &#8211; Bollinger Bands as a combination of trend and volatility"},"content":{"rendered":"<p><em><span style=\"font-weight: 400;\">Bollinger Bands are one of the most famous and popular indicators that track an investment instrument’s trends and volatility. Why is it of so much interest to investors?<\/span><\/em><\/p>\n<p><span style=\"font-weight: 400;\">Bollinger Bands is one of the indicators which is based on bands or envelopes that mark the relative representation of the maximum and minimum prices of an instrument. There are several similar approaches in technical analysis where bands mark the upper and the lower price ranges, and the basis for bands can be maximum and minimum prices (Donchian Bands), cycles (Hurst Bands), or percentages above\/below the moving average (Percentage Bands) or price.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Bollinger Bands may not have been the first among such indicators, but they are certainly among the best-known indicators using bands to identify oversold or overbought levels in an investment instrument. Technical trader John Bollinger developed this indicator in the 1980s.<\/span><\/p>\n<h2>Trend and volatility<\/h2>\n<p>It is not a classical trend indicator but rather an indicator that uses standard deviation as a measure of the volatility of an investment instrument when determining bands and their distance. As Bollinger himself states, volatility is a dynamic variable that changes over time, and it is the attachment of this indicator to volatility that sets it apart from other purely trend indicators.<\/p>\n<p><strong>The formula used to calculate both bands is:<\/strong><\/p>\n<p>Upper band = MA(TP,n) + m * δ[TP,n]<\/p>\n<p>Lower band = MA(TP,n) – m * δ[TP,n]<\/p>\n<p><em>MA<\/em> &#8211; moving average<\/p>\n<p><em>TP<\/em> (typical price) &#8211; (high + low + close) \/ 3<\/p>\n<p><em>n<\/em> &#8211; number of days in period (typically 20)<\/p>\n<p><em>m<\/em> &#8211; number of standard deviations (typically 2)<\/p>\n<p><em>δ [TP, n]<\/em> &#8211; standard deviation over last <em>n<\/em> periods of TP<\/p>\n<p><span style=\"font-weight: 400;\">On the chart, the Bollinger Bands are then displayed as three lines. In the middle is the classic moving average with a period of 20, and then two bands  the distance to which is not the same (unlike for most other similar indicators) but is determined by two standard deviations from the middle line.<\/span><\/p>\n<p>When the bands are wide apart, it means that the volatility in the market is high, the trend is strong, and a correction may occur; on the other hand, when the bands are close together, the volatility is low and a new trend may form. Individual values, such as the number of periods or the multiple of the standard deviation, may vary; different values may be more appropriate for different instruments. However, it should be considered that when using MAs with longer periods, the standard deviation multiple also needs to be increased. For an MA of 50, it is at least 2.1; for a shorter period, it is less than 2.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-538264\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/10\/Bollinger-Bands.png\" alt=\"\" width=\"1285\" height=\"621\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/10\/Bollinger-Bands.png 1285w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/10\/Bollinger-Bands-300x145.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/10\/Bollinger-Bands-1030x498.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/10\/Bollinger-Bands-768x371.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/10\/Bollinger-Bands-705x341.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/10\/Bollinger-Bands-24x12.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/10\/Bollinger-Bands-36x17.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/10\/Bollinger-Bands-48x23.png 48w\" sizes=\"(max-width: 1285px) 100vw, 1285px\" \/><\/p>\n<h2>What to beware of<\/h2>\n<p>Many traders make the mistake of considering the instrument&#8217;s reaching the upper or lower price band as a sell or buy signal, respectively. However, this is not true. Directly on the website dedicated to this indicator, you will find 22 rules, which, according to Bollinger, were compiled in response to questions and years of traders&#8217; experience and should serve as a starting point for those who are beginning with this indicator. Among the most important ones are the reminders that the upper band, or its touch or crossing, is certainly not a sell signal per se and that touching or crossing the lower band is not a signal to open a long position. In strong trends, the price will typically cross the upper or lower band several times in succession, and a close above the upper band or below the lower band should be taken as a continuation signal.<\/p>\n<p>As periods of low volatility alternate with periods of higher volatility, it is important to monitor this indicator, especially when the space between the bands narrows (called a squeeze). This is precisely the period when volatility is falling, and a more pronounced trend movement in one direction or the other is likely to follow. It is then that a break of one of the bands can signal the start of a new trend.<\/p>\n<p><span style=\"font-weight: 400;\">Bollinger Bands work best as a complement, either to the price action itself, where it can assist the trader in deciding on more accurate entries (Bollinger itself lists double top or double bottom formations, for example) or to another indicator. The key to combining it with another indicator is that the two tools are not correlated and are based on different types of data. According to Bollinger, these can be, for example, MACD, On-balance Volume, or RSI.<\/span><\/p>\n<p>Bollinger Bands can be a good tool for traders on different time frames and for different investment instruments. However, as with other similar indicators, it is not a self-contained tool that any trader can make wonders with.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Bollinger Bands are one of the most famous and popular indicators that track an investment instrument’s trends and volatility. Why is it of so much interest to investors? Bollinger Bands is one of the indicators which is based on bands or envelopes that mark the relative representation of the maximum and minimum prices of an [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":538350,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[162],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/538271"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=538271"}],"version-history":[{"count":9,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/538271\/revisions"}],"predecessor-version":[{"id":592854,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/538271\/revisions\/592854"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/538350"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=538271"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=538271"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=538271"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}