{"id":538866,"date":"2022-11-04T12:00:37","date_gmt":"2022-11-04T11:00:37","guid":{"rendered":"https:\/\/ftmo.com\/?p=538866"},"modified":"2022-11-04T12:11:52","modified_gmt":"2022-11-04T11:11:52","slug":"economic-calendar-durable-goods-orders","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/economic-calendar-durable-goods-orders\/","title":{"rendered":"Economic Calendar &#8211; Durable Goods Orders"},"content":{"rendered":"<p><i><span style=\"font-weight: 400;\">Durable Goods Orders is another good indicator of manufacturing activity which provides investors with important information about the state of a country’s economy. Why is it important to investors and economists?<\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">The name implies that durable goods are not intended for immediate use (such as food, fuel, medicine, office supplies, alcohol, etc.), do not expire quickly and are not consumed in a single use but provide benefits over an extended period of time. These are products that should have a lifespan of more than three years, so the time between purchases of each product can be very long. They include, for example, household appliances, furniture and equipment, cars, tyres, car batteries, consumer electronics, luggage, sports equipment, jewellery, medical equipment, toys, as well as weapons or aircraft.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Durable goods account for a relatively important part of the economic output in developed economies (consumer spending is divided into spending on non-durable goods, durable goods and services). These goods retain their value longer and are more expensive, so consumers and firms invest money in them when they are economically healthy. In the times of crisis, on the other hand, their demand for these goods falls, as can be seen in the chart below (large falls between 2007 and 2009, and also during the Covid-19 pandemic).<\/span><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-538831 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/fred-durables.png\" alt=\"\" width=\"1168\" height=\"450\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/fred-durables.png 1168w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/fred-durables-300x116.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/fred-durables-1030x397.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/fred-durables-768x296.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/fred-durables-705x272.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/fred-durables-24x9.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/fred-durables-36x14.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/fred-durables-48x18.png 48w\" sizes=\"(max-width: 1168px) 100vw, 1168px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Durable goods orders reflect the change in the total value of new orders for these goods. The figure is published monthly approximately 18 days after the beginning of the month under review by the Census Bureau as the Advance Report on Durable Goods Manufacturers’ Shipments, Inventories, and Orders. It is compiled from a survey based on data from manufacturing firms with annual orders of at least $500 million.<\/span><\/p>\n<h2>Suitable for all<\/h2>\n<p><span style=\"font-weight: 400;\">It is a good leading indicator for predicting developments in the manufacturing sector, industry, the labour market or for measuring confidence in the retail sector and a country’s economic growth. The U.S. Bureau of Economic Analysis uses the survey data from the Durables report <\/span><a href=\"https:\/\/ftmo.com\/en\/economic-calendar-gdp-as-an-indicator-of-economic-growth\/\"><span style=\"font-weight: 400;\">in calculating GDP<\/span><\/a><span style=\"font-weight: 400;\">, the Fed and Treasury use it in the monetary and fiscal policymaking, and it is used by economists and investors  in analysis and forecasting.<\/span><\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/economic-calendar-pmi-as-an-indicator-of-changes-in-economic-activity\/\"><span style=\"font-weight: 400;\">Just like<\/span><span style=\"font-weight: 400;\"> with PMI<\/span><\/a><span style=\"font-weight: 400;\">, durable goods orders suggest that when orders are rising, the likelihood of increased purchases and therefore increased production and employment increases, and vice versa. A significant decline in durable goods orders is one of the indicators of falling output, deteriorating economic conditions and a possible recession. Investors’ behaviour changes in times of crisis, and durable goods are among the first to feel the pressure to cut back on spending in order to build up financial reserves for a rainy day.<\/span><\/p>\n<h2>Nothing is perfect<\/h2>\n<p><span style=\"font-weight: 400;\">Given the interconnected and global nature of today’s trade and production, production may be constrained by factors other than purely economic ones. For example, when producers in one country are dependent on imports of materials and raw materials from another country, trade wars and the subsequent imposition of tariffs (or even the threat of tariffs) can lead to reduced spending, which will have an impact on orders.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">One of the drawbacks of this indicator is also its relatively high volatility and its relatively frequent and significant revisions. The volatility is mainly due to the large amounts of funds invested in the transport and defence sectors, where orders are irregular and not necessarily linked to the economic conditions in the country. This leads to large fluctuations in the monthly figures. Economists therefore often look at the average values over the last three to six months. The solution is to compare last month’s values with those of the previous year, thus removing the effect of seasonality and large one-off orders.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Another measure to counteract this volatility is to publish reports on durable goods orders excluding defence spending, and also core orders, which in turn exclude transport orders, where we can include, for example, expensive goods such as ships, planes and trains. Given this, the core figures are more closely followed by many economists than the overall data.<\/span><\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/economic-calendar-pmi-as-an-indicator-of-changes-in-economic-activity\/\"><span style=\"font-weight: 400;\">Similar to<\/span><span style=\"font-weight: 400;\"> PMI<\/span><\/a><span style=\"font-weight: 400;\">, Durables is a relatively under-appreciated indicator by some traders, but not one to be overlooked when trading. Its importance is certainly appreciated by all traders who follow the calendar and manage their position entries or exits in the markets accordingly.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Durable Goods Orders is another good indicator of manufacturing activity which provides investors with important information about the state of a country’s economy. Why is it important to investors and economists? The name implies that durable goods are not intended for immediate use (such as food, fuel, medicine, office supplies, alcohol, etc.), do not expire [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":538937,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/538866"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=538866"}],"version-history":[{"count":11,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/538866\/revisions"}],"predecessor-version":[{"id":566746,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/538866\/revisions\/566746"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/538937"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=538866"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=538866"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=538866"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}