{"id":539165,"date":"2022-11-11T13:40:09","date_gmt":"2022-11-11T12:40:09","guid":{"rendered":"https:\/\/ftmo.com\/?p=539165"},"modified":"2022-11-11T13:43:38","modified_gmt":"2022-11-11T12:43:38","slug":"natural-gas-a-strategic-resource-or-just-an-inflated-bubble","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/natural-gas-a-strategic-resource-or-just-an-inflated-bubble\/","title":{"rendered":"Natural gas: a strategic resource or just an inflated bubble?"},"content":{"rendered":"<p><em><span style=\"font-weight: 400;\">In recent months, natural gas has been a commodity that has significantly affected not only the financial markets, but has also indirectly affected the lives of ordinary people whose cost of living has increased. How the gas market actually works today and what influences its price is what we will look at in today’s article.<\/span><\/em><\/p>\n<p><span style=\"font-weight: 400;\">Natural gas is a fossil fuel that is extracted from porous sedimentary rocks encased in structural traps, similar to oil. It is found either alone or together with oil or coal. Although natural gas has been known to humans since ancient times, it has been used commercially for a relatively short  period of time.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The first commercial use of gas dates back to 1785, when gas produced from coal was used to light houses and streets. In the beginning, the use of gas as a source of light was its only use.  By the end of the nineteenth century, the Industrial Revolution and new technologies expanded its uses. New ways of transporting gas, extracting it or processing it also helped to boost its use.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Today, natural gas is one of the primary sources of energy and is used for heating, electricity generation, as a raw material in the production of plastics, as a source of hydrogen in the production of nitrogen fertilisers and, to a lesser extent, as a vehicle fuel, which is cleaner and cheaper than petrol and diesel.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Natural gas has always been considered a lesser-known ‘sibling’ of oil as one of the best-known fossil fuels, but recently its importance has been growing along with the expanding possibilities for its extraction and use.<\/span><\/p>\n<h2>High volatility<\/h2>\n<p><span style=\"font-weight: 400;\">The relatively stable price of natural gas began to rise more sharply in 2021 when the world was thrown into an energy crisis following the peak of the COVID-19 pandemic and many supply chains were disrupted. This was complicated by the Russian invasion of Ukraine and the gradual reduction of Russian gas supplies to Europe, which was a major customer.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The resulting uncertainty and the need for European countries to look for other sources of gas have led to a significant rise in gas prices, with prices peaking in August this year. Gas is not easy to store and to transport, which also leads to increased purchasing costs, and the natural gas market is not as integrated as, for example, the oil market. This leads to relatively large price differences from region to region and more difficult negotiation of new contracts.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The fact that the price of gas is currently very volatile and its development is very difficult to predict is also demonstrated by the situation at the end of October, when the oversupply of gas in US ships and the lack of storage capacity led to the price of the hourly contract (which is a rather specific contract, serving only to settle the balance in one hour, but it is sufficient to illustrate the situation) at one point falling below zero.<\/span><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-539151\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/ropa-pd-nulou.jpg\" alt=\"\" width=\"2430\" height=\"1348\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/ropa-pd-nulou.jpg 2430w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/ropa-pd-nulou-300x166.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/ropa-pd-nulou-1030x571.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/ropa-pd-nulou-768x426.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/ropa-pd-nulou-1536x852.jpg 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/ropa-pd-nulou-2048x1136.jpg 2048w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/ropa-pd-nulou-1500x832.jpg 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/ropa-pd-nulou-705x391.jpg 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/ropa-pd-nulou-24x13.jpg 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/ropa-pd-nulou-36x20.jpg 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/11\/ropa-pd-nulou-48x27.jpg 48w\" sizes=\"(max-width: 2430px) 100vw, 2430px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">The situation in the natural gas market is still tense, but this may suit traders in the financial markets. Price fluctuations are an ideal opportunity for short-term trades and offer plenty of opportunities to enter the market in either direction.<\/span><\/p>\n<h2>Different benchmarks, different prices<\/h2>\n<p><span style=\"font-weight: 400;\">For natural gas, there are multiple benchmarks that vary both in price and in the units in which the commodity is traded. This is in contrast to oil, where the price of Brent and WTI as the main benchmarks are similar and both are traded in barrels. Benchmarks for natural gas are set by prices at gas hubs (virtual or physical) run by hub operators, where the  transferred ownership of the gas is already in the transmission system.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Traders at FTMO can trade natural gas through a CFD contract, the underlying asset of which is a US natural gas futures contract. These contracts are traded on the NYMEX exchange and are priced based on deliveries at the Henry Hub distribution hub in Louisiana. This hub connects 16 domestic and international pipelines that distribute gas from the fields in Louisiana, Texas and the Gulf of Mexico. The Henry Hub has been in operation since 1950, and the NYMEX began offering its products at a price tied to the hub in 1990.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Both spot and futures prices, which are derived from the Henry Hub price, are considered the official benchmark for the US natural gas market (hence the name of the US benchmark). U.S. natural gas is traded in U.S. dollars per million Btu (British thermal unit), which is an old unit of energy (now replaced by the joule) that represents approximately 1,055.056 joules (there are multiple definitions and thus different values).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">There are two basic benchmarks for the European gas market. The first is British natural gas, which contracts are traded on the Intercontinental Exchange (ICE) and are priced on the basis of trades at a trading hub called the National Balancing Point (NBP) in the United Kingdom. This was the first trading hub in Europe to trade natural gas from the prolific North Sea fields. Unlike the Henry Hub, it is a ‘virtual hub’.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Natural gas is traded here in British pence per therm unit. Again, this is the original unit of energy in the Anglo-American system, which is 100 000 Btu, or approximately 105,5 megajoules (as with Btu, there are several different values depending on the method of calculation).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The main benchmark in Europe, which has recently acquired a status similar to Brent for oil, is the Dutch TTF. It is named after the Title Transfer Facility virtual hub in the Netherlands which was established in 2009 as the main trading venue for gas trading in the Netherlands. But as trading volumes exceed the volume of gas consumed in the country by several times it has become the main gas trading venue for Europe.  Contracts are traded on the ICE exchange and are traded in euros per kilowatt hour.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Natural gas has recently become a strategic commodity and a potential tool in the power struggle between the Eastern and the Western worlds. For those who use gas as a source of energy for households or businesses, this can be a rather costly affair. However, for those who want to make a profit from gas trading, it can be an interesting opportunity that may not be repeated often.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>In recent months, natural gas has been a commodity that has significantly affected not only the financial markets, but has also indirectly affected the lives of ordinary people whose cost of living has increased. How the gas market actually works today and what influences its price is what we will look at in today’s article. [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":539215,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[89041],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/539165"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=539165"}],"version-history":[{"count":10,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/539165\/revisions"}],"predecessor-version":[{"id":539214,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/539165\/revisions\/539214"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/539215"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=539165"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=539165"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=539165"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}