{"id":540378,"date":"2022-12-02T12:55:15","date_gmt":"2022-12-02T11:55:15","guid":{"rendered":"https:\/\/ftmo.com\/?p=540378"},"modified":"2022-12-02T13:07:05","modified_gmt":"2022-12-02T12:07:05","slug":"gold-is-losing-its-luster-but-traders-still-love-it","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/gold-is-losing-its-luster-but-traders-still-love-it\/","title":{"rendered":"Gold is losing its luster, but traders still love it"},"content":{"rendered":"<p><em><span style=\"font-weight: 400;\">Gold has fascinated people for thousands of years, and at the same time it has been considered to be one of the most stable payment instruments. Although its function as a means of payment has recently declined, it is still of great interest to investors and traders in the financial markets. What makes this yellow metal so attractive?<\/span><\/em><\/p>\n<p><span style=\"font-weight: 400;\">Gold began to be used as a form of tender as early as 1,500 BC, with the first coins considered official tender minted in Lydia between 650 and 600 BC. As gold is relatively soft and malleable, the production of gold coins was quite simple, making the metal very popular as a form of currency.<\/span><\/p>\n<h2>You probably can&#8217;t pay with gold anymore<\/h2>\n<p><span style=\"font-weight: 400;\">You are unlikely to pay with gold today, but many developed countries still hold relatively large gold reserves in vaults. This is more of a relic of the past (even relatively recent) when gold worked as the best tender, and after the proliferation of paper money, most banknotes were backed by gold reserves. Today this is no longer the case and gold has long ceased to function as a payment instrument, but it is still a means of expressing power and stability.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">While it might seem that gold no longer has a future as an investment instrument today, this is not entirely true. In recent years, many people have argued that cryptocurrencies, or bitcoin, may become the new alternative to gold, but this is a lot of nonsense. It’s not so much that cryptocurrencies have suffered a great loss of credibility recently and their price is extremely volatile, but rather that gold and bitcoin have virtually nothing in common (we can write about that some other time).<\/span><\/p>\n<h2>No regular income<\/h2>\n<p><span style=\"font-weight: 400;\">Many investors have a problem with gold as an investment because of the so-called opportunity costs. Gold bears no interest. In particular, in 2011 after gold reached its peak at that time of around $1,920 per troy ounce after the financial crisis and subsequently lost almost half its value over four years, it was much disliked by investors.<\/span><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-540408\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/GoldM.png\" alt=\"\" width=\"2065\" height=\"1009\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/GoldM.png 2065w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/GoldM-300x147.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/GoldM-1030x503.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/GoldM-768x375.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/GoldM-1536x751.png 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/GoldM-2048x1001.png 2048w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/GoldM-1500x733.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/GoldM-705x344.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/GoldM-24x12.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/GoldM-36x18.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/GoldM-48x23.png 48w\" sizes=\"(max-width: 2065px) 100vw, 2065px\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Since there were few assets other than equities that yielded a regular return in the years that followed (bonds were actually miserable thanks to negative rates), the opportunity cost of gold was virtually zero and gold was once again in the crosshairs of investors.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In early 2020, the gold price broke through the psychological level of $2,000 per troy ounce threshold for the first time. After a subsequent correction, it climbed to that level again in March this year as geopolitical uncertainty and the conflict in Ukraine meant an influx of funds into safe havens, of which gold is still one. Since April, it has then seen a fairly steady decline to $1,600.<\/span><\/p>\n<h2>An unequal battle with the dollar<\/h2>\n<p><span style=\"font-weight: 400;\">Gold is considered a safe haven in times of uncertainty and rising inflation, which are the conditions we have in the markets today. At the same time, however, it is “fighting” for this position with the US dollar, or US Treasury bonds. The US Federal Reserve has raised interest rates six times this year alone to combat rising prices, which has helped the US dollar considerably, and interest rates on US government bonds have risen significantly. This has made gold more expensive for investors in other currencies and made bonds more attractive to investors.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Since November, however, gold has been appreciating again. The Fed’s rate hike cycle is expected to end in 2023, which could help gold to continue its rise over a longer period.<\/span><\/p>\n<h2>Many ways of use<\/h2>\n<p><span style=\"font-weight: 400;\">Gold, as with other minerals, is limited in quantity and its use is relatively wide, so its price may rise steadily in the long term. Probably the most widespread and traditional use of gold is in the manufacture of jewellery. In this case, it is primarily a tradition, which gives it the status of luxury and value. Gold is easy to work with and has a stable colour and lustre, so jewellery makers can constantly invent new shapes and ways of working with it. The downside is its softness, which is why jewellery is not made from the pure metal but from alloys with other metals that give it strength and durability.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Gold is also used in the electrical industry. Although it is not consumed in large quantities, its importance in semiconductor and low-current electrical engineering is crucial because of its stability and durability. It is a very good conductor and does not oxidise compared to copper or silver (which have lower resistivity), so it guarantees quality and durability in switches, connectors, solder joints, etc.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Because gold is chemically inert, non-allergenic and easy to work with, it is also used in dentistry. Here, too, alloys with other metals must be used because of their softness. In addition, its ability to increase the body’s defences is exploited, it is used in solutions to treat rheumatoid arthritis, and it helps in the treatment of lungs and larynx. The radioactive isotope of gold is used in small amounts in the treatment of certain types of cancer and also in a diagnosis as a contrast agent, and is also used in surgical instruments and life support devices that are implanted in patients.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The aerospace industry uses its conductivity. The gold film that coats instruments or spacesuits serves as a shield against infrared radiation and to maintain a constant temperature; in aircraft glass (so thin that it is translucent) it acts as a window defroster.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The malleability of gold allows the production of thin films that are applied to non-metallic objects and, in addition to protection, also have an aesthetic value, while in the case of metal objects they function as protection against corrosion.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Gold is also used in the food industry as a decoration, and in Asia it was believed in the past that gold had a beneficial effect on human health. Gold is also used in the glass industry in the production of red ruby, and in the photographic industry it is used in the colouring of certain tones of paint.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Despite all its drawbacks, gold certainly has a place in the portfolio of long-term investors who want to add an asset with interesting potential and low correlation with traditional investment instruments. For short-term traders, it also represents a great opportunity to participate in market movements that can be sensitive to geopolitical changes. FTMO Traders have access to gold through CFD contracts, even in pairs with several different world currencies. And the fact that this tool certainly makes sense in our offering is proven by the fact that it has long been one of the most popular tools among our traders.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Gold has fascinated people for thousands of years, and at the same time it has been considered to be one of the most stable payment instruments. Although its function as a means of payment has recently declined, it is still of great interest to investors and traders in the financial markets. What makes this yellow [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":540450,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[89041],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/540378"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=540378"}],"version-history":[{"count":9,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/540378\/revisions"}],"predecessor-version":[{"id":540473,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/540378\/revisions\/540473"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/540450"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=540378"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=540378"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=540378"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}