{"id":540699,"date":"2022-12-07T12:30:58","date_gmt":"2022-12-07T11:30:58","guid":{"rendered":"https:\/\/ftmo.com\/?p=540699"},"modified":"2023-01-31T10:52:01","modified_gmt":"2023-01-31T09:52:01","slug":"revenge-trading-will-only-make-things-worse","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/revenge-trading-will-only-make-things-worse\/","title":{"rendered":"&#8220;Revenge trading will only make things worse&#8221;"},"content":{"rendered":"<p><em><span style=\"font-weight: 400;\">Every trader knows what it’s like to experience a series of losses. Trying to make up for these losses as quickly as possible can lead to revenge trading, which often results in more losses and, in the worst case, in losing a trading account. Our FTMO traders Jan, Sergey, Denny and Ignacio definitely know something about this.<\/span><\/em><\/p>\n<h3>Trader Jan: &#8220;If I strictly follow my plan, I can trade profitably without being stressed out.&#8221;<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-540710\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Jan-1-280x300.jpg\" alt=\"\" width=\"280\" height=\"300\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Jan-1-280x300.jpg 280w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Jan-1-22x24.jpg 22w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Jan-1-34x36.jpg 34w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Jan-1-45x48.jpg 45w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Jan-1.jpg 374w\" sizes=\"(max-width: 280px) 100vw, 280px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p><strong>What was more difficult than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">Since I did multiple attempts on your Evaluation Process in recent months to learn my weaknesses and develop my system (an approach to it) I was pretty confident that I can do it with relative ease even if I got myself into some drawdown. The only problem was to be able to be in front of my charts.<\/span><\/p>\n<p><strong>What was the hardest obstacle on your trading journey?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">It was definitely my busy life schedule. I’m not very much of a swing trader personality and I like to manage my trades well, at least in the first few minutes\/hours, depending on the move I anticipate because I want to be able to minimize losses and control myself. In today&#8217;s volatility it´s absolutely needed.<\/span><\/p>\n<p><strong>What do you think is the most important characteristic\/attribute to become a profitable trader?<\/strong><\/p>\n<p>Self-mastery.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-540746 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Jan-trades.png\" alt=\"\" width=\"911\" height=\"1212\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Jan-trades.png 911w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Jan-trades-225x300.png 225w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Jan-trades-774x1030.png 774w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Jan-trades-768x1022.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Jan-trades-530x705.png 530w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Jan-trades-18x24.png 18w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Jan-trades-27x36.png 27w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Jan-trades-36x48.png 36w\" sizes=\"(max-width: 911px) 100vw, 911px\" \/><\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">It was hard sometimes to manage myself well because I did engage some of the trades from my mobile phone while driving or working. Which I’m not proud of, but these trades were planned days before I just waited for alerts and time. It´s not easy when you patiently wait to trade and then you cannot engage because you are in a place where the signal is low or you are driving home lately because of some circumstances that you cannot control, and you are running out of time in Challenge. But that´s life and I was aware of my emotions and thoughts and calmed myself down and finished the Evaluation Process.<\/span><\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">A lot. Now I know that if I strictly follow my plan and stay disciplined and be aware of my thoughts, emotions, actions, behaviours, etc. I can trade profitably without being stressed out and that’s my goal.<\/span><\/p>\n<p><strong>One piece of advice for people starting the Challenge now.<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">I will quote my mentor because that quote contains everything that one needs to know to finish the Challenge. „Firstly, you must understand yourself, secondly you have to have a sound understanding of the market. After that, one who is patient, organized, not prone to impulsiveness, understands that losing is part of it, trusts their model, even if it might not be followed correctly by them or that it gets it incorrect from time to time. Finally, one who does not overleverage, overtrade, or forget to take partials along the way. One who finds contentment in „enough “. Consistency will overtake the one who does this. If this is you, you got it.“<\/span><\/p>\n<h3>Trader Sergey: &#8220;Discipline which leads to consistency is the most powerful trading habit.&#8221;<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-540717\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-139x300.jpg\" alt=\"\" width=\"139\" height=\"300\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-139x300.jpg 139w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-476x1030.jpg 476w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-326x705.jpg 326w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-11x24.jpg 11w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-17x36.jpg 17w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-22x48.jpg 22w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey.jpg 591w\" sizes=\"(max-width: 139px) 100vw, 139px\" \/><\/p>\n<p><strong>What was easier than expected during the FTMO Challenge or Verification?<\/strong><\/p>\n<p>With the new updates to the Challenge regarding the 2-week extension, if you reach the 5% target at the end of the allocated time period, it is really helpful and allows you to stick to your trading plan without rushing into trades to achieve the objectives!<\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>At the beginning of a Challenge or Verification period, my focus tends to slip up, however, after a few days I begin to regain my focus and stick to my trading plan which has allowed me to pass both the Challenge and the Verification stages with a decent, positive curve. It&#8217;s important to be self-aware and realize when you&#8217;re not trading at your best, take some time off and stabilize your mindset. The biggest account killer is big losses, it&#8217;s vital not lose your head if you start off bad and attempt to revenge your trade as it will only make things worse.<\/p>\n<p><strong>How would you rate your experience with FTMO?<\/strong><\/p>\n<p>Positive and fair. The support team has been very helpful with any questions which I had and were always available for help, even over the weekends. The rules are clearly outlined before you take the Challenge, so it’s only up to you to trade to your best ability and follow the said rules.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-540753 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-trades.png\" alt=\"\" width=\"909\" height=\"1211\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-trades.png 909w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-trades-225x300.png 225w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-trades-773x1030.png 773w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-trades-768x1023.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-trades-529x705.png 529w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-trades-18x24.png 18w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-trades-27x36.png 27w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Sergey-trades-36x48.png 36w\" sizes=\"(max-width: 909px) 100vw, 909px\" \/><\/p>\n<p><strong>What do you think is the most important characteristic\/attribute to become a profitable trader?<\/strong><\/p>\n<p>Discipline which leads to consistency is the most powerful trading habit which you can acquire as a trader. Consistency in following your trading plan, consistency in getting out where you planned on doing and consistency in closing your position where you originally set your SL without moving it.<\/p>\n<p><strong>What do you think is the key for long-term success in trading?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">Having a Max Daily Loss and Profit Target objectives are key in the long-term success when it comes to trading. If you have a Max Daily Loss, it prevents you from blowing your whole account in one day and allows you to stay in the game. In addition, by having a Max Daily Loss, you can limit yourself. It makes you carefully select what trades you’re likely to enter during the day because without it, you can lose your head and keep on revenging trading which ultimately will blow your whole account very quickly. Likewise with a Profit Target, it allows you to step away from the market and enjoy the rest of your day doing something else knowing you have secured profit for the day. Otherwise, I’ve seen many traders start off the day with a nice return but end up giving it back to the markets by overtrading and chasing for more. Resulting in what could have been a good day at the office, turns into a bad day at the office, ultimately affecting your psychology in the long-term for the worse. Having a positive risk to reward ratio is also very important to your longevity. Having repetitive loss days is fine and knowing that your strategy produces a positive risk to reward ratio overtime, gives you the confidence to know that you can overcome the drawdown period and come out on top.<\/span><\/p>\n<p><strong>One piece of advice for people starting the FTMO Challenge now.<\/strong><\/p>\n<p>My advice would be to firstly have a solid trading plan that you know will make you money over a certain period of time. Secondly, I would recommend taking the trial of the FTMO Challenge to get accustomed to the rules of the Challenge. Lastly, if you don&#8217;t end up passing the Challenge, it&#8217;s important to go back to the drawing board and figure out what went wrong and make amendments without rushing into purchasing a new Challenge straight away. Journaling will help you a lot in this department, as you can go back and evaluate your performance overtime and see what could be improved for your next attempt.<\/p>\n<h3>Trader Denny: &#8220;Trading inspires me as I am alone responsible for my success.&#8221;<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-540724\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-300x225.jpg\" alt=\"\" width=\"300\" height=\"225\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-300x225.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-1030x773.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-768x576.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-1536x1152.jpg 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-2048x1536.jpg 2048w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-1500x1125.jpg 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-705x529.jpg 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-24x18.jpg 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-36x27.jpg 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-48x36.jpg 48w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/p>\n<p><strong>What was the most difficult during your FTMO Challenge or Verification and how did you overcome it?<\/strong><\/p>\n<p>The most difficult part was the increased volatility during the start of the war in Ukraine. The market was very emotional and not easy to trade. On top of that, my position size was too big at that time as it reflected almost 2% risk. Once I reduced the position size to a healthy 1% of the initial balance, I could hold positions longer and with less fear. As a consequence, the performance advanced and I could accomplish the Verification.<\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>Trading inspires me as I am alone responsible for my success. I still have a lot of things to improve in my trading and this drives me as I want to become a consistent profitable trader.<\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>I do not have an exact trading plan as I use the Market Profile in order to see opportunities which provide high odds of successful trades. The Market Profile organizes the data from the market in an informational graphic which helps to identify good trade locations. The Market Profile helps me to understand a price movement whether an old opportunity is liquidated or a new opportunity comes into the market. This is very helpful to know when new opportunities develop.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-540760\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-trades.png\" alt=\"\" width=\"912\" height=\"1233\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-trades.png 912w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-trades-222x300.png 222w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-trades-762x1030.png 762w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-trades-768x1038.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-trades-521x705.png 521w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-trades-18x24.png 18w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-trades-27x36.png 27w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Denny-trades-36x48.png 36w\" sizes=\"(max-width: 912px) 100vw, 912px\" \/><\/p>\n<p><strong>What does your risk management plan look like?<\/strong><\/p>\n<p>My risk management is 1% per trade of the initial balance. I am trading the German DAX40 and US500 which both do not provide too many opportunities per day for my trading approach. Thus, the daily loss limit set by FTMO does not worry me too much by following the 1% risk per trade.<\/p>\n<p><strong>How would you rate your experience with FTMO?<\/strong><\/p>\n<p>My experience with FTMO is great. It took me 6 months from starting the Challenge to accomplish the Verification. I am very grateful that I could repeat some Challenges. During this time, I could advance as a trader and got a good feeling what it means to be a trader who earns money only through trading.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>The market is different every day and does not provide the same number of opportunities every week. In some weeks I was losing money and I thought “oh my God” I won’t make it to accomplish the Challenge. But then the next week provided excellent opportunities and I came closer to the trading objective. Try to be calm and follow your trading approach. No sooner said than done!<\/p>\n<h3>Trader Ignacio: &#8220;When I enter a trade, I have already accepted the risk.&#8221;<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-540731\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-196x300.jpeg\" alt=\"\" width=\"196\" height=\"300\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-196x300.jpeg 196w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-673x1030.jpeg 673w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-460x705.jpeg 460w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-16x24.jpeg 16w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-24x36.jpeg 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-31x48.jpeg 31w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio.jpeg 764w\" sizes=\"(max-width: 196px) 100vw, 196px\" \/><\/p>\n<p><strong>What was easier than expected during the FTMO Challenge or Verification?<\/strong><\/p>\n<p>Verification was evidently easier psychologically. I got off to a great start in the Verification and proceeded to only look for high profitable conservative setups, while only risking 1.3% a day.<\/p>\n<p><strong>How did you manage your emotions when you were in a losing trade?<\/strong><\/p>\n<p>It’s a plan which gives you a psychological breathing room. When I enter a trade, I have already accepted the risk, for this reason a loss which follows the plan is seen as a win in my psychology. I have rule-based setups when in drawdown, the less emotions are the best approach.<\/p>\n<p><strong>What does your risk management plan look like?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">I mainly trade GBPJPY, in which I risk a maximum of 12.4 pip as a stop loss. Once I enter the trade, I always look for the key 5 minutes or 15 minutes break of structure (if the time frame is higher it is even better). My plan is to manage risk at 8 pips. I close 80% of my positions and let the rest run to 12.4 pips. If there is a key break of structure at 8-10 pips, I will close the whole position. Ideally, I risk 1.3% per trade, in the worst case scenario 1.5%. The strategy relies on a high win rate, but even with a 50%-win rate I’ll still be in profit. The secondary pair that I’m studying and building confidence with is AUDJPY, which follows the same plan as GBPJPY. The third pair I trade is Gold, but rarely only high, really high confluence setups. The risk management in Gold is set to be half the risk compared to GBPJPY for a max Stop Loss of 25 pips risking 1.3-1.5% as well.<\/span><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-540767\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-trades.png\" alt=\"\" width=\"911\" height=\"1224\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-trades.png 911w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-trades-223x300.png 223w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-trades-767x1030.png 767w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-trades-768x1032.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-trades-525x705.png 525w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-trades-18x24.png 18w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-trades-27x36.png 27w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/12\/Ignacio-trades-36x48.png 36w\" sizes=\"(max-width: 911px) 100vw, 911px\" \/><\/p>\n<p><strong>What do you think is the key to long-term success in trading?<\/strong><\/p>\n<p>Consistency, repetition, and believing in your psychological learning curve are the main keys I focus on for long-term success. It’s not to look at riskier setups you may have missed that are 1\/10, if not the ones you can repeat for a profitable outcome long-term.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>A plan that is analytically based on high confluence setups and psychologically based on consistency and emotionless repetition.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>I would highly recommend focusing on your own personal path. Not wasting your time and weakening your psychology by paying attention to other people&#8217;s success on Instagram or depending on signals. Always aim for long-term success.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every trader knows what it’s like to experience a series of losses. Trying to make up for these losses as quickly as possible can lead to revenge trading, which often results in more losses and, in the worst case, in losing a trading account. Our FTMO traders Jan, Sergey, Denny and Ignacio definitely know something [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":540782,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[672],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/540699"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=540699"}],"version-history":[{"count":10,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/540699\/revisions"}],"predecessor-version":[{"id":540701,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/540699\/revisions\/540701"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/540782"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=540699"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=540699"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=540699"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}