{"id":541114,"date":"2022-12-16T08:36:10","date_gmt":"2022-12-16T07:36:10","guid":{"rendered":"https:\/\/ftmo.com\/?p=541114"},"modified":"2022-12-16T12:11:10","modified_gmt":"2022-12-16T11:11:10","slug":"why-bitcoin-will-probably-never-replace-gold","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/why-bitcoin-will-probably-never-replace-gold\/","title":{"rendered":"Why bitcoin will probably never replace gold"},"content":{"rendered":"<p><em>Although many cryptocurrency proponents try to claim that bitcoin is a new alternative to gold as a long-term store of value, this claim rests on feet of clay. Gold and bitcoin don&#8217;t have much in common, and today&#8217;s developments in the cryptocurrency markets only prove it.<\/em><\/p>\n<p>While in this article we could have compared gold with other cryptocurrencies, there are too many cryptocurrencies and their use is so overwhelmingly scarce that we have decided to concentrate on bitcoin, the largest and most traditional representative of the group. Comparing gold as a traditional store of value, which people have used as a means of payment and a safe haven for hundreds of years, with cryptocurrencies, or bitcoin, falls short in several ways.<\/p>\n<h2>Tradition<\/h2>\n<p>Although gold has fallen out of favour with investors many times, its position is still quite strong and has remained unchanged for a long time. We wrote about the reasons why gold is a good long-term store of value in our recent article. In any case, gold has a long history and the changing political or economic conditions, and even technological advances, don&#8217;t seem to hurt its status in the long run.<\/p>\n<p>On the other hand, bitcoin has been around for a relatively short time, since 2009. Interestingly, gold&#8217;s importance declined quite significantly in the 1970s, when the gold standard finally ended, leading to the emergence of fiat currencies, and bitcoin is just supposed to be an independent alternative. Today, bitcoin shares many characteristics with the gold standard (independence from governments, lower consumption and possible deflationary behaviour) and perhaps that is why it is often compared to gold and known as the successor to gold. However, its history is relatively short and it has not yet demonstrated its usefulness as a store of value.<\/p>\n<h2>Utilisation and volatility<\/h2>\n<p>Due to its physical properties, gold has a relatively wide range of applications across a variety of industries. This provides it with sustained demand and, combined with its limited quantity as a mineral, its price should not significantly fall in the long term.<\/p>\n<p>The usability of bitcoin is quite problematic, although the total number of bitcoins is also limited (the total number of bitcoins should be 21,000,000, with around 1,750,000 bitcoins currently left to be mined, with the last one due to be mined in 2140). It is more likely to be used as an alternative to conventional currencies and as a means of payment by enthusiasts and fans of new technologies. However, many people use it as an alternative investment asset, the biggest advantage of which is its low correlation with other traditional assets (similar to gold).<\/p>\n<p>The problem lies in the price of bitcoin, which is very volatile, which is not suitable for either a currency or an investment. Paradoxically, when the price of bitcoin rapidly rises, no one will use it as a currency because its owners expect further appreciation and it is not worth buying something with it. When its price falls, interest in bitcoin as an investment asset also falls.<\/p>\n<h2>Security<\/h2>\n<p>One of the biggest advantages of bitcoin is considered to be the spread of the blockchain technology on which bitcoin is built. This technology, which can act as a decentralised ledger for digital financial transactions, has the potential to penetrate many other aspects of life beyond banking, but so far it has not done it. Moreover, due to the high demand for bitcoin, many transactions are carried out outside of the blockchain network. These transactions aim to bypass the limitations of the blockchain, but at the same time security and verifiability are reduced, giving room to various fraudsters.<\/p>\n<p>Fraud and related cryptocurrency exchange crashes have been a long-standing problem in the cryptocurrency market. In 2022 alone, first there was the collapse of the Terra ecosystem, and then, in November, the collapse of one of the largest crypto exchanges, FTX, led to cryptocurrency holders losing billions of dollars.<\/p>\n<p>Gold is an established commodity that is available through different channels in different forms and its availability is not affected by technology. The gold market is regulated and gold can only be sold by registered traders. On the one hand, this can act as a constraint, but on the other hand it increases its security and significantly reduces the possibility of fraud.<\/p>\n<h2>Liquidity<\/h2>\n<p>Bitcoin is certainly a more liquid asset in the world with good internet access. It&#8217;s easier to send a few bitcoins to any location in the world with only one click on a keyboard or on a mobile phone than to fumble around with bars of gold. Although, for larger transactions, there may already be a problem with some exchanges having a set daily limit, limiting the amount of funds you can withdraw. However, for lower amounts, this may not be a problem.<\/p>\n<p>Nevertheless, in areas without internet access or in areas where power is an issue, the situation is different. Physical gold is also available where there is a problem with the access to the net, which is definitely beneficial at a time when power shortages and blackouts are becoming more frequent. In this context, we look back on the time when bitcoin mining consumed more energy than the whole of Argentina in 2021.<\/p>\n<p>Although this article sounds negative towards bitcoin at first glance, it is true that among investors and speculators, bitcoin is still a popular asset that offers plenty of interesting opportunities due to its price movements. In addition to bitcoin, FTMO offers 9 other cryptocurrencies for trading such as Ethereum, Cardano, Litecoin, Ripple, Monero, etc. One of the big advantages is that we charge zero in commission on these instruments.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Although many cryptocurrency proponents try to claim that bitcoin is a new alternative to gold as a long-term store of value, this claim rests on feet of clay. Gold and bitcoin don&#8217;t have much in common, and today&#8217;s developments in the cryptocurrency markets only prove it. While in this article we could have compared gold [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":541168,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[89041],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/541114"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=541114"}],"version-history":[{"count":12,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/541114\/revisions"}],"predecessor-version":[{"id":544230,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/541114\/revisions\/544230"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/541168"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=541114"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=541114"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=541114"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}