{"id":541969,"date":"2023-01-06T13:30:19","date_gmt":"2023-01-06T12:30:19","guid":{"rendered":"https:\/\/ftmo.com\/?p=541969"},"modified":"2023-02-14T16:36:40","modified_gmt":"2023-02-14T15:36:40","slug":"what-to-prepare-for-in-2023","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/what-to-prepare-for-in-2023\/","title":{"rendered":"What to prepare for in 2023"},"content":{"rendered":"<p><em><span style=\"font-weight: 400;\">Making predictions for the whole year is still associated with an uncertain outcome, because nobody can predict the future. Moreover, this year is special because what is happening in the markets is quite strongly influenced by factors that most investors and analysts are not used to. So what should we prepare for this year?<\/span><\/em><\/p>\n<p><span style=\"font-weight: 400;\">The turn of the year is the ideal time to take an inventory of the past year and make predictions for the next one. This year, the possibility of some more accurate estimates is even more difficult than ever, but even this does not deter some analysts from making optimistic predictions. However, optimism is not always a good starting point for making short- or long-term forecasts in financial markets, and this year’s greater uncertainty could lead to more sober predictions for the next year.<\/span><\/p>\n<h2>Beware of analysts<\/h2>\n<p>First and foremost, we should remember that market events are quite strongly influenced by expectations. However, defining our expectations according to analysts&#8217; forecasts is one of the biggest mistakes we could make. We do not have to go far to find an example of when optimism has significantly influenced analysts&#8217; forecasts, just to the beginning of last year. After almost two years of strong growth in equities following the Covid pandemic, more growth was expected (how else). However, the S&amp;P 500 index has been declining practically since the beginning of the year, posting its worst drop since the financial crisis.<\/p>\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Here’s where the sharpest brains on Wall Street predicted the S&amp;P 500 would end 2022:<\/p>\n<p>BMO &#8211; 5,300<br \/>\nWells Fargo &#8211; 5,200<br \/>\nGoldman Sachs &#8211; 5,100<br \/>\nJP Morgan &#8211; 5,050<\/p>\n<p>Today it’s 3,854 &#8211; not one of them came close.<\/p>\n<p>Pay zero attention to next year’s predictions.<\/p>\n<p>No one’s got a clue.<\/p>\n<p>— Alan Smith (@AlanJLSmith) <a href=\"https:\/\/twitter.com\/AlanJLSmith\/status\/1608757345076527104?ref_src=twsrc%5Etfw\">December 30, 2022<\/a><\/p><\/blockquote>\n<p><script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/p>\n<p>Even at the end of 2022, most analysts expect the stock markets to rise for another year, some of whom are truly incorrigible optimists.<\/p>\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">After missing big last year (-22%), Wall Street&#8217;s &#8220;Top Strategists&#8221; are back again and have given their outlook for 2023. Do you agree?<\/p>\n<p>What&#8217;s your S&amp;P 500 prediction this year?<a href=\"https:\/\/twitter.com\/search?q=%24SPY&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$SPY<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/SP500?src=hash&amp;ref_src=twsrc%5Etfw\">#SP500<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/Stocks?src=hash&amp;ref_src=twsrc%5Etfw\">#Stocks<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/Investing?src=hash&amp;ref_src=twsrc%5Etfw\">#Investing<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/StockMarket?src=hash&amp;ref_src=twsrc%5Etfw\">#StockMarket<\/a> <a href=\"https:\/\/t.co\/eSbK8EfaxO\">pic.twitter.com\/eSbK8EfaxO<\/a><\/p>\n<p>— 📈 SA Justin 📈 (@JGInvestments1) <a href=\"https:\/\/twitter.com\/JGInvestments1\/status\/1610848567375044610?ref_src=twsrc%5Etfw\">January 5, 2023<\/a><\/p><\/blockquote>\n<p><script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/p>\n<h2>Inflation<\/h2>\n<p>Perhaps the biggest bogeyman that scares not only economists and investors but also ordinary people is high inflation. Last year, most central banks had to tighten monetary policy at a pace long unprecedented in the fight against inflation. At the end of the year so far, inflation seems to have peaked in most developed economies over the past year. Cautious optimism may be in order in this regard, but central bankers themselves are warning that the war on inflation may not yet be over.<\/p>\n<h2>Interest rates<\/h2>\n<p>A large part of market participants today automatically expect a slowdown in monetary tightening by central banks, but this might not turn out well. Easing too quickly could frustrate efforts to achieve price stability.<\/p>\n<h2>Recession<\/h2>\n<p>Central bankers are now facing the dilemma of whether to fight inflation at all costs and raise rates, which could lead to a recession, which has also been talked about for some time. There are voices saying that this year&#8217;s recession has been predicted and expected for a long time, so we may not see one after all, but that may be wishful thinking on the part of optimists. In fact, the US has already had two consecutive quarters of negative GDP growth, so technically it has already been in a recession.<\/p>\n<h2>Labour market<\/h2>\n<p>The labour market has been going a bit against the tide for a long time now. It is still showing relatively strong figures above analysts&#8217; expectations, both in the number of job vacancies, which are still relatively high, and in the number of unemployment claims, which are still relatively low. This also complicates the situation for central bankers, who are still unsure whether inflation has not yet had its last word or whether the strong labour market data is a temporary phenomenon.<\/p>\n<h2>China<\/h2>\n<p>The development in China may also be a big unknown this year. The country may be ending its zero-tolerance policy towards Covid-19 disease, but this does not necessarily mean that the country&#8217;s economy will recover quickly and that this will have an immediate positive impact globally. China has many challenges ahead and the beginning of the year in particular will be marked more by chaos than economic growth. The fact that the country&#8217;s government has ended its zero-tolerance policy towards Covid so suddenly shows that the country is not well prepared to deal with Covid definitively. Unless major and long-delayed structural reforms can finally be initiated, developments in the world&#8217;s second-strongest economy could be disappointing.<\/p>\n<h2>War in Ukraine<\/h2>\n<p>The war in Ukraine, the end of which is still rather elusive, will continue to have a significant impact on economic developments in the world. In addition to being a humanitarian disaster, the war is having an impact on commodity markets in particular. The agricultural commodities market is the most affected, but the sanctions against Russia are also having an impact on the oil market and, in particular, on the natural gas market, the price of which may be more volatile than normal over the next year.<\/p>\n<p>No matter how responsibly we prepare for the new year and try to include all more or less probable scenarios in our predictions, we have to expect that something will appear during the year that no one has counted on. However, it is still true that if an investor or trader is prepared for everything and is mentally resilient, they can handle even the biggest surprises unscathed. The important rules of capital protection and risk management work in all conditions, and we must not forget that.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Making predictions for the whole year is still associated with an uncertain outcome, because nobody can predict the future. Moreover, this year is special because what is happening in the markets is quite strongly influenced by factors that most investors and analysts are not used to. So what should we prepare for this year? The [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":542058,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/541969"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=541969"}],"version-history":[{"count":12,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/541969\/revisions"}],"predecessor-version":[{"id":544194,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/541969\/revisions\/544194"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/542058"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=541969"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=541969"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=541969"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}