{"id":542175,"date":"2023-01-13T14:30:11","date_gmt":"2023-01-13T13:30:11","guid":{"rendered":"https:\/\/ftmo.com\/?p=542175"},"modified":"2023-08-14T08:24:37","modified_gmt":"2023-08-14T06:24:37","slug":"the-wyckoff-theory-and-its-application-in-trading","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/the-wyckoff-theory-and-its-application-in-trading\/","title":{"rendered":"The Wyckoff theory and its application in trading"},"content":{"rendered":"<p>Have you ever looked at the charts and thought to yourself that there are patterns or cycles that keep repeating themselves but you find it hard to decipher them? Have you ever found yourself searching for an entry but you were unsure due to your biases? In this article, we will discuss the Wyckoff theory which will introduce you to the concept of viewing the charts and determining the current phase of the market.<\/p>\n<h2><span lang=\"CS\">History<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Richard Demille Wyckoff was considered one of the five main pioneers of technical analysis and the technical approach to studying the stock market in the early 20th century. He got in touch with the industry at a very young age and by the time he was in his 20s, he already became head of his own firm. He was also a founder of The Magazine of Wall Street and throughout the years, his efforts escalated in teaching the public about the concepts of smart money and his perceptions of the rules in trading. <\/span><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-542182\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-1.png\" alt=\"\" width=\"225\" height=\"225\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-1.png 225w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-1-80x80.png 80w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-1-36x36.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-1-180x180.png 180w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-1-24x24.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-1-48x48.png 48w\" sizes=\"(max-width: 225px) 100vw, 225px\" \/><\/p>\n<p>This article offers a summary of Wyckoff&#8217;s theoretical and practical approaches to the markets, along with tips on how to spot trade ideas and execute long and short positions, analyze trading ranges of accumulation and distribution, and use Point and Figure charts to pinpoint price targets.<\/p>\n<h2>Wyckoff Price Cycle<\/h2>\n<p>Wyckoff claims that by thoroughly analyzing supply and demand, which can be determined by the price action, volume, and time, the market may be understood and anticipated. He was able to determine the future intentions of those powerful interests by studying the behavior of highly successful individuals and groups that dominated particular issues because of the access to information he had as a broker. He did this by using what he called vertical (bar) and figure (Point and Figure) charts, however, nowadays thanks to advanced technology, we can enjoy the luxury of the Japanese candlestick chart that can portrays the same information as on the Point and Figure charts. The image below shows an ideal scheme of how he imagined the big interests planning and carrying out bull and bear markets.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-542189\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-2.png\" alt=\"\" width=\"602\" height=\"360\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-2.png 602w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-2-300x179.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-2-24x14.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-2-36x22.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-2-48x29.png 48w\" sizes=\"(max-width: 602px) 100vw, 602px\" \/><\/p>\n<h2>Three Wyckoff Laws<\/h2>\n<p>Wyckoff&#8217;s chart-based methodology is built on three core &#8220;rules&#8221; that have an impact on a variety of analysis-related factors. These include identifying the current and potential future directional bias of the market and individual stocks, choosing the best stocks to trade long or short, determining whether a stock is ready to exit a determined trading range, and extrapolating price targets in a trend from a stock&#8217;s trading range behavior. These laws guide the evaluation of each chart and the choice of each stock for trading.<\/p>\n<ol>\n<li><strong>The direction of prices is determined by the law of supply and demand.<\/strong> The foundation of Wyckoff&#8217;s approach to trading and investing is based on this idea. Prices increase when demand exceeds supply, and they decrease when supply exceeds demand. By comparing price and volume bars over time, the trader or analyst can examine how supply and demand are balanced. Although this law appears straightforward, it takes a lot of effort to accurately assess supply and demand on bar charts and comprehend the ramifications of supply and demand patterns.<\/li>\n<li><strong>The law of cause and effect<\/strong> aids traders and investors in setting price objectives by estimating the possible size of a trend that could emerge from a trading range. In a Point and Figure chart, the horizontal point count represents Wyckoff&#8217;s &#8220;cause,&#8221; and the price movements that match to the point count represent the &#8220;effect.&#8221; The force of accumulation or distribution inside a trading range, as well as how this force manifests itself in a following trend or movement up or down, can be regarded as the functioning of this law. A cause&#8217;s impact can be estimated and measured using point and figure charts. (For an example of this rule, see &#8220;Point and Figure Count Guide&#8221; below.)<\/li>\n<li><strong>The law of effort versus result<\/strong> gives an early indication of a potential trend change that could occur soon. Divergences between price and volume can indicate a shift in the trend of a price. After a significant rally, for instance, if there are numerous high-volume (great effort) but narrow-range price bars, with the price failing to reach a new high (little or no result), this could indicate that big interests are selling shares in preparation for a trend change.<\/li>\n<\/ol>\n<h2>A Five-Step Approach to the Market<\/h2>\n<p>While selecting an entry or an instrument to trade, the method suggested by R. Wyckoff can be summarized in this five-step approach. Although the approaches were mainly applied in the stock market, they can be applied to any market that involves institutional traders.<\/p>\n<ol>\n<li>Determine the current state of the market and its possible future trend.<\/li>\n<li>Select instruments in harmony with the trend.<\/li>\n<li>Select instruments with a “cause” that equals or exceeds your minimum objective.<\/li>\n<li>Determine the markets’ readiness to move.<\/li>\n<li>Time your commitment with a turn in the stock market index.<\/li>\n<\/ol>\n<h2>Analyses of Trading Ranges<\/h2>\n<p>Increasing market timing when taking a position in advance of a move where there is a good reward\/risk ratio is one goal of the Wyckoff approach. Trading ranges (TRs) are areas where the prior trend (up or down) has stopped and where supply and demand are relatively equal. Institutions and other powerful professional groups gather (or distribute) shares within the TR as they get ready for their subsequent bullish (or bearish) campaigns. “The Composite Man” actively buys and sells in both accumulation and distribution TRs, with the difference being that in accumulation, the number of shares bought exceeds the number of shares sold, whilst in distribution, the opposite is true.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-543692 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Blog-banner-Challenge-1.jpg\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Blog-banner-Challenge-1.jpg 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Blog-banner-Challenge-1-300x49.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Blog-banner-Challenge-1-768x125.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Blog-banner-Challenge-1-705x115.jpg 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Blog-banner-Challenge-1-24x4.jpg 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Blog-banner-Challenge-1-36x6.jpg 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Blog-banner-Challenge-1-48x8.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h2>“The Composite Man”<\/h2>\n<p><span style=\"font-weight: 400;\">According to Wyckoff, he mentioned in his theories “The Composite Man” as <\/span><\/p>\n<p><i><span style=\"font-weight: 400;\">“…all the fluctuations in the market and in all the various stocks should be studied as if they were the result of one man’s operations. Let us call him the Composite Man, who, in theory, sits behind the scenes and manipulates the stocks to your disadvantage if you do not understand the game as he plays it; and to your great profit if you do understand it.” <\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">In other words, traders shall view the price movements in the markets as a result of actions of one individual and advised further to try to approach the markets the same as the composite man as he is the one who carefully plans, execute and reflects his actions.<\/span><\/p>\n<h2>Accumulation: Events &amp; Phases<\/h2>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-542196\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-3.png\" alt=\"\" width=\"602\" height=\"361\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-3.png 602w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-3-300x180.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-3-24x14.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-3-36x22.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-3-48x29.png 48w\" sizes=\"(max-width: 602px) 100vw, 602px\" \/><\/p>\n<p><strong>PS stands for preliminary support<\/strong>, where after an extended downward trend, significant buying starts to provide significant support. The price spread widens and volume rises, indicating that the downtrend may be coming to a finish.<\/p>\n<p><strong>SC stands for selling climax<\/strong>, the point at or close to which substantial or panicked public selling is being absorbed by greater professional interests at or near the bottom. This is the point at which widening spread and selling pressure typically peak. In the SC, the price will frequently close considerably off the low in order to reflect the major interests&#8217; buying.<\/p>\n<p><strong>AR stands for an automatic rally<\/strong>, which happens as a result of heavy selling pressure. Prices are easily driven higher by a surge of purchasing, and this is further exacerbated by short covering. This rally&#8217;s high will aid in defining the top limit of an accumulation TR.<\/p>\n<p><strong>ST stands for the secondary test<\/strong>, in which the price returns to the SC region to evaluate the supply\/demand equilibrium at these levels. As the market gets closer to support in the vicinity of the SC, volume and price spread should dramatically narrow if a bottom is to be confirmed. Multiple STs are frequent after an SC.<\/p>\n<p><strong>Test:<\/strong> Throughout a TR (such as STs and springs) and at crucial junctures throughout a price increase, large operators consistently conduct supply tests. When significant supply shows up on a test, the market is frequently not ready for a markup. A test or tests are frequently conducted after a spring; a successful test (signifying that additional price rises will follow) typically results in a higher low on lower volume.<\/p>\n<p><strong>SOS stands for the sign of strength<\/strong> which is defined as an increase in price accompanied by a widening spread and comparatively higher volume. The SOS frequently occurs following a spring, supporting the analyst&#8217;s analysis of that earlier move.<\/p>\n<p><strong>LPS stands for the last point of support<\/strong>, which is the bottom of a response or pullback following an SOS. Backing up to an LPS entails a reversal to support from resistance with a smaller spread and volume. Despite the seeming singular precision of this phrase, there may be multiple LPSs on various charts.<\/p>\n<p><strong>BU stands for back-up.<\/strong> This phrase is a shortened version of a vivid metaphor that Robert Evans, a pioneering Wyckoff method instructor from the 1930s to the 1960s, coined. Evans compared the SOS to a &#8220;leap across the creek&#8221; of price resistance, and the &#8220;back up to the creek&#8221; signified both a test for further supply around the area of resistance and a short-term profit-taking strategy. A back-up is a typical structural component that comes before a more significant price markup. It can be a simple retreat or a new TR at a higher level.<\/p>\n<p><strong>Springs or shakeouts<\/strong> typically happen late in a TR and give the stock&#8217;s leading players the opportunity to do a thorough assessment of the supply before a markup campaign commences. A &#8220;spring&#8221; occurs when the price moves below the TR&#8217;s low and then turns around to close within it. This activity enables powerful interests to deceive the public about the direction of the future trend and to buy more shares at a discount.<\/p>\n<p>The ability to foresee and accurately assess the direction and magnitude of the move from a TR is essential for a Wyckoff analyst to succeed. Wyckoff, fortunately, provides tested instructions for locating and defining the phases and events inside a TR, which in turn provide as the foundation for calculating price goals in the following trend. The following four schematics exemplify these ideas: two show typical variations of accumulation TRs, followed by two instances of distribution TRs.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-542203\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-4.png\" alt=\"\" width=\"602\" height=\"360\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-4.png 602w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-4-300x179.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-4-24x14.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-4-36x22.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-4-48x29.png 48w\" sizes=\"(max-width: 602px) 100vw, 602px\" \/><\/p>\n<p><strong>Phase A<\/strong> signifies the end of the previous downward trend. Supply has dominated up until this time. Preliminary support (PS) and a selling climax are indicators of the impending reduction in supply (SC). On bar charts, where increasing spread and high volume show the transfer of enormous numbers of shares from the public to powerful professional interests, these occurrences are frequently quite clear to see. An automatic rally (AR), which frequently includes institutional demand for shares as well as short-covering, usually follows the release of these strong selling pressures. Generally stopping at or above the same price level as the SC, a successful secondary test (ST) in the vicinity of the SC will exhibit less selling than earlier, a narrowing of the spread, and decreased volume. One can expect new lows or a protracted period of consolidation if the ST declines below the SC. The limits of the TR are determined by the lows of the SC, ST, and AR as well as the high of the AR. To help bring attention to market behavior, horizontal lines may be drawn, as shown in the two Accumulation Schematics above.<\/p>\n<p><strong>Phase B<\/strong> performs the task of &#8220;creating a reason&#8221; for a fresh uptrend in Wyckoffian analysis (see Wyckoff Law #2 &#8211; &#8220;Cause and Effect&#8221;). Institutions and significant professional interests are stockpiling relatively inexpensive merchandise during Phase B in preparation for the upcoming markup. The process of institutional accumulation, which involves buying shares at lower prices and using short sales to monitor price increases, can take a long time (often a year or more). During Phase B, there are frequently several STs as well as upthrust-like movements toward the upper end of the TR. In general, as the TR develops, the major interests are net buyers of shares with the intention of acquiring as much of the floating supply as they can.<\/p>\n<p><strong>Phase C:<\/strong> The &#8220;smart money&#8221; operators can determine whether the stock is ready to be marked up during Phase C, when the stock price undergoes a decisive test of the remaining supply. A price move below the TR&#8217;s established support level (formed in Phases A and B) that swiftly reverses and goes back into the TR is known as a spring, as was previously mentioned. Because the decline below support seems to indicate a continuation of the downturn, it is an illustration of a bear trap. However, in actuality, this heralds the start of a new rise, trapping the tardy sellers (bears).A successful test of supply, symbolized by a spring (or shakeout) in Wyckoff&#8217;s technique, presents a high-probability trading opportunity. This is an excellent opportunity to start at least a partial long position because a low-volume spring (or a low-volume test of a shakeout) suggests that the stock is probably poised to move up.<\/p>\n<p>The analysis is supported by the emergence of an SOS soon following a spring or shakeout. However, as mentioned in Accumulation Schematic #2, the testing of supply may take place further up in the TR without a spring or shakeout; in this case, it may be difficult to identify Phase C.<\/p>\n<p><strong>Phase D:<\/strong> If our analysis is accurate, the constant dominance of demand over supply should come as a result. A pattern of advances (SOSs) on widening price gaps and rising volume, as well as reactions (LPSs) on narrower spreads and declining volume, provides evidence for this. The price will rise at least to the top of the TR during Phase D. In general, LPSs in this phase are great places to start or extend profitable long investments.<\/p>\n<p><strong>Phase E:<\/strong> The stock departs the TR during Phase E, demand is fully in charge, and everyone can see the markup. Setbacks, including shakeouts and more common reactions, are typically temporary. At any time throughout Phase E, new, higher-level TRs involving both profit-taking and the purchase of additional shares (referred to as &#8220;re-accumulation&#8221;) by significant operators are possible. On the path to even higher price goals, these TRs are sometimes referred to as &#8220;stepping stones.&#8221;<\/p>\n<h2>Distribution: Events &amp; Phases<\/h2>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-542210\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-5.png\" alt=\"\" width=\"602\" height=\"361\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-5.png 602w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-5-300x180.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-5-24x14.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-5-36x22.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-5-48x29.png 48w\" sizes=\"(max-width: 602px) 100vw, 602px\" \/><\/p>\n<p><strong>Preliminary supply, or PSY<\/strong>, occurs when significant interests start to sell lots of shares following a sharp upward trend. Volume increases and the price spread widens, indicating the possibility of a trend change.<\/p>\n<p><strong>BC: buying climax<\/strong>, characterized by frequently significant rises in volume and price spread. The intensity of purchasing peaks, with professional interests filling heavy or urgent public demand at prices close to their peak. Since large operators require enormous public demand to sell their shares without reducing the stock price, a BC frequently occurs in conjunction with excellent earnings reports or other positive news.<\/p>\n<p><strong>AR: Automatic reaction<\/strong>. After the BC, the strong buying significantly decreased, but the heavy supply persisted, and an AR occurred. The lower border of the distribution TR is defined in part by the selloff&#8217;s low.<\/p>\n<p><strong>ST stands for the secondary test<\/strong>, in which the price returns to the BC region to evaluate the demand\/supply situation at the current price levels. Supply must exceed demand for a top to be confirmed, so volume and spread should decline as the price moves closer to BC&#8217;s resistance zone. An ST could appear as an upthrust (UT), in which case the price goes above the resistance indicated by the BC and perhaps other STs before abruptly reversing to close below resistance. Price frequently tests the TR&#8217;s lower boundary after a UT.<\/p>\n<p><strong>SOW—sign of weakness.<\/strong> A downtrend to (or just barely past) the TR&#8217;s lower border, typically accompanied by an increase in spread and volume, is an indication of weakness (SOW). The AR and the initial SOW(s) point to a shift in the stock&#8217;s price movement, with supply now in control.<\/p>\n<p><strong>Last point of supply, or LPSY.<\/strong> A weak rally on a tight spread following a test of support on a SOW indicates that the market is having significant difficulties advancing. Strong supply, low demand, or both may be to blame for this market&#8217;s inability to recover. Before markdowns start in earnest, LPSYs signify the end of the demand cycle and the final distribution waves from large operators.<\/p>\n<p><strong>Upthrust after distribution, or UTAD.<\/strong> The spring and terminal shakeout in the accumulation TR have a distributional counterpart in the form of a UTAD. After a breakthrough over TR resistance, it takes place in the latter stages of the TR and offers a clear test of new demand. A UTAD is not a necessary structural component, similar to springs and shakeouts: the TR in Distribution Schematic #1 contains a UTAD, whereas the TR in Distribution Schematic #2 does not.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-542219\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-6.png\" alt=\"\" width=\"602\" height=\"361\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-6.png 602w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-6-300x180.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-6-24x14.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-6-36x22.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-6-48x29.png 48w\" sizes=\"(max-width: 602px) 100vw, 602px\" \/><\/p>\n<p><strong>Phase A:<\/strong> In a distribution TR, Phase A denotes the end of the previous uptrend. Demand has dominated the market up to this point, and preliminary supply (PSY) and the buying climax are the first notable signs of supply entering the market (BC). Following these occurrences, the BC typically undergoes a secondary test (ST), frequently at a lower volume, as well as an automatic reaction (AR). However, the uptrend may also come to an end without a dramatic event, showing instead that demand has run its course as spread and volume have shrunk; less upward movement is made on each rise until a large amount of supply appears.<\/p>\n<p><strong>Phase B:<\/strong> The goal of Phase B is to establish a foundation in advance of a new downward trend. Institutions and major business interests are currently getting rid of their excess inventories and opening short positions in preparation of the subsequent discount. The arguments for Phase B in distribution are identical to those for Phase B in accumulation, with the exception that as the TR develops, the large interests are net sellers of shares in an effort to use up as much of the remaining demand as they can. These actions leave traces that indicate the supply\/demand balance has tipped more in favor of supply than demand. For instance, spread and volume to the downside typically increase dramatically in conjunction with SOWs.<\/p>\n<p><strong>Phase C:<\/strong> Phase C in distribution may be revealed by an upthrust (UT) or UTAD. A spring&#8217;s opposite is a UT, as was already mentioned. It is a price movement that breaks above TR resistance before immediately turning around and closing in the TR. The remaining demand is being examined in this. It is also a bull trap because, despite appearing to indicate the continuation of the upswing, it actually aims to &#8220;wrong-foot&#8221; uneducated break-out traders. Large interests can deceive the public about the direction of a trend by using a UT or UTAD, then sell more shares to break-out traders and investors at a premium price before the markdown starts. A UTAD may moreover encourage smaller traders with short holdings to cover and surrender their shares. A UTAD may also persuade smaller traders with short positions to cover their positions and hand over their shares to the larger interests behind the move.<\/p>\n<p><strong>Phase D:<\/strong> Phase D comes after Phase C&#8217;s testing, which reveals the last signs of demand. Price moves to or through TR support during Phase D. When a support level is obviously broken or when the price declines below the midpoint of the TR following a UT or UTAD, the evidence that supply is clearly in control becomes more compelling. Within Phase D, there are frequently several weak rallies; these LPSYs offer fantastic chances to start or grow winning short positions. Phase D is dangerous for anyone who is still in a lengthy position.<\/p>\n<p><strong>Phase E<\/strong>: Phase E shows how the decline develops; the stock exits the TR and supply is in charge. When a large SOW&#8217;s TR support is broken, this breakdown is frequently tested by a rally that fails at or around support. Additionally, this gives a highly likely chance to sell short. During the markdown, subsequent rallies are typically weak. Short position holders can follow their stops <span style=\"font-weight: 400;\">by trailing them<\/span> when the price falls. Climactic action may mark the start of an accumulation or re-distribution TR after a major downtrend.<\/p>\n<h2>Supply and Demand Analysis<\/h2>\n<p>One of the main principles of the Wyckoff technique is the analysis of supply and demand on bar charts through the study of volume and price fluctuations. For instance, a price bar with broad spread, a high that is significantly higher than the highs of the preceding few bars, and a greater-than-average volume may indicate the existence of demand. The presence of supply is also indicated by a high-volume price bar with a wide range and a low that is significantly lower than the lows of earlier bars. These straightforward illustrations conceal the complexity of such analysis&#8217;s nuances and intricacies. For example, correctly identifying and comprehending Wyckoff events and phases in trading ranges, as well as determining when the price is prepared to be marked up or down, depend greatly on supply and demand.<\/p>\n<p>This fundamental strategy is embodied in the first and third laws of Wyckoff (Supply and Demand and Effort versus Result), respectively. The conventional wisdom of much technical analysis (and fundamental economic theory) accepts one of the obvious insights of the law of supply and demand: price will advance to a level where demand decreases and\/or supply increases to create a new (temporary) equilibrium when buy orders for shares exceed sell orders at any time. The opposite is also true: if at any moment the number of sell orders (supply) exceeds the number of buy orders (demand), equilibrium will be (temporarily) restored by a price decrease to a level where supply and demand are equal.<\/p>\n<p>In order to predict probable turning points in price trends, Wyckoff&#8217;s third law (Effort versus Result) calls for the identification of price-volume convergences and divergences. As an illustration, when the volume (effort) and price (result) both rise significantly, they are in balance, indicating that Demand will probably continue to drive price upward. However, there are times when volume may grow, maybe even significantly, but price does not follow, resulting in only a slight shift at the close. If we notice this price-volume trend in response to support in an accumulation trading range, this suggests that significant interests are absorbing supply, and is therefore positive. In a distribution trading range, high volume on a rise with little price movement indicates that there is strong supply from large institutions, which prevents the stock from rallying.<\/p>\n<h2>Comparative Strength Analysis<\/h2>\n<p>Analysis of comparative strength was always a step in Wyckoff&#8217;s stock picking procedure. He sought stocks or industries that were outperforming the market, both during trends and trading ranges, to find prospects for long positions, as opposed to short positions, where he sought out underperformers. He manually drew all of his charts, including bar and Point and Figure diagrams. He, therefore, performed his comparative strength study by layering one chart over another, as in the example below, to compare a stock to the market or to others in the same industry. Wyckoff examined the strength or weakness of each wave in respect to earlier waves on the same chart and to the comparable points on the comparison chart when comparing successive waves or swings in each chart. Finding important highs and lows and noting them on both charts is a version of this strategy. The strength of the stock can then be assessed by comparing its price to past highs or lows and repeating this process on the comparison chart. <span style=\"font-weight: 400;\">Looking at the chart we may believe that Wyckoff was purely trying to find correlations and at points where price movement were not correlated, he would try to pursue a further research to the insights of the caution to find possible under-valued stocks. <\/span><\/p>\n<h2><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-542411\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-8.png\" alt=\"\" width=\"602\" height=\"529\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-8.png 602w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-8-300x264.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-8-24x21.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-8-36x32.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-8-48x42.png 48w\" sizes=\"(max-width: 602px) 100vw, 602px\" \/><\/h2>\n<h2>Final Word<\/h2>\n<p>By looking at the chart, we can certainly find the patterns and points explained in the accumulation and distribution schematics as you can see in the screenshot below.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-542226\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-7.png\" alt=\"\" width=\"602\" height=\"315\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-7.png 602w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-7-300x157.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-7-24x13.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-7-36x19.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/01\/Wickoff-7-48x25.png 48w\" sizes=\"(max-width: 602px) 100vw, 602px\" \/><\/p>\n<p>Richard D. Wyckoff, one of the pioneers of technical analysis, who lived approximately a century ago, supplied the public with some of the most powerful insights and view on trading that helped him and other students immerse profits. His legacy lives up to these days and many students across the globe are familiar with his method which included ideas from other titans of the technical analysis such as Charles H. Dow (a.k.a. Dow Theory) or Ralph N. Elliott (Elliott Wave theory). There is no doubt that markets have particular cycles that they go through and Wyckoff theory offers a simple and logical viewpoint to the bigger picture of the cycle. Even though the chart patterns in the accumulation\/distribution phase are rarely respected, the definition of each points perfectly make sense when analyzing the charts. In a combination of supply\/demand analysis and a comparative strength analysis, this method makes the strategy to be one of the powerful tools in the market.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever looked at the charts and thought to yourself that there are patterns or cycles that keep repeating themselves but you find it hard to decipher them? Have you ever found yourself searching for an entry but you were unsure due to your biases? In this article, we will discuss the Wyckoff theory [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":542385,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[162],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/542175"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=542175"}],"version-history":[{"count":8,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/542175\/revisions"}],"predecessor-version":[{"id":585926,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/542175\/revisions\/585926"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/542385"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=542175"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=542175"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=542175"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}