{"id":545980,"date":"2023-02-24T12:08:06","date_gmt":"2023-02-24T11:08:06","guid":{"rendered":"https:\/\/abrakadabra.ftmo.com\/?p=545980"},"modified":"2023-03-29T12:08:49","modified_gmt":"2023-03-29T10:08:49","slug":"co-je-marze-a-proc-je-dulezite-o-ni-neco-vedet","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/co-je-marze-a-proc-je-dulezite-o-ni-neco-vedet\/","title":{"rendered":"Co je marže a proč je důležité o ní něco vědět?"},"content":{"rendered":"<p><em>Každý trader, který chce obchodovat na forexu, by měl vědět význam slova marže, resp. obchodování na marži. Bez využití marže a pákového efektu totiž při obchodování forexu nebudete schopni otevřít prakticky žádný obchod.<\/em><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-544920\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/What-is-margin-and-why-is-it-important-to-know-about-it_-CZ.jpg\" alt=\"\" width=\"800\" height=\"419\" \/><\/p>\n<p>Vzhledem k tomu, že na forexovém trhu se obchoduje ve velkých objemech, běžný retailový investor\/obchodník by si to nemohl dovolit. Díky využívání marže a pákového efektu však dnes může na forexu obchodovat prakticky každý (marži a páku lze využívat i na jiných trzích, ale my budeme psát o tom, jak to funguje u forexových brokerů, resp. prop tradingových firem, jakou je i FTMO).<\/p>\n<h2>Co je marže<\/h2>\n<p>Marže je zjednodušeně řečeno vklad nebo záloha u brokera\/firmy, u níž máme otevřen účet, abychom mohli otevírat pozice na měnových párech (případně jiných instrumentech, které firma nabízí) a zároveň slouží ke krytí případných ztrát. Není to forma poplatku, jsou to peníze, které si firma zablokuje, když otevíráme novou pozici. Zbytek peněz potřebných k otevření pozice se obstará broker, resp. poskytovatelé likvidity, <a href=\"https:\/\/ftmo.com\/cs\/jakou-roli-hraji-na-forexu-poskytovatele-likvidity\/\">o nichž jsme psali v tomto článku<\/a>.<\/p>\n<p>Tomuto procesu, kdy investujeme jen část svých peněz, se říká obchodování s pákou a umožňuje nám to otevírat mnohem větší pozice, než bychom si běžně mohli dovolit. Lze tak dosahovat poměrně velkých zisků i při relativně malých pohybech na trzích. Zároveň je nutné počítat s tím, že stejně vysoké mohou být i ztráty. Proto je důležité při obchodování na páku myslet na správný money management a risk management.<\/p>\n<h2>Požadovaná marže<\/h2>\n<p>To, jakou sumu si firma při otevření zablokuje, závisí od maržového požadavku dané firmy\/brokera. Požadovaná marže (také vstupní, nebo počáteční marže) se vyjadřuje v procentech, které tvoří naše prostředky z celkové sumy při otevření pozice.<\/p>\n<p>Když je požadovaná marže 1 %, při otevření pozice o velikosti 1 lotu na páru USDJPY (na forexu je to 100 000 USD) se nám zablokuje na účtu 1 000 USD. Na svém účtu bychom teoreticky měli mít minimálně těchto 1 000 USD. V tomto případě tedy jde o páku 100:1. Je důležité upozornit, že u různých firem se požadované marže (a tedy i páka) různí a odlišné maržové požadavky jsou také v rámci jednotlivé firmy u různých investičních nástrojů. Jak je to u FTMO, se <a href=\"https:\/\/ftmo.com\/cs\/symbols\/\">můžete podívat zde<\/a>.<\/p>\n<h2>Použitá a volná marže<\/h2>\n<p>Když otevíráme další pozice, s každým novým obchodem se nám zablokují další prostředky na účtu. Součet všech těchto prostředků se nazývá použitá, nebo celková marže. Zbytek prostředků, které máme k dispozici a v dané chvíli je nevyužíváme, se nazývá dostupná, nebo také volná marže. Jde tedy o majetek (zůstatek, změněn o zisk nebo ztrátu z aktuálně otevřených pozic) na účtu zmenšen o použitou marži.<\/p>\n<h2>Výška marže<\/h2>\n<p>V obchodní platformě ještě můžeme najít číslo vyjádřené v procentech pod názvem výška marže. Ta vyjadřuje poměr mezi majetkem a použitou marží v procentech. Pokud tedy máme na účtu majetek 44 000 USD a použitá marže je 1 500 USD, výška marže představuje 2 933 %.<\/p>\n<p>Při obchodování na forexu je výška marže nad úrovní 100 % považována za bezpečnou. Znamená to, že objem majetku na našem účtu je vyšší, než jsou prostředky použité na obchody. Tato úroveň je důležitá také proto, že jde většinou o úroveň nazývanou jako margin call.<\/p>\n<h2>Margin call<\/h2>\n<p>Když otevřeme příliš mnoho velkých pozic, nebo se naše otevřené obchody dostanou do velkých ztrát, může naše výška marže výrazně klesnout. Když dosáhne určitou úroveň, dostaneme tzv. margin call (výzvu), což znamená, že náš majetek klesl pod úroveň použité marže a prostředky na účtu nejsou dostatečné vzhledem k požadované marži. V této chvíli nemůžeme otevírat další pozice a měli bychom začít uzavírat své otevřené pozice (při margin callu nedochází k automatickému uzavírání pozic), nebo bychom měli doplnit prostředky na svém účtu.<\/p>\n<h2>Stop out<\/h2>\n<p>Když se nám nadále nedaří a výška marže kvůli nepříznivým výsledkům na trzích stále klesá, můžeme se dostat až na úroveň nazývanou stop out. Tuto úroveň má každý broker\/firma nastavenou jinak. Když je ale tato úroveň například 50%, tak když dosáhne výška marže 50 %, začne nám broker uzavírat otevřené pozice. Vzhledem k tomu, že uzavření jednoho obchodu může vést ke zvýšení výšky marže nad 50 %, uzavírají se nejdříve obchody s největšími ztrátami.<\/p>\n<p>Jak již bylo řečeno, obchodování s pákou a využitím marže může znamenat rychlé zisky, ale také rychlé ztráty. Abychom se vyhnuli situacím, jako jsou margin call a stop out, měli bychom dbát na dodržování pravidel money managementu a risk managementu. Využívání Stop Lossů, otevírání rozumně velkých pozic, nebo omezení obchodování v čase vyhlašování důležitých zpráv může vést k tomu, že se s pojmy jako margin call a stop out v reálu nakonec nikdy nepotkáme.<\/p>\n<h2>FTMO Kalkulačka marže<\/h2>\n<p>FTMO jako prop tradingová firma nabízí obchodníkům nejenom možnost využívat pákového efektu, ale také <a href=\"https:\/\/ftmo.com\/cs\/nekolik-duvodu-proc-zacit-obchodovat-na-forexu\/\">možnost otevřít si dostatečně velký obchodní účet jen za velmi nízký poplatek<\/a>.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/margin-calculator?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=margincalculator\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-544884\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Margin-Calculator-CZ.png\" alt=\"\" width=\"800\" height=\"377\" \/><\/a><\/p>\n<p>V rámci rozšiřování nabídky našich produktů a zlepšování služeb FTMO Traderům jsme koncem února přišli s novou <a href=\"https:\/\/trader.ftmo.com\/margin-calculator\">aplikací s názvem Kalkulačka marže<\/a>. Díky ní už FTMO Tradeři nebudou muset složitě počítat marži potřebnou na otevření obchodu prostřednictvím vzorce.<\/p>\n<p>V aplikaci jednoduše stačí zadat základní údaje, jako je typ účtu (standard, swing), měna účtu, majetek na účtu (Equity), velikost pozice a samozřejmě instrument, resp. symbol, na němž chce trader otevřít svou pozici. Cenu na instrumentu není potřeba vyplňovat, protože aplikace sama vyplní aktuální bid cenu podle kotace FTMO. Když chce trader znát marži při jiné než aktuální ceně, má možnost si jí samozřejmě zadat sám.<\/p>\n<p>Jelikož může být výpočet požadované marže prostřednictvím vzorců pro většinu obchodníků zbytečně zdlouhavá, věříme, že je nová aplikace praktickou vychytávkou, kterou si oblíbí většina FTMO Traderů. Princip marže, její využití a výpočet nemusí být nic složitého, i když to tak na první pohled může vypadat.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Každý trader, který chce obchodovat na forexu, by měl vědět význam slova marže, resp. obchodování na marži. Bez využití marže a pákového efektu totiž při obchodování forexu nebudete schopni otevřít prakticky žádný obchod. Vzhledem k tomu, že na forexovém trhu se obchoduje ve velkých objemech, běžný retailový investor\/obchodník by si to nemohl dovolit. Díky využívání marže [&hellip;]<\/p>\n","protected":false},"author":48,"featured_media":545974,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/545980"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/48"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=545980"}],"version-history":[{"count":2,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/545980\/revisions"}],"predecessor-version":[{"id":545984,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/545980\/revisions\/545984"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/545974"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=545980"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=545980"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=545980"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}