{"id":545970,"date":"2023-02-24T12:07:22","date_gmt":"2023-02-24T11:07:22","guid":{"rendered":"https:\/\/abrakadabra.ftmo.com\/?p=545970"},"modified":"2023-07-20T13:41:38","modified_gmt":"2023-07-20T11:41:38","slug":"what-is-margin-and-why-is-it-important-to-know-about-it","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/what-is-margin-and-why-is-it-important-to-know-about-it\/","title":{"rendered":"What is margin and why is it important to know about it?"},"content":{"rendered":"<p><em>Every trader who wants to trade forex should know the meaning of the word margin, or trading on margin. Without the use of margin and leverage, you will be unable to open virtually any trade when trading forex.<\/em><\/p>\n<p>Since the forex market is traded in large volumes, the ordinary retail investor\/trader would not be able to afford it. However, thanks to the use of margin and leverage, pretty much anyone can trade forex today (margin and leverage can be used in other markets as well, but for now, we&#8217;ll stick to how the margin works with forex brokers or prop trading firms such as FTMO).<\/p>\n<h2>What is margin<\/h2>\n<p>Margin, in simple terms, is a deposit with the broker\/company we have an account with that ultimately allows us to open our trading positions. It is not a form of fee, it is simply a part of the account&#8217;s balance that the firm locks in when we open a new position. The rest of the money needed to open the position is handled by the broker or <a href=\"https:\/\/ftmo.com\/en\/liquidity-providers\/\">liquidity providers we wrote about in this article<\/a>.<\/p>\n<p>This process of investing only a portion of our money is called leveraged trading, and it allows us to open much larger positions than we could normally afford. This allows us to make large profits even with relatively small movements in the markets. At the same time, you have to take into account that losses can be just as high. Therefore, it is important to think about proper money management and risk management when trading on leverage.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/margin-calculator?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=margincalculator \" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-548225 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Blog-banner-calc-1.jpg\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Blog-banner-calc-1.jpg 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Blog-banner-calc-1-300x49.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Blog-banner-calc-1-768x125.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Blog-banner-calc-1-705x115.jpg 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Blog-banner-calc-1-24x4.jpg 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Blog-banner-calc-1-36x6.jpg 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Blog-banner-calc-1-48x8.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h2>Margin requirement<\/h2>\n<p>The amount of funds locked depends on the margin requirement of the firm\/broker. The required (also known as entry or initial) margin is expressed as a percentage that makes up our funds of the total amount when we open a position.<\/p>\n<p>When the required margin is 1%, opening a position of 1 lot size on the USDJPY pair (in forex, this is typically $100,000) will block $1,000 in our account. Theoretically, we should have at least this 1 000 USD in our account. So in this case it is 1:100 leverage. It is important to note that the required margin (and therefore leverage) varies from firm to firm, and the margin requirements also vary from firm to firm for different investment instruments. <a href=\"https:\/\/ftmo.com\/en\/symbols\/\">You can see how this is the case for FTMO here<\/a>.<span style=\"text-decoration: underline;\"><br \/>\n<\/span><\/p>\n<h2>Used and free margin<\/h2>\n<p>When we open additional positions, with each new trade, additional funds are blocked in our account. The sum of all these funds is called the used or total margin. The rest of the funds that we have currently available are called available, or free margin. It is therefore the equity (balance, modified by the profit or loss on currently open positions) of the account minus the margin used.<\/p>\n<h2>Margin level<\/h2>\n<p>In the trading platform, we can still find a number expressed as a percentage called the margin level. This expresses the ratio between the equity and the used margin as a percentage. So if we have $44,000 in assets in the account and the used margin is $1,500, the margin level is 2,933%.<\/p>\n<p>In forex trading, a margin level above 100% is considered safe. This means that the amount of equity in our account is higher than the funds used for the trades. This level is also important because it is usually a level called a margin call.<\/p>\n<h2>Margin call<\/h2>\n<p>If we open too many large positions, or our open trades take large losses, our margin level can drop significantly. When it reaches a certain level, we get a margin call, which means that our equity has fallen below the level of the used margin and the funds in the account are insufficient relative to the required margin. At this point, we cannot open any more positions and should start closing our open positions (there is no automatic closing of positions during a margin call), or we should replenish the funds in our account.<\/p>\n<h2>Stop out<\/h2>\n<p>If we continue to underperform and the margin continues to fall due to unfavourable market performance, we may reach a level called a stop-out. This level is set differently by each broker\/company. However, when this level is, for example, 50%, when the margin level reaches 50%, the broker will start closing our open positions. Since closing a single trade can lead to margin levels above 50%, the trades with the largest losses are closed first.<\/p>\n<p>That being said, trading with leverage and using margin can mean quick gains but also quick losses. In order to avoid situations such as margin calls and stop-outs, we should make sure to follow the rules of money management and risk management. The use of Stop Losses, opening reasonably sized positions, or limiting trading at the time of important news announcements can lead to never encountering concepts like margin call and stop out in real life.<\/p>\n<h2>FTMO Margin Calculator<\/h2>\n<p>As a prop trading firm, FTMO offers traders not only the ability to use leverage, but also the <a href=\"https:\/\/ftmo.com\/en\/a-few-reasons-to-start-trading-forex\/\">ability to open a large enough trading account for only a very low fee<\/a>.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/margin-calculator?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=margincalculator \" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-548216\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Margin-Calculator-EN-1030x486-1.png\" alt=\"\" width=\"800\" height=\"377\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Margin-Calculator-EN-1030x486-1.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Margin-Calculator-EN-1030x486-1-300x142.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Margin-Calculator-EN-1030x486-1-768x362.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Margin-Calculator-EN-1030x486-1-705x333.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Margin-Calculator-EN-1030x486-1-24x11.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Margin-Calculator-EN-1030x486-1-36x17.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/02\/Margin-Calculator-EN-1030x486-1-48x23.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p>As part of expanding our product offerings and improving our service to FTMO Traders, we came out with a <a href=\"https:\/\/trader.ftmo.com\/margin-calculator\">new app called Margin Calculator<\/a> at the end of February. With it, FTMO Traders will no longer have to complexly calculate the margin required to open a trade through a formula.<\/p>\n<p>In the app, you simply need to enter basic data such as account type (standard, swing), account currency, account equity, position size and of course the instrument or symbol on which the trader wants to open his position. There is no need to fill in the price on the instrument, as the application will fill in the current bid price according to the FTMO quote. If the trader wants to know the margin at a price other than the current price, he can of course enter it himself.<\/p>\n<p>Since calculating the required margin through formulas can be unnecessarily tedious for most traders, we believe the new app is a practical gadget that most FTMO Traders will love. The principle of margin, its usage and calculation need not be anything complicated, even though it may seem so at first glance.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every trader who wants to trade forex should know the meaning of the word margin, or trading on margin. Without the use of margin and leverage, you will be unable to open virtually any trade when trading forex. Since the forex market is traded in large volumes, the ordinary retail investor\/trader would not be able [&hellip;]<\/p>\n","protected":false},"author":48,"featured_media":545971,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/545970"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/48"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=545970"}],"version-history":[{"count":10,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/545970\/revisions"}],"predecessor-version":[{"id":611886,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/545970\/revisions\/611886"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/545971"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=545970"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=545970"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=545970"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}