{"id":546059,"date":"2023-03-29T12:31:37","date_gmt":"2023-03-29T10:31:37","guid":{"rendered":"https:\/\/abrakadabra.ftmo.com\/?p=546059"},"modified":"2023-06-06T14:04:07","modified_gmt":"2023-06-06T12:04:07","slug":"finding-a-good-strategy-that-suits-you-is-very-important","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/finding-a-good-strategy-that-suits-you-is-very-important\/","title":{"rendered":"“Finding a good strategy that suits you is very important”"},"content":{"rendered":"<p><em>Newcomers to Forex often fail quickly because instead of testing their own strategy and finding what is best for them, they try strategies from more successful traders with the vision of easy and quick profits. However, there is no strategy that will make the same profit for all traders, as something different may suit everyone. Trading is simply an individual sport, and our new FTMO Traders thrive on it.<\/em><\/p>\n<h3>Trader Swarupanand: &#8220;Try to focus on quality trades and not on the quantity of trades.&#8221;<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-546926\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Swarupanand-169x300.jpg\" alt=\"\" width=\"169\" height=\"300\" \/><\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>Potential for a financial gain: One of the primary motivators for pursuing trading is the possibility of making money. Trading offers individuals the opportunity to earn profits by buying and selling various financial instruments such as stocks, bonds, options, futures, and currencies. With the right knowledge and skills, traders can potentially earn significant profits. Flexibility and autonomy: Trading can offer a great deal of flexibility and autonomy to individuals. Traders can work from anywhere with an internet connection, and they have control over their own schedules. This can be appealing to those who prefer to work independently and have a lot of control over their own careers. Entrepreneurial spirit: Trading can appeal to individuals who have an entrepreneurial spirit. Trading is essentially a small business, and successful traders need to have an entrepreneurial mindset in order to succeed. They must be able to manage risk, make smart investments, and continuously adapt to changing market conditions.<\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>Passing the FTMO Challenge and Verification can be a significant milestone for traders, and it can have several positive impacts on their lives. Here are a few ways that passing the FTMO Challenge and Verification can change someone&#8217;s life: Increased confidence: Passing the FTMO Challenge and Verification can be a confidence booster for traders. It validates their skills and knowledge and shows that they have what it takes to succeed in the markets. This newfound confidence can spill over into other areas of their lives as well. Improved finances: One of the most significant changes that passing the FTMO Challenge and Verification can bring is an improvement in finances. Successful traders can earn a share of the profits generated by the trading account, which can be a significant source of income. This can lead to improved financial stability and more opportunities for personal and professional growth. Enhanced reputation: Passing the FTMO Challenge and Verification can also enhance a trader&#8217;s reputation in the trading community. It shows that they have passed a rigorous Evaluation Process and have the skills and knowledge necessary to succeed. This can lead to more opportunities for collaboration and networking within the industry.<\/p>\n<p><strong>What was easier than expected during the FTMO Challenge or Verification?<\/strong><\/p>\n<p>The rules and guidelines for the FTMO Challenge and Verification were clear and easy to follow. The Trading Objectives were also straightforward and aligned with the trader&#8217;s existing trading strategies. Additionally, the funding process was reported to be relatively quick and straightforward. Once a trader passed the Verification stage and was funded, they were able to start trading with minimal delays.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-546967\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Swarupanand-trades.png\" alt=\"\" width=\"906\" height=\"1225\" \/><\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>I managed to eliminate the factor of luck by doing the following things: Developed a trading plan. Used a systematic approach. Backtested the strategy. Proper risk management. Continuous learning from mistakes.<\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>Yes, I do have my trading plan and I&#8217;m very strict about it.<\/p>\n<p><strong>What is the number one advice you would give to a new trader?<\/strong><\/p>\n<p>Be patient. Try to focus on quality trades and not on the quantity of trades.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=tradersqa\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546229 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2.png\" alt=\"\" width=\"800\" height=\"130\" \/><\/a><\/p>\n<h3>Trader Leah: &#8220;I believe trading angry or revenge trading can end badly.&#8221;<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-546933\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Leah-300x216.jpeg\" alt=\"\" width=\"300\" height=\"216\" \/><\/p>\n<p><strong>Do you plan to take another FTMO Challenge to manage even bigger capital?<\/strong><\/p>\n<p>Maybe in the future depending how my trading goes with the current capital I have.<\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>What inspired me to pursue trading was not being stuck down to a 9-5 job, it was the freedom especially with being a mum knowing I could work when I feel like and enjoy time with my daughter at the same time.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>I don’t believe it is easy to do, especially with emotions involved it can be hard, but have a plan set out and make sure to follow it with risk management.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-546974\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Leah-trades.png\" alt=\"\" width=\"907\" height=\"1207\" \/><\/p>\n<p><strong>How did loss limits affect your trading style?<\/strong><\/p>\n<p>Maximum loss limits made me put a more stricter trading plan and style in place to ensure I followed and completed the Trading Objectives. It makes you more committed to pass and to put more work in.<\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>Yes, I have a trading plan in place, I aim to make a certain amount of profit each day and if the day ends in a loss I try not to let it affect me mentally and will not put trades on just to try and recover the loss. I believe trading angry or revenge trading can end badly.<\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>Believe in yourself, control your emotions, don’t close a trade if it is in negative, as a trade can also reverse, and have a TP. If you’re having a bad day, leave the charts for a day, refresh and go again. It is possible.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=tradersqa\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546215 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1.png\" alt=\"\" width=\"800\" height=\"130\" \/><\/a><\/p>\n<h3>Trader Sandro: &#8220;Certain amount of luck is part of anyone&#8217;s trading.&#8221;<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-546940\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Sandro-225x300.jpg\" alt=\"\" width=\"225\" height=\"300\" \/><\/p>\n<p><strong>What does your risk management plan look like?<\/strong><\/p>\n<p>I usually risk no more than 0.75% per trade on funded accounts. However, I risk up to 2% and 1% respectively on challenges and verifications due to time constraints. Either way, I always also make sure to never breach the daily DD limit by using Stop Losses and setting up price alerts on TradingView.<\/p>\n<p><strong>What was easier than expected during the FTMO Challenge or Verification?<\/strong><\/p>\n<p>It technically only took me 9 days of trading to pass the FTMO Challenge and just 3 more days to complete the Verification step (while opening 0.01 lot positions for the remaining time). Initially, I didn&#8217;t expect to pass the Evaluation so quickly. However, I have managed to enter into a few very good trades which allowed me to make good profits in a very short time. That said, I am mostly proud of myself for being able to successfully follow my trading plan and risk management profile in a very precise and systematic way throughout the entire Evaluation Process.<\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>Unfortunately, yes. As a beginner, I used to get quite emotional after a losing streak and would often overtrade\/revenge trade as a result. I have now learnt to put my emotions aside when it comes to trading and always stick to my trading plan, even and especially during drawdown periods.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-546981\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Sandro-trades.png\" alt=\"\" width=\"905\" height=\"1208\" \/><\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>I actually think that a certain amount of luck is part of anyone&#8217;s trading. A working strategy, paired with solid trading psychology and a good risk management plan can only provide a statistical advantage over the market in the long term. However, it is not possible to claim with certainty what the outcome of any specific trade is going to be.<\/p>\n<p><strong>What do you think is the key for long term success in trading?<\/strong><\/p>\n<p>Finding a good strategy that suits you is very important. There are several strategies out there that can work and there isn&#8217;t a single best one. However, it is crucial to be able to stick to one in order for the edge to play out. Therefore, it is essential to take into account someone&#8217;s individual circumstances such as preferred trading style (scalping, day trading, swing trading, etc.) and trading hours (based on the time zone location and other everyday commitments, such as work). Backtesting is the following step and it should always be carefully carried out in order to assure that the strategy is indeed profitable and to also increase your confidence in using it. Once this is all done, the next steps to success are all about mastering trading psychology and sticking to a solid risk management plan. Ultimately, never stop learning new trading concepts and improving yourself and your edge!<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/scaling-plan?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=tradersqa\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546222 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3.png\" alt=\"\" width=\"800\" height=\"130\" \/><\/a><\/p>\n<p><strong>What would you like to say to other traders that are attempting the FTMO Challenge?<\/strong><\/p>\n<p>You can do it too! I know it might sound a little bit cliché at this point, but the truth is that everyone can ultimately be successful in trading, as long as you are willing to put the time and effort to make it work out for you! There is also no need to compare yourself with others; each trading journey is unique and you should be proud of what you are doing, regardless of what color your account balance is at the moment. Even when it doesn&#8217;t feel like you are making much progress, keep going, you will thank yourself one day for not giving it all up!<\/p>\n<h3>Trader Daniel: &#8220;Get a strategy that works for you and take your trades.&#8221;<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-546947\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Daniel-200x300.jpg\" alt=\"\" width=\"200\" height=\"300\" \/><\/p>\n<p><strong>How would you rate your experience with FTMO?<\/strong><\/p>\n<p>I would rate my experience with FTMO so far 10\/10. It has been very productive. I went into the process thinking I knew more than I actually did, and following the FTMO guidelines I realized I wasn&#8217;t. It was humbling at the beginning but in time it has made me the trader I am today.<\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>It has, especially in the beginning. I would ride out my losses and cut my winnings because of fear that it would go back against me. The fear of losing a trade prevented me from taking trades. Lack of confidence prevented me from riding out my trades to the fullest and pulling out before time. But with time and a lot of practice I got over those barriers and for now my psychology towards trading is totally different.<\/p>\n<p><strong>What does your risk management plan look like?<\/strong><\/p>\n<p>My risk management is very consistent. I choose a set percentage according to my win rate and try to focus a lot on my Risk to reward. During my Challenge and Verification process I did a 2% risk on all of my trades.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-546988\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Daniel-trades.png\" alt=\"\" width=\"907\" height=\"1191\" \/><\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>It&#8217;s something that I&#8217;ve been working on for the last few months, and finally passing them has given me that boost of confidence that I&#8217;m heading in the right direction. I hope to be a successful trader in the next few months and years to come, and I feel like FTMO is going to help me accomplish that.<\/p>\n<p><strong>What was more difficult than expected during your FTMO Challenge or Verification?<\/strong><\/p>\n<p>For me it was maintaining discipline. Whether it was discipline to be consistent on the market, discipline to know when to trade and when not to, to follow my strategy, or discipline to manage the psychology behind trading, it was a challenge for me.<\/p>\n<p><strong>What is the number one advice you would give to a new trader?<\/strong><\/p>\n<p>My number one advice to anyone starting out this journey would be to get a strategy that works for you and take your trades. The fear of losing would hold you back a lot.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Newcomers to Forex often fail quickly because instead of testing their own strategy and finding what is best for them, they try strategies from more successful traders with the vision of easy and quick profits. However, there is no strategy that will make the same profit for all traders, as something different may suit everyone. [&hellip;]<\/p>\n","protected":false},"author":48,"featured_media":546060,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[672],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/546059"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/48"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=546059"}],"version-history":[{"count":3,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/546059\/revisions"}],"predecessor-version":[{"id":567132,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/546059\/revisions\/567132"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/546060"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=546059"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=546059"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=546059"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}