{"id":568419,"date":"2023-06-16T14:01:18","date_gmt":"2023-06-16T12:01:18","guid":{"rendered":"https:\/\/ftmo.com\/?p=568419"},"modified":"2023-10-19T16:02:28","modified_gmt":"2023-10-19T14:02:28","slug":"how-not-to-lose-a-funded-account","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/how-not-to-lose-a-funded-account\/","title":{"rendered":"How not to lose a funded account"},"content":{"rendered":"<p><em>Among clients of prop trading firms, there is a relatively good number of traders who are able to go through the entire Evaluation Process but are not able to make profits long-term in a so-called “funded account”. In the worst case scenario, they break some of the risk management rules in the first month of trading and end up losing their account. How to prevent this from happening?<\/em><\/p>\n<p>Passing the Evaluation Process, where a trader has to achieve a profit target of a predetermined percentage of the account balance within a period of one month, and then confirm his <a href=\"https:\/\/ftmo.com\/en\/the-most-important-trading-skills-for-a-successful-trader\/\">trading skills<\/a> it in a second round, is certainly not easy. Prop trading firms, including FTMO, have clearly set rules that require traders to have some experience and knowledge of what is happening in the market. We wrote about what all this entails in our recent article.<\/p>\n<p>Although completing the Evaluation Process is not easy, there are quite a few people who succeed, some even manage to repeat their success several times in a row. Unfortunately, however, there are still quite a few traders who are unable to repeat their success after meeting all the requirements and obtaining a <a href=\"https:\/\/ftmo.com\/en\/\">funded trading account<\/a>.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=notlosingfundedaccount\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546404 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h2>The psychological problem<\/h2>\n<p>In most cases, it is a psychological problem. Forex is in fact an environment that does not forgive any mistakes and after a period of success when a trader has met the conditions of the Evaluation Process and obtained an account, he may face a period when he simply fails. This is not unusual, it happens to everyone, but not every trader is able to withstand such a phase.<\/p>\n<h2>It&#8217;s not a sprint, it&#8217;s a marathon<\/h2>\n<p>When it comes to trading on a funded account, it is clearly true that trading Forex is not a sprint, but a long run. A trader does not have to make above-average profits at all costs, he is not pressured by a time limit and should focus primarily on following the rules and his strategy. When he gets into a series of losing trades, he must realize that Forex is not a cakewalk, and that scenarios like this are not unusual.<\/p>\n<h2>Stick to what worked<\/h2>\n<p>The key to successfully weathering down periods on a funded account is to follow the same rules and strategies that worked during the FTMO Challenge or Verification. It stands to reason that what worked in the Evaluation Processs should also work on an FTMO Account. Based on the responses we received from our <a href=\"https:\/\/ftmo.com\/en\/blog\/?tx_category=ftmo-traders\">new FTMO Traders<\/a>, the risk management rules traders set often teach them to be more consistent with their strategy and to focus more on quality risk management. This ultimately helps them to meet the requirements of the Evaluation Process.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=notlosingfundedaccount\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546397 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p>There is no need to change anything on an FTMO Account, no need to increase positions. Rather, on the contrary, if a trader wants to make adjustments, they can safely reduce their position sizes. This can provide a trader with psychological comfort just when he is experiencing a period of losses, because his losses are actually smaller and this provides him with some cushion for longer periods of losses. It is also good to think of a <a href=\"https:\/\/ftmo.com\/en\/consistency-is-very-important-for-success-in-trading\/\">consistent approach<\/a> that can also help the trader survive longer periods of losses.<\/p>\n<h2>You can&#8217;t avoid losses, learn to manage them<\/h2>\n<p>Every experienced trader knows very well that losses are part of the trading process in Forexand the sooner he accepts this fact and adapts to it, the better his chances of success will be. We may be repeating ourselves, however, if a trader sticks to his strategy (which he should have tested on a large enough sample of trades), it is very likely that the situation will eventually turn in the right direction and profits will eventually come.<\/p>\n<h2>Changing a strategy may or may not help<\/h2>\n<p>Sometimes a prolonged streak of losses can make a trader think about adjusting his strategy. Nowhere is it written that the rules you initially set must work indefinitely, as market conditions change over time. However, a complete rewriting of the rules is certainly not recommended. If a trader has to make any adjustments to his trading approach, he should not do it directly on an FTMO Account. This may again lead to further losses, and, in the end, even result in a return to the original strategy, which the trader will probably no longer trust, so this may not help. Any change should be tested on a Free Trial account, which is designed for such experiments. In any case, it is recommended to be cautious when changing a strategy and a trading style. Hasty changes do not lead to long-term profits in the vast majority of cases.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/scaling-plan\/?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=notlosingfundedaccount\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546367 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h2>Beware of revenge trading and overtrading<\/h2>\n<p>Perhaps the worst way to deal with losses on an FTMO Account is to resort to revenge trading and overtrading. This is a road to hell in virtually every case and will certainly not lead to long-term and stable profits. Unfortunately, there are still traders who, during a prolonged series of unsuccessful trades and after their account goes into deeper losses, solve this problem by increasing their position sizes. By doing so, they either want to get back into profit quickly or they simply expect to lose their FTMO Account and prefer to buy a new FTMO Challenge and try again.<\/p>\n<p>In either case, however, the chances of success are very slim. <a href=\"https:\/\/ftmo.com\/en\/gambling-is-not-the-right-way-to-make-money\/\">Increasing positions, or overleveraging<\/a>, may only lead to increased stress, which, of course, then can lead to mistakes and further losses. The second case, when a trader bets on success in the next FTMO Challenge, also does not make much sense. After all, it is foolish to think that a trader will do well in the Evaluation Process, where he has to meet the minimum profit target requirements within a certain period of time in addition to the loss limits, when he is not doing well on his FTMO Account, where he does not have to deal with these necessary target values anymore.<\/p>\n<p>In conclusion, we can probably confirm that if you get into a prolonged period of losses and don&#8217;t want to lose your FTMO Account, it is probably best to try to reduce the size of your positions and be even more aware of the risk management. It may well be that it is the experience of coming back from deep losses to profits that will show a trader the way to even better manage entries and exits of their positions. And, in the end, the trader will become an even better trader than he was at the time he successfully completed the conditions of the Evaluation Process. And that&#8217;s a goal that virtually all of us have.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Among clients of prop trading firms, there is a relatively good number of traders who are able to go through the entire Evaluation Process but are not able to make profits long-term in a so-called “funded account”. In the worst case scenario, they break some of the risk management rules in the first month of [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":568551,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/568419"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=568419"}],"version-history":[{"count":8,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/568419\/revisions"}],"predecessor-version":[{"id":596058,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/568419\/revisions\/596058"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/568551"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=568419"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=568419"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=568419"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}