{"id":581995,"date":"2023-07-19T13:00:51","date_gmt":"2023-07-19T11:00:51","guid":{"rendered":"https:\/\/ftmo.com\/?p=581995"},"modified":"2023-08-01T13:05:50","modified_gmt":"2023-08-01T11:05:50","slug":"learn-to-be-patient-that-is-being-productive","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/learn-to-be-patient-that-is-being-productive\/","title":{"rendered":"“Learn to be patient, that is being productive”"},"content":{"rendered":"<p><em>As the author of this statement says, it may sound a bit like an oxymoron, but it is similar to the statement that less is sometimes more. Doing as many deals as possible with the goal of making a quick buck may not be the right path to success. In most cases, it&#8217;s much more &#8220;productive&#8221; to wait for the right set-up and make the most of it. And what do our new FTMO Traders think about this?<\/em><\/p>\n<h3>Trader Abdul Haseeb: “Winning a trade doesn&#8217;t make you smart and losing a trade doesn&#8217;t make you dumb.”<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-581996\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Abdul-Haseeb-200x300.jpeg\" alt=\"\" width=\"200\" height=\"300\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Abdul-Haseeb-200x300.jpeg 200w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Abdul-Haseeb-687x1030.jpeg 687w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Abdul-Haseeb-768x1152.jpeg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Abdul-Haseeb-1024x1536.jpeg 1024w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Abdul-Haseeb-1365x2048.jpeg 1365w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Abdul-Haseeb-1000x1500.jpeg 1000w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Abdul-Haseeb-470x705.jpeg 470w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Abdul-Haseeb.jpeg 1624w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/p>\n<p><strong>Do you plan to take another FTMO Challenge to manage even bigger capital?<\/strong><\/p>\n<p>Yes, I plan on taking more FTMO challenges to manage even bigger capital.<\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>It hasn&#8217;t changed my life yet but, hopefully, once the payouts start coming in, I&#8217;ll be able to live a bit more freely. Hopefully, be financially free someday.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>By profession, I&#8217;m a Software Engineer. So, naturally, over the years, I&#8217;ve written my own strategy in code that gives me a bigger edge and a higher probability of success. I also eliminated the factor of luck by being well-educated about the markets and how to read charts. I spent countless hours reading books and testing out different strategies.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-582030\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Abdul-Haseeb-trades.png\" alt=\"\" width=\"902\" height=\"1302\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Abdul-Haseeb-trades.png 902w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Abdul-Haseeb-trades-208x300.png 208w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Abdul-Haseeb-trades-714x1030.png 714w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Abdul-Haseeb-trades-768x1109.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Abdul-Haseeb-trades-488x705.png 488w\" sizes=\"(max-width: 902px) 100vw, 902px\" \/><\/p>\n<p><strong>What was the most difficult during your FTMO Challenge or Verification and how did you overcome it?<\/strong><\/p>\n<p>The thought of achieving a certain percentage within a given period of time was the challenging part. Knowing that trading is a probabilities game, there was a chance that I might not make the targets within the allotted time. Keeping calm and placing trades when my signal came up was challenging as I saw the number of days decrease. I&#8217;m actually glad that I passed the Challenge before the unlimited time period rule was released. I learned a lot about myself and how to manage my emotions under a timed stress period.<\/p>\n<p><strong>What was the hardest obstacle in your trading journey?<\/strong><\/p>\n<p>The hardest obstacle in my trading journey has to be the losing streaks. Having a loss after loss and still coming back to place trades when my signal came up was challenging. But, again, since trading is a probability game, I knew I had to take the chance. You can see my equity curve for the second attempt at the FTMO Challenge. That second attempt at the FTMO Challenge tested my psychology to the max.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=tradersqa\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546404 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p><strong>What would you like to say to other traders that are attempting an FTMO Challenge?<\/strong><\/p>\n<p>Have a positive edge. Stay calm. Know that it&#8217;s a probabilities game. You NEED to place trades once your signal comes up. You’ll win the game if you keep a positive RR ratio and size your positions right. Winning a trade doesn&#8217;t make you smart and losing a trade doesn&#8217;t make you dumb.<\/p>\n<h3>Trader Buhle: “The reality about trading is that you have to work smart, not hard.”<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-582004\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Buhle-225x300.jpg\" alt=\"\" width=\"225\" height=\"300\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Buhle-225x300.jpg 225w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Buhle-773x1030.jpg 773w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Buhle-768x1024.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Buhle-1152x1536.jpg 1152w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Buhle-1536x2048.jpg 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Buhle-1125x1500.jpg 1125w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Buhle-529x705.jpg 529w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Buhle-scaled.jpg 1920w\" sizes=\"(max-width: 225px) 100vw, 225px\" \/><\/p>\n<p><strong>What do you think is the key to long-term success in trading?<\/strong><\/p>\n<p>I think it’s just to stick with what works for you. The hardest part of trading is the beginning and forming a strategy that you&#8217;re confident in. It took me years and years and years to actually start believing in myself and what I was doing. I&#8217;m about to start making money and I really deserve it for myself, so I think that for long-term success, I&#8217;ll just have to keep doing exactly what I&#8217;m doing while keeping a good mental state and routine and managing my money well. It will be far easier for me now to do that because I feel good about myself for once. I had to focus and keep a good morale while life was just kicking me down so now that I&#8217;ve achieved the goal of being a professional trader, it will be far easier to trade in a good mind space. I&#8217;ve already gone through the storm that I thought would never end. Self-belief is everything and it’s hard to acquire, but not impossible. Also, I think what&#8217;s key is to keep on leveling up your trading lots and accounts as you level up in life, but patiently and calculated, just like everything is in trading. And, finally, I think that staying in your own lane is very important for long-term success, don&#8217;t rush yourself to be rich in a second, it’s a process and if you trade in line with your goals and get money consistently, you&#8217;ll get there faster than you think. Don&#8217;t compare yourself to others, not just traders, just normal people on Instagram or other locals in your city who look successful and try to be like them. Success is relative. It’s about being the best version of yourself and making yourself happy while making money and consistently making more money, that’s success.<\/p>\n<p><strong>How would you rate your experience with FTMO?<\/strong><\/p>\n<p>A rollercoaster. I&#8217;ve failed so many Challenges. I&#8217;ve been trying to trade and be successful so my mother can see it. She supported me so much and unfortunately passed away 2 years ago. It was very hard, but I had to keep going&#8230;. I then spent so much of her money I inherited on the FTMO Challenges desperately trying to make something of myself and make her proud, but I still had a lot to learn about trading and the psychology behind it, and my mom’s death just made it even harder so I would be erratic on the charts and just blow so many of them. You can see on my profile how many Challenges I bought and failed, its too many of them. I had to learn how to trade within the FTMO rules, find the right lot sizes and the amount to risk per trade to make sure that I don&#8217;t blow accounts and to make sure my mind is intact. I had a few fights with the live support sometimes because of just how unfair I thought the rules were towards me, like when my active trade reaches the Daily Loss Limit, but it doesn’t close there, my account will still get flagged and it made me so angry. I laugh about it now, but the rules are the rules and when my trading really progressed, I don&#8217;t even come near the Daily Loss limit so it’s not a problem anymore. It forces you to discipline your trading and really iron out your strategy, like a teacher spanking you for not doing your homework. FTMO really makes you a better trader and I love you guys for that. My mom would be so proud of me, and I appreciate what your platform has done for my trading.<\/p>\n<p><strong>Describe your best trade.<\/strong><\/p>\n<p>Hard to call a best trade, because in my definition, what I would call a best trade is me executing a trade at a sweet area where it&#8217;s already trending or ready to trend and it’s gone to my 3rd Take Profit which is usually like 25 pips, and I always take trades that hit TP1 or 2 so I know what to expect. BUT I did take this one trade that made a double bottom on the support of an uptrend on the 4H, and I forgot to place a take profit on 2 of my 4 positions. I went to go buy some soda and when I came back, it seemed there was news that happened, and it FLEW up about 80 pips. My TPs were meant to go up to 25 pips, so I got way more than I expected there so quickly. It was great.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-582038\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Buhle-trades.png\" alt=\"\" width=\"902\" height=\"1304\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Buhle-trades.png 902w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Buhle-trades-208x300.png 208w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Buhle-trades-712x1030.png 712w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Buhle-trades-768x1110.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Buhle-trades-488x705.png 488w\" sizes=\"(max-width: 902px) 100vw, 902px\" \/><\/p>\n<p><strong>What do you think is the most important characteristic\/attribute to become a profitable trader?<\/strong><\/p>\n<p>Patience. Definitely the most difficult one because we all want to make it and we have pressure on us to do something, to be active all the time and to get results but the reality about trading is that you have to work smart, not hard. Well, smart and hard at the same time if you will, but more smart. Chasing a trade will always scramble your emotions and make you take low probability trades which may mess with your profits and your win rate and overall, your confidence. Keeping your head held high and trading with confidence is KEY and how you do that is by being patient, following your plan and letting the trades fall on your lap. Trade comes plenty every day and I got to a point where I truly realized that I don&#8217;t need to be going out of my way forcing trades every hour and stressing. If I wait one hour a trade might come. If I wait 2 hours a trade might come. Sometimes a trade might come only after 5 hours of me waiting and being idle, then on the other hand it could be 15 minutes after waking up, a trade might come. Or you can even get 4 legitimate trades within the space of 3 hours. Trades are guaranteed to come one way or another, you just must sit tight and TRUST the process. If you trust the process, it will reward you. Learn to be patient, that is being productive. It may sound like an oxymoron but that&#8217;s the business that we&#8217;re in. I know it’s hard especially when life is weighing you down, it’s hard to just be calm and wait while you&#8217;re thinking about failure all the time and just wanting to make it, but it is possible.<\/p>\n<p><strong>How did you eliminate the factor of luck in your trading?<\/strong><\/p>\n<p>A lot of trial and error. I recorded my trades so much and made records on paper of what I did here and there, how I did it and how often it wins. I trade so much and wrote down so many notes to narrow down my trading and try to take the best trades only, so much that it got to a point where it became an instinct to me. Like muscle memory. I&#8217;ve seen the patterns and the candlestick behaviour on my pair so much that subconsciously, I knew exactly what it would do, and any position and I know when to just sit and not do anything. There’s no shame in doing nothing and waiting for the signal to act. Of course, on top of the extensive rules that I have printed on my wall, it’s very important to be disciplined and follow them. I forced myself to read my rules every morning and before I go to bed at night to make sure I don&#8217;t repeat mistakes that I shouldn&#8217;t be repeating at all. There&#8217;s no luck in trading a pair over and over for years, absorbing its movement and activity so much to the point that it feels like pure instinct to know how it moves, when it moves and what it does when it’s exhausted etc. That’s repetition and preparation. I know GBPUSD like the back of my hand and took a lot of learning. Also, to eliminate luck I think it’s important to trade very few pairs and study them. Don’t just learn their chart like you preparing for an exam, really study it. Follow it, see the common candlestick formations that it likes, see how it retraces, see what time of the day it tends to really move, see what patterns it likes to make, see what it does when it consolidates, so much that you can spot the consolidation before it even begins consolidating. That&#8217;s when you really know that you&#8217;re intimate with your pair. Yeah, I think that&#8217;s it.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=tradersqa\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546397 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p><strong>What would you like to say to other traders that are attempting an FTMO Challenge?<\/strong><\/p>\n<p>Be kind to yourself. Allow yourself to learn while trading and not to beat yourself up. You will make mistakes, you&#8217;re human, but it’s about forgiving yourself for making them and as you improve your game, you will make less and less mistakes and you&#8217;ll make harmless mistakes. You&#8217;re still human, you will still make mistakes no matter how good you are but when you&#8217;re good, you make non-detrimental mistakes and that&#8217;s OKAY. You still earn and you are still a professional, it’s just the business. Don&#8217;t give up on getting the FTMO Account, if you stay on top of things, it will come, but be kind to yourself in the process. Allow yourself to learn.<\/p>\n<h3>Trader Egon: “Leverage must be strictly reduced!”<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-medium wp-image-582012\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Egon-296x300.jpg\" alt=\"\" width=\"296\" height=\"300\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Egon-296x300.jpg 296w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Egon-80x80.jpg 80w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Egon-36x36.jpg 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Egon.jpg 314w\" sizes=\"(max-width: 296px) 100vw, 296px\" \/><\/p>\n<p><strong>How did loss limits affect your trading style?<\/strong><\/p>\n<p>You can take a lot less risk than I did before. A maximum leverage of 2-4 times is acceptable at the same time, but even 4 times can be too much.<\/p>\n<p><strong>How has passing the FTMO Challenge and Verification changed your life?<\/strong><\/p>\n<p>I had a smaller account &#8211; 25 thousand &#8211; which I failed. I had to do constant work alongside it, and that&#8217;s why I failed because I couldn&#8217;t give it 100% attention. I got angry at this and opened two 100,000 accounts at the same time, in such a way that I became independent from my permanent job. So that I could fully concentrate on trading, I managed to become a trader with both accounts.<\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>The main trading plan was to keep leverage to a minimum, which I strictly adhered to. In addition, I analyzed the market, and my plan was formed from this. I mainly traded German and American stock indices, rarely touched foreign exchange. In addition, investing in individual stocks without leverage is life-threatening. Before your quick report, I shorted NVIDIA, approx. with a leverage of 0.5. I wanted to save it for the next day, then luckily the alarm bell rang. If I transfer that position to the day after the quick report, I wouldn&#8217;t be able to write this questionnaire now&#8230;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-582046\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Egon-trades.png\" alt=\"\" width=\"905\" height=\"1301\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Egon-trades.png 905w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Egon-trades-209x300.png 209w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Egon-trades-716x1030.png 716w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Egon-trades-768x1104.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Egon-trades-490x705.png 490w\" sizes=\"(max-width: 905px) 100vw, 905px\" \/><\/p>\n<p><strong>Has your psychology ever affected your trading plan?<\/strong><\/p>\n<p>Very. When I was already close to the goal &#8211; a couple of $100 was missing &#8211; I wanted to force success. The result of this was that the market sent me back to the starting line, essentially, I had to start from scratch to build my profit. I&#8217;ve been trading for a long time, but the set of conditions that FTMO sets up is simply a different trade than before. It takes time until one learns to adapt to this. (I will add that this is not a criticism, because this set of conditions is good for traders and good for FTMO).<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/scaling-plan?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=tradersqa\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546367 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p><strong>What was the most difficult during your FTMO Challenge or Verification and how did you overcome it?<\/strong><\/p>\n<p>As I said in the previous point, when I was already very close to the goal, I had to deal with it emotionally. There should have been a profit of $300 by the end of the day, but it ended up being in a loss of $3,000. I managed to deal with it by letting it go so I could hurry. When the bill ended up like this, I finished it the next day.<\/p>\n<p><strong>What would you like to say to other traders that are attempting an FTMO Challenge?<\/strong><\/p>\n<p>Be patient! With these conditions, the game is a little different than without them! Leverage must be strictly reduced!<\/p>\n<h3>Trader Khurram: “Having a plan is essential for achieving trading success.”<\/h3>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-582020\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Khurram.jpg\" alt=\"\" width=\"208\" height=\"255\" \/><\/p>\n<p><strong>What do you think is the most important characteristic\/attribute to become a profitable trader?<\/strong><\/p>\n<p>A good trader always knows the reward-to-risk ratio of every trade. A good trader cuts their losses instead of hoping that the trade will turn around. A good trader allows their profits to run until an exit signal based on their trading strategy is triggered.<\/p>\n<p><strong>How would you rate your experience with FTMO?<\/strong><\/p>\n<p>The FTMO Challenge increased my trading self-esteem and improved my risk management. Trading an account size this big showed me that 1% is more than enough risk to make a good amount of money and that I can remove a huge aspect of emotion in my trading.<\/p>\n<p><strong>What inspires you to pursue trading?<\/strong><\/p>\n<p>Freedom to work from anywhere and successful trading is all about knowledge, experience, and discipline, and you can achieve these virtues anywhere with access to the markets.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-582054\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Khurram-trades.png\" alt=\"\" width=\"906\" height=\"1324\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Khurram-trades.png 906w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Khurram-trades-205x300.png 205w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Khurram-trades-705x1030.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Khurram-trades-768x1122.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/07\/Khurram-trades-482x705.png 482w\" sizes=\"(max-width: 906px) 100vw, 906px\" \/><\/p>\n<p><strong>What do you think is the key to long-term success in trading?<\/strong><\/p>\n<p>Discipline helps you preserve capital and that is at the core of being a successful trader. If you take care of your capital, then the profits will take care of themselves. This is in a way an extension of the previous point on discipline. A trader&#8217;s job is to manage risk.<\/p>\n<p><strong>Do you have a trading plan in place, and do you follow it strictly?<\/strong><\/p>\n<p>Having a plan is essential for achieving trading success. A trading plan should be written in &#8220;stone” but is subject to reevaluation and can be adjusted along with changing market conditions. A solid trading plan considers the trader&#8217;s personal style and goals.<\/p>\n<p><strong>One piece of advice for people starting an FTMO Challenge now.<\/strong><\/p>\n<p>The one piece of advice I would give to new people starting an FTMO Challenge and for my future self when taking an FTMO Challenge again would be not to rush. If you have a consistent trading strategy and you backtested it and it works, then don&#8217;t fall under the pressure that you need to take trades.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As the author of this statement says, it may sound a bit like an oxymoron, but it is similar to the statement that less is sometimes more. Doing as many deals as possible with the goal of making a quick buck may not be the right path to success. In most cases, it&#8217;s much more [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":582096,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[672],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/581995"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=581995"}],"version-history":[{"count":9,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/581995\/revisions"}],"predecessor-version":[{"id":584178,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/581995\/revisions\/584178"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/582096"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=581995"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=581995"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=581995"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}