{"id":584353,"date":"2023-08-04T13:50:09","date_gmt":"2023-08-04T11:50:09","guid":{"rendered":"https:\/\/ftmo.com\/?p=584353"},"modified":"2023-08-04T14:55:08","modified_gmt":"2023-08-04T12:55:08","slug":"do-you-want-to-improve-your-long-term-results-try-a-lower-rrr","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/do-you-want-to-improve-your-long-term-results-try-a-lower-rrr\/","title":{"rendered":"Do you want to improve your long-term results? Try a lower RRR"},"content":{"rendered":"<p><em>We have written several times about the importance of getting the risk\/reward ratio right. Many traders believe that a higher RRR should lead to higher returns, but this statement is not very accurate. A lower RRR is an even better solution for many traders as it can provide them with much-desired stable returns.<\/em><\/p>\n<p>Many traders feel that if they achieve a low RRR, they will not be able to make stable profits over the long term and will end up out of money. In reality, it&#8217;s a little different with a low RRR, and for many traders, it can instead be a path to more stable results.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/why-is-it-important-to-have-a-consistent-rrr\/\">There is virtually no ideal RRR that is suitable for every trader<\/a>. Once you start speculating and figuring out what might work best for your trading style, you also need to take into account the success rate of your trades. The key, in short, is to achieve a combination of success rate and RRR that will lead to long-term results.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=lowrrr\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546397 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h2>A high RRR is not for everyone<\/h2>\n<p>Some traders are able to wait for every fifth winning trade, hoping to eventually reach an RRR of 10. They don&#8217;t have to worry about the success rate of trades because they are sure that even after a long series of losing trades, one winning trade will come along that will make up for those losses and eventually put the account in profit<\/p>\n<p>For someone, a higher win rate is much more acceptable, but a high RRR is probably not achievable. In fact, if a trader expects to achieve a high RRR along with a high win rate, but fails to do so, he may be in trouble. This often leads to mistakes such as manipulating Stop Losses, not following Take Profits, not adjusting the strategy conceptually, etc. In the end, the profit generated from winning trades is lower than the losses, and this does not match the trader&#8217;s expectations. Expectation is one of the main factors in the resulting satisfaction or, on the contrary, disappointment. Unfulfilled expectations then lead to psychological &#8220;discomfort&#8221; and we all know that without psychological well-being, good results are hard to achieve.<\/p>\n<h2>A low RRR as a solution to the problem<\/h2>\n<p>When a trader enters a trade with the expectation that his profit will be equal to or even slightly lower than his potential loss, but because of this he has a high success rate, this can have a positive effect on his mental state and ultimately on his results. Of course, counting on a 1:10 ratio of gains and losses to lead to positive long-term results is probably not the best idea, but having an RRR of around 1 may already make sense in the long run.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=lowrrr\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546404 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p>Generally, high RRRs are used more by short-term traders and scalpers who are able to make several trades per day, and even after several losses are able to end the day with a profit. At the same time, a trader needs sufficient risk tolerance to take this approach. However, not everyone has that.<\/p>\n<p>When you are one of the traders with a lower risk tolerance and you simply don&#8217;t want to deal with your trade ending prematurely every time and then turning in the right direction, a lower RRR, along with fewer trades and a slight expansion of stop losses, may be one solution.<\/p>\n<p>For traders who are not chasing quantity but choose their trades carefully and execute one or two trades a day, a lower RRR may also be useful. This approach usually goes hand in hand with larger Stop Losses in terms of points and longer duration trades if the RRR is too high. Not everyone is able to maintain these, especially if they have the ability to watch the charts virtually all day. Here again, a lower expected RRR may be the solution, leading to more frequent profitable trades and the associated better psychological well-being.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/scaling-plan\/?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=lowrrr\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546367 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p>There is no need to lower the RRR significantly. Just take the example where a trader would instead of an RRR of 3:1 choose an RRR of 1.5:1. In the first case, for example, he manages to end up in profit three times out of ten. With a loss of $1,000 and a profit of $2,000 per trade, this means that after ten trades he will end up with a profit of $2,000. However, it could very well be that a few trades fall just short of the Take Profit and end up in the red.<\/p>\n<p>In the latter case, all he needs is for two of those initially losing trades to end in profit (same stop loss, but he needs fewer points to make a profit and the profit will only be $1,500). With five profitable and five losing trades, his profit after ten trades will be $2,500. More profitable trades and more total profit are more interesting than a 30% success rate and less total profit.<\/p>\n<h2>Change is life<\/h2>\n<p>Adherence to strategy is very important for success, no doubt about it. But sticking to something that simply doesn&#8217;t work can also be a mistake. It can happen that a trader hones a strategy, tests it, tries it, and makes sure it works, but eventually, it turns out that market conditions have changed so that the strategy does not deliver the desired profits in the long run. What worked in the test may not produce the expected results in reality (whether due to errors in the test or changes in market conditions, etc.), and one of the reasons for this may be unrealistic expectations about the risk\/reward ratio. In this case, it may be better to try a change of approach.<\/p>\n<p>Understanding the principle of RRR and the success rate is one of the cornerstones of successful trading. However, to be able to reconcile these two variables, you need to be clear about your risk tolerance, adapt to market events and then set your strategy rules accordingly. Finally, it&#8217;s good to remember that Forex trading is not a sprint with quick profits, but a long-distance race where <a href=\"https:\/\/ftmo.com\/en\/consistency-is-very-important-for-success-in-trading\/\">consistency is the biggest benefit<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We have written several times about the importance of getting the risk\/reward ratio right. Many traders believe that a higher RRR should lead to higher returns, but this statement is not very accurate. A lower RRR is an even better solution for many traders as it can provide them with much-desired stable returns. Many traders [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":584482,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/584353"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=584353"}],"version-history":[{"count":9,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/584353\/revisions"}],"predecessor-version":[{"id":594878,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/584353\/revisions\/594878"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/584482"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=584353"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=584353"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=584353"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}