{"id":587501,"date":"2023-08-18T14:20:27","date_gmt":"2023-08-18T12:20:27","guid":{"rendered":"https:\/\/ftmo.com\/?p=587501"},"modified":"2024-02-13T15:25:20","modified_gmt":"2024-02-13T14:25:20","slug":"ftmo-academy-we-will-teach-you-how-to-trade","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/ftmo-academy-we-will-teach-you-how-to-trade\/","title":{"rendered":"FTMO Academy &#8211; we will teach you how to trade"},"content":{"rendered":"<p><em>At FTMO, we believe that financial education is essential for anyone who wants to succeed in the world of trading. Our new FTMO Academy brings you valuable information and guidance to help you navigate this world and avoid the most common mistakes and pitfalls that lurk in the markets.<\/em><\/p>\n<p>As a leader in the modern prop trading industry, we want to provide our clients with only the best products and services. We are looking for the best traders worldwide and FTMO Academy is exactly what has been missing from our portfolio. Because without sufficient insight and knowledge of the fundamentals of the financial markets, no trader has a chance to succeed in Forex.<\/p>\n<p><a href=\"https:\/\/academy.ftmo.com\/?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=academy\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-587969 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Blog-banner-Akademie-EN2.jpg\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Blog-banner-Akademie-EN2.jpg 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Blog-banner-Akademie-EN2-300x49.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Blog-banner-Akademie-EN2-768x125.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Blog-banner-Akademie-EN2-705x115.jpg 705w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p>The aim of our <a href=\"https:\/\/academy.ftmo.com\/\">FTMO Academy<\/a> is therefore to provide all traders who are interested in expanding their knowledge and expertise with the basic information and knowledge needed to understand the financial markets and the instruments traded. In step-by-step sessions, we will introduce you to the secrets of developing a trading strategy, or the basics of technical analysis, as well as money management and risk management. Finally, we&#8217;ll allow you to practice and test all the knowledge you&#8217;ve gained without having to worry about losing real money in the markets. For the most successful participants, we have prepared small bonuses to help increase their motivation.<\/p>\n<h2>Quick access<\/h2>\n<p>We have tried to make FTMO Academy as clear as possible so that everyone can find what they need, novice traders have an opportunity to go through the chapters one by one. In each chapter, you will find sections with text which also include appendices, as well as videos for those who don&#8217;t feel like reading.<\/p>\n<p>The lessons in the Academy are divided into four parts, in each part you will find several categories, and then each category contains several separate lessons. In the first part, which is dedicated to Basics, you will find categories dedicated to financial markets and Forex. In the second part, which is dedicated to analysis (Trading Analysis), you will find chapters with an introduction to technical analysis, statistical analysis, fundamental analysis, and sentiment analysis of the markets.<\/p>\n<p>The section dedicated to advanced traders (Advanced) will teach you how to combine the acquired knowledge and it also covers trading platforms. In the last section, dedicated to our FTMO Evaluation Process, we explain the basic rules you need to follow to pass an FTMO Challenge and a Verification.<\/p>\n<h2>Financial markets<\/h2>\n<p>In the first category of the Academy, within the section on the Basics, you will find four chapters. In the Introduction to Financial Markets you can learn the basics of what financial markets are, how the markets are divided, the difference between centralised and decentralised markets, and the basics of Forex.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-607597 size-large aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-10991-2-1030x485.jpg\" alt=\"\" width=\"1030\" height=\"485\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-10991-2-1030x485.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-10991-2-300x141.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-10991-2-768x362.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-10991-2-1536x724.jpg 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-10991-2-2048x965.jpg 2048w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-10991-2-1500x707.jpg 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-10991-2-705x332.jpg 705w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<p>In the second chapter, which is dedicated to the instruments traded on financial markets, we explain how stocks and stock indices, commodities, currency pairs, and cryptocurrencies are traded.<\/p>\n<p>In the third chapter, we will introduce you to trading terminology so that you can learn what Forex is, and, in addition, we will explain all the concepts and important terms you may encounter when trading. In chapter four we will then explain how contracts for difference (CFD), which you can trade at FTMO, work, how they differ from futures contracts, and what their main advantages for traders are.<\/p>\n<h2>Forex<\/h2>\n<p>Since the majority of traders, not only at FTMO, mostly trade currency pairs, the second category of the Basics section of the Academy is dedicated to Forex. In this category, you will find six chapters. In the very first chapter we will explain the basics of Forex in more detail and compare it with other types of financial markets. In the second chapter, we are describing the structure of Forex and talk about the main players in the world&#8217;s largest and most liquid market.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-607605 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-1-1030x486.jpg\" alt=\"\" width=\"1030\" height=\"486\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-1-1030x486.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-1-300x141.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-1-768x362.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-1-1536x724.jpg 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-1-2048x966.jpg 2048w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-1-1500x707.jpg 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-1-705x332.jpg 705w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<p>In chapter three, we talk about different groups of currency pairs that are traded on Forex, and you can also learn how some currencies are correlated with each other and how this can be used in trading. Since Forex is open 5 days a week and 24 hours a day, it is important to know which times are appropriate for trading certain currencies. We describe this in the fourth chapter of this category.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-607581 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-2340-1030x328.png\" alt=\"\" width=\"1030\" height=\"328\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-2340-1030x328.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-2340-300x96.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-2340-768x245.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-2340-1536x489.png 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-2340-2048x652.png 2048w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-2340-1500x478.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-2340-705x225.png 705w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<p>In chapter five, we discuss the strengths and weaknesses of each analytical approach that traders can use when trading. In the final chapter, we are explaining the principle of margin, which is an essential part of Forex trading.<\/p>\n<h2>Technical analysis<\/h2>\n<p>The second part of the Academy contains four categories, in which we describe all types of analysis that you can use in trading in more detail. The first category contains eleven chapters in which we explain the principles of technical analysis and all its aspects in detail. In the very first chapter, we introduce you to Japanese Candlesticks, which are the cornerstone of technical analysis for most traders. You will learn the most famous candlestick patterns that are used in trading.<\/p>\n<h3><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-607565 size-square-large aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-6-768x768.jpg\" alt=\"\" width=\"768\" height=\"768\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-6-768x768.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-6-300x300.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-6-1030x1030.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-6-80x80.jpg 80w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-6-36x36.jpg 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-6-180x180.jpg 180w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-6-705x705.jpg 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/c-6.jpg 1170w\" sizes=\"(max-width: 768px) 100vw, 768px\" \/><\/h3>\n<p>In the very next chapter, we&#8217;ll show you that you don&#8217;t have to use only candlestick charts in technical analysis, but you can also use other types of charts, such as <a href=\"https:\/\/ftmo.com\/en\/renko-chart-a-new-perspective-to-inform-a-trader\/\">Renko<\/a> or Heikin Ashi. In the third chapter, we will show you how you can detect if the market is moving sideways in a range or if it is in a trend. The fifth chapter concentrates on support and resistance, which are considered to be a very important part of technical analysis.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-607589 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Screenshot-2021-03-30-at-10.56.23-1030x551.png\" alt=\"\" width=\"1030\" height=\"551\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Screenshot-2021-03-30-at-10.56.23-1030x551.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Screenshot-2021-03-30-at-10.56.23-300x160.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Screenshot-2021-03-30-at-10.56.23-768x411.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Screenshot-2021-03-30-at-10.56.23-705x377.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Screenshot-2021-03-30-at-10.56.23.png 1320w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<p>The sixth chapter shows you how you can use a strategy that exploits areas where demand or supply prevails. In chapter seven, we look at the most familiar chart formations that are used by every trader who trades price action. The Fibonacci retracement is also considered to be a very popular tool among investors and we talk about it in chapter eight.<\/p>\n<p>In the next chapter, we look at frequently used indicators that are especially popular with novice traders. We also discuss how some of them can be used to detect divergences in chapter nine, and we explain how to detect breakout zones in chapter ten. In the last chapter of this category, we explain an approach of using different time frames in trading to find ideal entry signals.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-393926 size-full\" title=\"Analysis\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/4.png\" alt=\"Analysis\" width=\"1589\" height=\"921\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/4.png 1589w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/4-300x174.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/4-1030x597.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/4-768x445.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/4-1536x890.png 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/4-1500x869.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/08\/4-705x409.png 705w\" sizes=\"(max-width: 1589px) 100vw, 1589px\" \/><\/p>\n<h2>Statistical analysis<\/h2>\n<p>Statistics may be boring for many people, but its importance in trading is certainly not negligible and that is why we have dedicated a category to it. In the first chapter, we will tell you about backtesting and forward testing, which are essential when trying out a trading strategy. The second chapter is devoted to the Statistical Application, which we have developed for you to review interesting market statistics and useful information about individual instruments.<\/p>\n<h2>Fundamental Analysis<\/h2>\n<p>Although most Forex traders use technical analysis to make decisions about market entries and exits, fundamentals should not be underestimated. We have four chapters within the category on fundamental analysis in the Academy. In the first chapter, we introduce the most important economic news you should follow in the markets. This is not so much about making trading decisions as it is about not being surprised by increased volatility at the time these reports are announced. Every trader needs a good calendar to be aware of these news announcements in advance, and we&#8217;ll tell you about that in chapter two.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"size-large wp-image-607573 aligncenter\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-11409-1-1030x618.png\" alt=\"\" width=\"1030\" height=\"618\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-11409-1-1030x618.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-11409-1-300x180.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-11409-1-768x461.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-11409-1-1536x922.png 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-11409-1-1500x901.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-11409-1-705x423.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Group-11409-1.png 1932w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>In chapter three, we&#8217;ll show you how you can tell when investor sentiment is changing and when the markets are in a risk-on or risk-off state. Then, in the final chapter, we&#8217;ll show you some correlations between asset classes. These are particularly good to know if you are trying to diversify your positions across multiple instruments.<\/p>\n<h2>Sentiment Analysis<\/h2>\n<p>We&#8217;ve talked a bit about market sentiment in previous chapters, however, we&#8217;ll show you how you could use special reports called Commitments of Traders Reports in a separate chapter. These are published weekly by the Commodity Futures Trading Commission (CFTC).<\/p>\n<h2>Putting it all together<\/h2>\n<p>The third part of the Academy focuses on more advanced traders. In the first category, we look at how to put it all together, so the very first chapter is dedicated to building a robust trading strategy. In it, we show you what is good to know about your trading style before building a strategy, what markets to choose, and how to ultimately build that into the strategy. The next chapter looks at one of the most important areas in trading called risk management. It shows you how to work with risk, how much capital or account size you should trade with, <a href=\"https:\/\/ftmo.com\/en\/do-you-want-to-improve-your-long-term-results-try-a-lower-rrr\/\">how to set your RRR<\/a>, etc. In the next chapter, we will show you what you should think about when creating your own trading plan.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/returnrisk.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-401676\" title=\"Loss of capital\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2021\/04\/returnrisk.png\" alt=\"Loss of capital\" width=\"1287\" height=\"1099\" \/><\/a><\/p>\n<h2>Trading Platforms<\/h2>\n<p>The next category is dedicated to the trading platforms which are available to trade on with FTMO. In three chapters, we will describe all the main and important features of MetaTrader 4, MetaTrader 5, and cTrader and we also have tutorials on how to use them. In addition, <a href=\"https:\/\/ftmo.com\/en\/which-trading-platform-is-best-for-you\/\">you will learn which platform might be most suitable for your trading style<\/a>, and you can also find detailed descriptions of the mobile versions of all three platforms.<\/p>\n<h2>FTMO Evaluation Process<\/h2>\n<p>The last part of the Academy is devoted to our verification process, and is mainly focused on the basic rules for passing an FTMO Challenge and a Verification and then trading on the FTMO Account. You will learn all the essentials you need to know about what the minimum number of trading days means, what the Maximum Daily Loss and Maximum Loss are and about the difference between them, and, finally, what profit you will need to make to successfully complete our Evaluation Process.<\/p>\n<p><a href=\"https:\/\/academy.ftmo.com\/?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=academy\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-587977 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Blog-banner-Akademie-EN1.jpg\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Blog-banner-Akademie-EN1.jpg 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Blog-banner-Akademie-EN1-300x49.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Blog-banner-Akademie-EN1-768x125.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/08\/Blog-banner-Akademie-EN1-705x115.jpg 705w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h2>Final tests<\/h2>\n<p>Our Trading Academy is not just about education. After logging into your profile, you can take a test at the end of each chapter not only to review your newly acquired knowledge, but, if you are successful, you can also expect to receive an extra bonus. In short, we want you to be the kind of an FTMO Trader who understands what he ise doing, so we want to give you a little incentive not to neglect your education. You can track your progress in My Progress, which can be found in the top panel of the Academy. There you will also find out what we have prepared for you as motivation and how many correct answers you need to have to get these motivational bonuses.<\/p>\n<p>Finally, we have no choice but to wish you the best of luck in your studies and good luck not only in completing the tests, but also in your future trading career. We believe that after exploring our Academy, you will be much closer to successfully completing our Evaluation Process and trading successfully on an FTMO Account for up to $200,000 than you have been so far. Your goal of being a serious trader is within reach!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>At FTMO, we believe that financial education is essential for anyone who wants to succeed in the world of trading. Our new FTMO Academy brings you valuable information and guidance to help you navigate this world and avoid the most common mistakes and pitfalls that lurk in the markets. As a leader in the modern [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":587835,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/587501"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=587501"}],"version-history":[{"count":25,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/587501\/revisions"}],"predecessor-version":[{"id":607615,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/587501\/revisions\/607615"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/587835"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=587501"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=587501"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=587501"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}