{"id":590643,"date":"2023-09-01T15:20:21","date_gmt":"2023-09-01T13:20:21","guid":{"rendered":"https:\/\/ftmo.com\/?p=590643"},"modified":"2024-02-06T16:04:16","modified_gmt":"2024-02-06T15:04:16","slug":"get-to-know-the-history-of-ftmo","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/get-to-know-the-history-of-ftmo\/","title":{"rendered":"Get to know the history of FTMO"},"content":{"rendered":"<p><em>FTMO is a leading firm in the field of modern prop trading based in the Czech Republic. It was founded in 2015 under the name Získej účet (Get an Account). Within just a few years, it has become one of the world&#8217;s largest companies in its industry and one of the fastest-growing technology companies in the Central European region.<\/em><\/p>\n<p>The name of the company FTMO consists of the first letters of the names of four people (Filip, Tomáš, Marek, Otakar) who worked for the company at the time when the company decided to expand beyond the borders of the Czech Republic. Three of them are currently represented by the company&#8217;s top management.<\/p>\n<p>The company offers its customers <a href=\"https:\/\/ftmo.com\/en\/faq\/what-capital-will-i-trade-as-an-ftmo-trader\/\">special trading accounts<\/a> linked to monitoring applications. This allows traders to improve, especially in the area of risk management. To move to the next stage, the customer must go through a series of tests, for which he pays a certain fee, which is returned to him after fulfilling the conditions and with the first payout. Customers who make it to the final collaboration keep up to 90% of the profits made.<\/p>\n<h2>History<\/h2>\n<p>The company was founded by three students who, based on their own experience with undercapitalization in trading, decided to start a project that would help potential traders with insufficient funds. In addition, the goal was to help potential customers with financial discipline and the psychological side.<\/p>\n<p>In 2015, FF Trader and the Získejúčet.cz project were founded, which operated only in the Czech Republic and Slovakia. Although the founders did not receive support from their school&#8217;s student accelerator and faced countless technical and legal hurdles in the first year, they still managed to get the project off the ground. In 2016, the company received an investment that allowed it to expand its product offering with more capital.<\/p>\n<p><iframe loading=\"lazy\" title=\"Throwback thursday Marek - CTO, Co-founder | FTMO\" src=\"https:\/\/www.youtube.com\/embed\/erbFRXmpDV4\" width=\"1257\" height=\"707\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n<p>In 2017, the company decided to expand abroad as well under the name FTMO. This ultimately proved to be a crucial step for the company&#8217;s further development. A much larger market offers greater opportunities but also underpins the need to expand the product offering for customers and expand the team.<\/p>\n<p>The firm has gradually sought to improve its reputation among potential customers by offering new and better solutions and applications and, last but not least, gradually expanding its product offering to include accounts with more funds to trade. In addition, it started offering its own solution on the MetaTrader platform, which is completely independent of other brokerage companies.<\/p>\n<p>Then we also offered our clients the cTrader platform. Compared to MetaTrader, it offers a more modern look and more options and tools. In November 2023, we expanded our range of <a href=\"https:\/\/ftmo.com\/en\/which-trading-platform-is-best-for-you\/\">trading applications<\/a> to include the DXtrade cloud platform. This should suit traders who prefer to trade via the web interface and do not want to install the application on their computer.<\/p>\n<p>The founders of the company gradually tried to spread awareness of the project by participating in various trading conferences around the world. The highly competitive environment and constant comments from customers&#8217; experiences led the company to gradually expand the range of its services and applications while improving conditions for its customers. This is how it gradually became the market leader in the field of modern prop trading, which it essentially created.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=ftmohistory\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546397 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p>In 2020, the Czech brand Získejúčet was abolished and unified under one brand, FTMO, consolidating its position as a global brand in the modern prop trading industry. Back in February 2019, we introduced a new company logo that we felt better reflected our identity. Then in November 2020, we decided to simplify it in colour to its current black and white form. The need to maintain service quality at the highest level and to offer new and better services has led the company to rapidly expand its staff team in recent years. Their number has surpassed 150 in the last year and continues to grow rapidly.<\/p>\n<p>In 2022, the company moved to new representative premises in the centre of Prague in the Quadrio complex building near Národní třída. The desire not only to continually develop the company itself, but also to maintain its leading position in the modern prop trading industry is also reflected in personnel requirements. Thanks to this, we &#8220;have taken over&#8221; another quadrant in the Quadrio building with new offices. We moved into them in October 2023. We are constantly recruiting new people to offer our customers new and better products and services. These are by no means few compared to the competition, and you can read about them below.<\/p>\n<p>We also made two acquisitions in 2023. The first was <a href=\"https:\/\/ftmo.com\/en\/quantlane\/\">Quantlane<\/a>, a quantitative trading firm that trades on several global exchanges, founded in 2014. The second acquisition was eVisions, a full-service online marketing agency providing Internet advertising services.<\/p>\n<h2>Evaluation Process<\/h2>\n<p>In the first part of the <a href=\"https:\/\/ftmo.com\/en\/#evaluation-process\">Evaluation Process<\/a>, the FTMO Challenge, the client\/potential trader must demonstrate trading skills, the ability to correctly manage risk and discipline. Originally the trading period for the FTMO Challenge was 30 days and in the Verification phase, it was extended to 60 days. However, in order to improve conditions for traders, we decided to offer our customers <a href=\"https:\/\/ftmo.com\/cs\/obchodujte-bez-limitu-jak-dlouho-chcete\/\">an unlimited trial period<\/a>, which relieves them of the stress to achieve a certain return in a limited period of time. Once the rules are met, they will proceed to the second round, which is mainly used to confirm that the trader is able to follow the <a href=\"https:\/\/ftmo.com\/en\/#ftmo-section-objectives\">Trading Objectives<\/a> and make a stable profit over the long term.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=ftmohistory\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546404 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p>We want to constantly push the modern prop trading industry forward and offer only the best conditions to our traders. That is why we have come up with two special programmes at the end of 2023. These can motivate those, who are interested in our services and our FTMO Traders to perform even better. At the same time, we offer them added value that is virtually unrivalled in the industry.<\/p>\n<p>The <a href=\"https:\/\/ftmo.com\/en\/how-to-become-one-of-the-best-forex-traders\/\">Premium Programme<\/a> is designed for traders with the best and most consistent results. Within this programme, we offer top traders several interesting bonuses and benefits. These include 90% profit sharing, a free FTMO Challenge, an increase in the maximum allocation to 600k\/1 million USD, FTMO Challenge of 400k USD, instant payouts, or even a job offer with all the benefits of an institutional trader.<\/p>\n<h2>Products and services<\/h2>\n<p>FTMO offers its clients several applications and products that it develops itself. This enables it to respond better to new developments in the industry, and, in particular, to changes in the financial markets.<\/p>\n<p><strong>MetriX<\/strong> is an innovative web-based application that provides traders with a comprehensive overview of how they are doing and their overall ongoing performance. In addition to the statistics and summaries of each trading day contained therein, the trader has access to a trading journal.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/want-feedback-try-the-trading-journal\/\"><strong>The Trading Journal<\/strong><\/a> is used to archive the trader&#8217;s trading results. The aim of the application is to simplify the entire process, the importance of which is underestimated by many traders for successful trading. The trader can access all of his trades, sort them according to various parameters, and also search for specific trades by tags or order numbers.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-428673\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture.png\" alt=\"\" width=\"1179\" height=\"852\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture.png 1179w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture-300x217.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture-1030x744.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture-768x555.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture-705x509.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture-24x17.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture-36x26.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/04\/Journal-picture-48x35.png 48w\" sizes=\"(max-width: 1179px) 100vw, 1179px\" \/><\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/statistics-boring-but-necessary-for-better-results\/\"><strong>The Statistical application<\/strong><\/a> shows traders meaningful, historical data-based probabilities of market behaviour that they can use to their advantage.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/mentor-app-is-essential-for-disciplined-traders\/\"><strong>The Mentor app<\/strong><\/a> focuses on trader discipline to help them achieve better results. It is suitable for all traders, but is best suited for those who struggle with discipline and adhering to the basic rules of risk management and money management. The application monitors the trader&#8217;s loss limits and the number of positions they open daily, and anyone can set these limits exactly according to their needs.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/do-not-underestimate-account-analysis\/\"><strong>The Account Analysis<\/strong><\/a> provides an unbiased view of the trading results of the company&#8217;s clients. When it was founded, FTMO planned to offer this service to its clients. It is one of the main benefits that fits into the concept of educating traders and improving their trading skills. Some statistics appear in MetriX and Account Evaluation, but the two tools complement each other perfectly.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/traders-analysis-long-term-statistics-you-wont-find-elsewhere\/\"><strong>Trader Analysis<\/strong><\/a> is aimed at all traders who want to analyze their entire history at FTMO. When creating this app, we assumed that in addition to quality, long-term data history is also important if data analysis is to be useful in strategy creation and testing. Within Trader Analysis, each trader has comprehensive statistics on all the trades they have executed through FTMO. This applies to both FTMO Challenge and Verification, as well as FTMO Accounts.<\/p>\n<p><strong>Equity Simulator<\/strong> is an application that allows a trader to test, based on probabilities, his strategy or the money management and risk management that the trader applies in his trading.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/ftmo-quick-trade-manager-new-options-in-metatrader\/\"><strong>Quick Trade Manager<\/strong><\/a> is another extension of the MetaTrader trading platform, the main aim of which is to simplify and speed up order entry directly in the application, as well as to easily and quickly determine position size at the desired Stop Loss and Take Profit levels.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-426248\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/02\/12-2.png\" alt=\"\" width=\"1659\" height=\"759\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2022\/02\/12-2.png 1659w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/02\/12-2-300x137.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/02\/12-2-1030x471.png 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/02\/12-2-768x351.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/02\/12-2-1536x703.png 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/02\/12-2-1500x686.png 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/02\/12-2-705x323.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/02\/12-2-24x11.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/02\/12-2-36x16.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2022\/02\/12-2-48x22.png 48w\" sizes=\"(max-width: 1659px) 100vw, 1659px\" \/><\/p>\n<p>For traders seeking a comprehensive overview of crucial macroeconomic news seamlessly integrated into the MetaTrader 4 or 5 platform, the <a href=\"https:\/\/ftmo.com\/en\/do-you-want-to-keep-track-of-the-fundamentals-try-the-ftmo-news-indicator-free-for-metatrader\/\">FTMO News Indicator<\/a> for MetaTrader stands out as an ideal solution. This application ensures traders stay informed, eliminating the risk of overlooking significant fundamentals that could potentially impact their trading negatively.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/do-you-want-to-manage-risk-seriously-use-our-calculators\/\"><strong>Trading calculators<\/strong><\/a> are designed for all traders who need a perfect overview of all open positions and want to manage their risk seriously. The pip calculator calculates how much money the trader is risking for a given number of pips and a given position size in a given currency. The margin calculator then calculates the exact amount required to open the position.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/ftmo-academy-we-will-teach-you-how-to-trade\/\"><strong>FTMO Academy<\/strong><\/a> aims to provide all our traders interested in expanding their knowledge with the basic information and knowledge needed to understand the financial markets and the instruments traded on them. At FTMO, we are aware that no trader stands a chance of succeeding in forex trading without sufficient insight and knowledge of the basics of how the financial markets work.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/performance-coaches\/\"><strong>A performance coach<\/strong><\/a> offers support to traders who are struggling with the psychological side of their trading and provides them with valuable recommendations on how to behave in certain situations. Psychology is also one of the overlooked, yet important aspects of Forex trading. FTMO offers this service as one of the few companies engaged in trading and prop trading.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/scaling-plan\/?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=ftmohistory\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546367 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h2>Awards<\/h2>\n<p>In 2019, the company successfully won the Rising Stars (now Growth Stars) category in the Deloitte Fast 50 awards, given to promising, fast-growing young companies. Back then it was still called FF Trader with a growth rate of 1,465%. In 2020, the company managed to defend this position, already under the name FTMO, and this time with a growth rate of 2,356%. In 2021, the company was already competing in the main category and came out on top with a record four-year growth of 39,432%. This has never been done before in the 22-year history of the competition. In 2022, the company was able to <a href=\"https:\/\/ftmo.com\/en\/this-year-we-have-again-managed-to-defend-our-position-as-the-fastest-growing-company-in-the-ce-region\/\">repeat this success and again won the title of the fastest-growing company in Central Europe with a growth of 25,255% over four years<\/a>.  At the end of 2023, we managed to defend our victory in this competition for the second time, this time with a growth of 5,815% over the last four years.<\/p>\n<p>Before that, however, we scored another success in early 2023. At the beginning of 2023, we had another success when we made it to the final five of the EY Entrepreneur of the Year 2022 Czech Republic competition and won the Technology Entrepreneur of the Year category. EY Entrepreneur of the Year is a global competition organized by the consulting company EY since 1996 in the USA and since 2000 also in the Czech Republic. The criteria are comparable in each country and the winners are selected by a jury composed mainly of winners from previous years.<\/p>\n<p>In late November 2023, we were proud participants at the Finance Magnates London Summit 2023, a premier event in the financial world. This gathering brings together key figures and influencers in the finance industry. Our founders took part in a panel discussion, delving into the origins and future trajectory of modern prop trading. Notably, we clinched the prestigious &#8220;Best Prop-Trading Firm\/Provider&#8221; award, a testament to our commitment and excellence in the field.<\/p>\n<h2>Testimonials<\/h2>\n<p>In conclusion, we can add that the best indicator that our efforts to offer the best possible products and services are not in vain are the positive reviews from our customers and FTMO Traders on independent review platforms such as Trustpilot, etc. <a href=\"https:\/\/ftmo.com\/en\/testimonials\/\">Here you can see some interviews with our traders, as well as some of the records<\/a> we were able to achieve or break during our time in the market.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>FTMO is a leading firm in the field of modern prop trading based in the Czech Republic. It was founded in 2015 under the name Získej účet (Get an Account). Within just a few years, it has become one of the world&#8217;s largest companies in its industry and one of the fastest-growing technology companies in [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":590865,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[33],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/590643"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=590643"}],"version-history":[{"count":34,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/590643\/revisions"}],"predecessor-version":[{"id":606650,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/590643\/revisions\/606650"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/590865"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=590643"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=590643"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=590643"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}