{"id":592732,"date":"2023-09-26T11:05:56","date_gmt":"2023-09-26T09:05:56","guid":{"rendered":"https:\/\/ftmo.com\/?p=592732"},"modified":"2023-10-23T14:52:36","modified_gmt":"2023-10-23T12:52:36","slug":"how-ftmo-works","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/how-ftmo-works\/","title":{"rendered":"How FTMO works"},"content":{"rendered":"<p><em>FTMO started in 2015 as a university project by a few students who wanted to make a living by trading. The goal of the project was to find successful traders and provide them with the tools, education and generally the environment to make their dream come true. For 8 years now, FTMO&#8217;s mission is still the same &#8211; to provide quality services to our clients, push them further and enable them to trade for a living.<\/em><\/p>\n<p>For this purpose, FTMO has developed a way to objectively identify and educate talented traders in the ranks of those interested in trading, without the risk of financial loss on the part of clients. The process of this identification and validation of traders&#8217; skills consists of access to online training programs and analytical applications and an online platform that allows simulated trading in various financial instruments.<\/p>\n<p>In addition to the above, FTMO itself actually trades on its own account with its own capital, using, among other things, data from simulated trades executed by selected FTMO clients.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=howftmoworks\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546397 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h2>How does it all work?<\/h2>\n<h3>FTMO Challenge<\/h3>\n<p>At the beginning of the process is the now well-known FTMO Challenge. The FTMO Challenge is a comprehensive digital product consisting of educational materials, trading and analytical applications and, in particular, a simulation of real trading with currency pairs and other financial instruments where FTMO clients can experience what it is like to be a real trader. For this purpose, the client has a so-called demo account with information on the development of the real financial markets, where he trades with fictitious capital that he\/she is to try to evaluate, in accordance with pre-set transparent objectives and rules.<\/p>\n<p>The main purpose of this simulated trading is to test the talents and skills of FTMO clients in trading in the financial markets. If the client demonstrates his\/her skills in both the FTMO Challenge and  Verification, he\/she can apply for a so-called FTMO Account &#8211; and thus have the opportunity to receive a real financial reward for this simulated trading (more in the FTMO Account section).<\/p>\n<h4>Rules<\/h4>\n<p>The rules set up for the simulated trading in the FTMO Challenge are based on the real rules applied in financial market trading by investment companies and also in real trading on FTMO&#8217;s own account, especially in the area of risk management. The application of these rules therefore contributes to the education of clients in the area of trading and at the same time provides FTMO with objective parameters for the selection of clients whose trades it will monitor and, where appropriate, emulate in its trading on real financial markets.<\/p>\n<p>If the trader meets all the rules of the FTMO Challenge, he\/she proceeds to the second phase of the Evaluation Process &#8211; Verification, which is briefly described below. Otherwise, he\/she is not allowed to proceed.<\/p>\n<p>FTMO Challenge is beneficial for our clients even if they fail to meet all the rules and advance further in the process, as our product is mainly aimed at client education. This is done through simulated trading as a practical part of the training, as well as by creating and making available various unique educational videos and other materials, analytical applications and outputs on how successful our clients&#8217; simulated trading is. At a later stage, there is an opportunity to participate in sessions with a performance coach, etc. The FTMO Academy has been launched to educate clients further. At the same time, the very act of simulated trading, where clients try to follow the set rules, takes them further and teaches them how to trade investment instruments without the risk of losing their or other people&#8217;s capital. Everyone who participates in an FTMO Challenge receives the benefits of this unique experience.<\/p>\n<h3><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=howftmoworks\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546404 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/h3>\n<h3>Verification<\/h3>\n<p>Verification has very similar rules to FTMO Challenge. The only difference is a lower requirement for the appreciation of notional capital and therefore, less pressure on the trader.<\/p>\n<p>The purpose of the Verification is essentially to verify that the results achieved in the FTMO Challenge were not a mere coincidence and that the client is indeed able to trade successfully while meeting the set rules.<\/p>\n<p>In case the client successfully meets the rules set for the Verification, he\/she proceeds to the last part and gains access to the so-called FTMO Account &#8211; see below.<\/p>\n<h3>FTMO Account<\/h3>\n<p>Even in the case of an FTMO Account, the FTMO Trader has access only to a simulated demo account with fictitious capital, i.e. there is no trading with real funds. Therefore, the Trader never gains access to a real &#8220;live account&#8221; or &#8220;margin account&#8221; etc. However, the FTMO Trader will receive a real financial reward for his trading on the FTMO Account, as long as his trading is profitable and there is no violation of the contractual conditions. The amount of this reward depends on the success of the trades executed through the FTMO Account.<\/p>\n<p>By virtue of the FTMO Account Agreement, the FTMO Trader agrees that his trading data may be used by FTMO for trading on its own account. Therefore, FTMO can actually profit from the simulated trading performed by FTMO Traders.<\/p>\n<p>We only add that the FTMO Trader always receives its contractual remuneration, regardless of whether or not FTMO has decided to use the trade data in its live trading.<\/p>\n<h3><a href=\"https:\/\/ftmo.com\/en\/scaling-plan\/?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=howftmoworks\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546367 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/h3>\n<h2>Trading infrastructure of FTMO<\/h2>\n<p>All simulated trading within FTMO takes place on FTMO&#8217;s own infrastructure using MT4, MT5 and cTrader trading platforms from external providers. In this way, FTMO strives to provide clients with the best possible experience that emulates the reality of trading various financial instruments as closely as possible.<\/p>\n<p>Although the entire environment and trading is simulated, real data provided by liquidity providers is available in the platform. Thus, in the case of simulated trading performed by FTMO Traders, liquidity providers only provide data on the prices of individual instruments and never perform their standard function of a market maker, i.e. an entity supplying liquidity to market participants, as all trading takes place exclusively in a simulated environment on a demo account. FTMO only uses these liquidity provider services for its internal trading on its own account, where it invests its own capital in real trading on the financial markets.<\/p>\n<p>Execution of simulated trades within the Free Trial, FTMO Challenge, Verification and after obtaining the FTMO Account always takes place under the same execution conditions, which are always transparently available to our clients and which correspond to our efforts to make the conditions of real trading as close as possible. There is never any hidden intervention or application of specific conditions to specific clients on FTMO platforms. All clients within each trading platform are always set uniform terms and conditions, regardless of trading strategy, whether they profit or not, etc.<\/p>\n<p>The offer of individual symbols, their commissions and spreads are always available on the trading platforms as well as on the ftmo.com website.<\/p>\n<h2>Copying trades and execution of FTMO trades<\/h2>\n<p>As mentioned above, FTMO trades for its own account, among other things, based on data obtained from its clients&#8217; FTMO Accounts. In this regard, FTMO continuously monitors and analyses the trades executed by FTMO Traders in the demo environment and subsequently evaluates (notably based on the use of its internal algorithm) whether trades are executed for FTMO&#8217;s own account, where applicable.<\/p>\n<p>This execution occurs without any impact on FTMO&#8217;s clients and their simulated trading. The Trader is in no way influenced by FTMO&#8217;s trading. The trader receives a reward from his simulated profit on the FTMO Account even if his trades were not executed in the internal trading of FTMO.<\/p>\n<h2>Modern prop trading and traditional proprietary trading firms<\/h2>\n<p>The trading model we describe above is in recent years often referred to as modern prop trading. It was created as a suitable alternative for traders who (for various reasons) are undercapitalized and cannot or do not want to trade for traditional proprietary trading firms. There are fundamental differences between these worlds and each trading model has its supporters and detractors.<\/p>\n<p>In the case of modern prop trading firms &#8211; FTMO is a good example &#8211; there is no real order entry and execution on clients&#8217; demo accounts, so no real funds are involved in the process. However, the data obtained from FTMO Accounts is sometimes used for FTMO&#8217;s own funded trading on its own live <a href=\"https:\/\/ftmo.com\/en\/\">funded trading account<\/a> with real financial means. The demands on the client (the &#8220;trader&#8221;) are thus somewhat lower than in the case of classic proprietary trading firms.<\/p>\n<p>On the other hand, traditional proprietary trading firms most often trade directly in the real market environment on their own account via their own employees or freelancers. The company entrusts them with real funds, through which they then execute trades in the real financial markets on behalf of the company. The standard for traditional proprietary trading firms is to have relatively high demands on traders (experience, psychology, etc.) and to entrust their funds to a small group of selected traders.<\/p>\n<p>Read more about details and a <a href=\"https:\/\/ftmo.com\/en\/what-is-the-difference-between-proprietary-trading-and-modern-prop-trading\/\">comparison of the two trading worlds<\/a>.<\/p>\n<p>Individual modern <a href=\"https:\/\/ftmo.com\/en\/\">prop trading firms<\/a> may differ quite substantially in certain aspects of their operations. One example is the management of data obtained on simulated client trading. In the case of FTMO, there is the &#8220;copying&#8221; of trades and other activities described above.<\/p>\n<p>As FTMO trades on its own account, it also uses data on trades executed by FTMO Traders in selected cases. In order to further develop this activity and multiply its revenues, Quantlane, a quantitative dealing firm trading on several global exchanges, became part of the FTMO group.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-594047\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/09\/Quantlane-X-FTMO.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/09\/Quantlane-X-FTMO.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/09\/Quantlane-X-FTMO-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/09\/Quantlane-X-FTMO-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/09\/Quantlane-X-FTMO-705x115.png 705w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<p>Quantlane&#8217;s main focus is quality data processing (i.e. performing data analysis and creating quantum models, including on simulated trade data) and creating strategies, on the basis of which Quantlane’s traders subsequently trade on financial markets. By engaging a real proprietary trading firm like Quantlane, FTMO can both improve its services provided within the FTMO platform and further develop and change the world of classic proprietary trading.<\/p>\n<p>Would you like to learn more about Quantlane and topics related to modern prop trading and classic proprietary trading? Don&#8217;t forget to follow us on all social media. We have a lot of interesting content coming up where we will discuss these topics in more detail.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-594055\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/09\/Triko-Quantlane-X-FTMO-scaled.jpg\" alt=\"\" width=\"2560\" height=\"1708\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/09\/Triko-Quantlane-X-FTMO-scaled.jpg 2560w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/09\/Triko-Quantlane-X-FTMO-300x200.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/09\/Triko-Quantlane-X-FTMO-1030x687.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/09\/Triko-Quantlane-X-FTMO-768x512.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/09\/Triko-Quantlane-X-FTMO-1536x1025.jpg 1536w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/09\/Triko-Quantlane-X-FTMO-2048x1366.jpg 2048w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/09\/Triko-Quantlane-X-FTMO-1500x1001.jpg 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/09\/Triko-Quantlane-X-FTMO-705x470.jpg 705w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" \/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>FTMO started in 2015 as a university project by a few students who wanted to make a living by trading. The goal of the project was to find successful traders and provide them with the tools, education and generally the environment to make their dream come true. For 8 years now, FTMO&#8217;s mission is still [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":592735,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[33],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/592732"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=592732"}],"version-history":[{"count":10,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/592732\/revisions"}],"predecessor-version":[{"id":605724,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/592732\/revisions\/605724"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/592735"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=592732"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=592732"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=592732"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}