{"id":598146,"date":"2023-11-09T14:25:37","date_gmt":"2023-11-09T13:25:37","guid":{"rendered":"https:\/\/ftmo.com\/?p=598146"},"modified":"2023-11-10T14:29:05","modified_gmt":"2023-11-10T13:29:05","slug":"how-to-trade-in-low-volatility-markets","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/how-to-trade-in-low-volatility-markets\/","title":{"rendered":"How to trade in low volatility markets?"},"content":{"rendered":"<p><em>The forex market is characterized by its high liquidity and also interesting volatility, which means there are plenty of opportunities for trades. However, at the end of the year, and especially in the second half of December, liquidity in the markets may decrease and traders should adjust to those market conditions accordingly.<\/em><\/p>\n<p>The Forex market is the most liquid market in the world, with a daily volume in excess of $7 trillion. It is this high liquidity, combined with increased volatility, that makes forex trading so popular nowadays. However, there may be periods during the year when market liquidity declines, impacting volatility.<\/p>\n<h2>High volatility is not for everyone<\/h2>\n<p>For most traditional investors who invest their money for the long term in stocks or funds and ETFs, high volatility is not desirable. They are primarily interested in stable long-term returns, and periods of high volatility only bring nervousness to the markets. Short-term traders, on the other hand, use volatility to their advantage because it is the short-term fluctuations combined with leverage that provide them with opportunities to achieve desirable returns even with short-term trades.<\/p>\n<h2>Seasonal influences<\/h2>\n<p>In the financial markets, we see various seasonal effects throughout the year, with liquidity increasing or decreasing. There is a popular &#8220;Sell in May and Go Away&#8221; rule in the stock markets that is closely related to the holiday season. October is one of the most volatile months for stocks, and sometimes the Santa Claus rally is also mentioned, or the so-called January effect, when stock prices tend to rise.<\/p>\n<p>This effect is even more pronounced for commodities. <a href=\"https:\/\/ftmo.com\/en\/oil-a-fossil-fuel-but-also-the-most-traded-commodity\/\">Oil<\/a> and <a href=\"https:\/\/ftmo.com\/en\/natural-gas-a-strategic-resource-or-just-an-inflated-bubble\/\">natural gas<\/a> tend to see the biggest moves in autumn, when markets are preparing for the winter season. <a href=\"https:\/\/ftmo.com\/en\/gold-is-losing-its-luster-but-traders-still-love-it\/\">The price of gold<\/a> is commonly influenced by the wedding season in India, and grain prices also show seasonal effects, with prices falling significantly before the summer.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=lowvolatility\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546397 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p>Seasonal influences are the least noticeable in forex, because the currency market is more likely to be influenced by central banks and their monetary policy, which in return is influenced by inflation, the labour market, or GDP, etc.<\/p>\n<p>On USDCAD, we can perceive seasonality between February and April, when the Canadian dollar is much more successful. This currency is quite strongly linked to the price of oil. Oil tends to rise during these months, which has an impact on USDCAD. The other &#8220;commodity&#8221; currency, which is the Australian dollar, can then react to cycles in agricultural commodities or changes in demand for natural resources.<\/p>\n<p>On USDJPY, October is an interesting month, with the dollar doing well in the long term. Although the influence of a particular factor cannot be clearly identified, this is usually a time when investors&#8217; appetite for risk increases, which is also reflected in the equity markets. Demand for safe-havens such as the Japanese yen is thus reduced (which is also reflected in the price of gold).<\/p>\n<h2>December &#8211; low liquidity and few trends<\/h2>\n<p>The specific period for forex is December, and especially its second half is considered a challenge for traders (or even the beginning of January). The market liquidity will significantly decrease, paralleled by a notable reduction in the activity of major players. Volatility is a bit more complicated, as low volumes can lead to either lower volatility because the markets are simply not trading, or higher volatility because there are not enough orders in the market at a certain price.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=lowvolatility\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546404 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p>The main reason is, of course, the Christmas holidays. However, one of the reasons may be that traders in large institutions providing the main liquidity in the markets, such as banks or hedge funds, are paid bonuses and are not interested in what is happening in the markets. In short, December results have no impact on their paychecks, so they don&#8217;t need to bother.<\/p>\n<p>The lack of liquidity leads to the fact that, unless a major fundamental emerges, the daily moves on individual pairs are either well below the long-term average or show unexpected swings. For some retail traders, it can also be a problem that their broker is artificially widening spreads during this time (if they don&#8217;t make money on lower trader activity, they want to at least make money on the spreads).<\/p>\n<p>During this period, traders focusing on trend trading often struggle to find compelling opportunities to enter the market. Long-term trend moves with interesting consolidations to enter are practically not appearing in the market. Many automated trading systems also experience a series of losing trades during this period. This does not mean, however, that one cannot trade at all during this period.<\/p>\n<h2>Scalping or rest<\/h2>\n<p>Thus, the aforementioned volatile movements typically present opportunities, making this period intriguing, especially for scalpers whose daily bread is risk. Traders specializing in price ranges can also prosper, but they should exercise caution regarding false breaks in support and resistance levels.<\/p>\n<p>In any case, it is necessary to be patient in times of lower volatility and strictly follow the rules of risk management and money management. It is a good idea to trade on lower timeframes, reduce position sizes and possibly trade with a <a href=\"https:\/\/ftmo.com\/en\/do-you-want-to-improve-your-long-term-results-try-a-lower-rrr\/\">lower RRR<\/a>.<\/p>\n<p>However, one option that is not commonly used by retail investors is the so-called <a href=\"https:\/\/ftmo.com\/en\/what-is-a-swap-and-for-whom-is-it-important\/\">Carry trades<\/a>, where a trader opens a long position on a currency with a higher interest rate against a currency with a lower interest rate. Even retail swing traders can profit from holding a long position on, for example, the GBPJPY or <a href=\"https:\/\/ftmo.com\/en\/usdjpy-clash-of-two-cultures-east-and-west\/\">USDJPY<\/a> pairs, where they are credited with a swap of nearly 10 points per lot when holding the trade overnight. However, one needs to keep in mind that more significant moves against their position can mean more significant losses.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/scaling-plan\/?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=lowvolatility\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546367 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p>Nevertheless, even those who choose not to trade may not come short. For example, a trader can use the period without trading to backtest new strategies or to analyse past trades and fine-tune their strategy to make it more profitable in the future.<\/p>\n<p>Taking a break from the markets can also be the right solution for many traders. When someone has a bad streak or a prolonged losing streak, taking a break from trading can be the best psychological boost. Trading is all about psychology and any break, even if it may be forced for some, can help a trader to sort out their thoughts, recharge their batteries and start the new year with a clean slate.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The forex market is characterized by its high liquidity and also interesting volatility, which means there are plenty of opportunities for trades. However, at the end of the year, and especially in the second half of December, liquidity in the markets may decrease and traders should adjust to those market conditions accordingly. The Forex market [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":598238,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/598146"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=598146"}],"version-history":[{"count":7,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/598146\/revisions"}],"predecessor-version":[{"id":602024,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/598146\/revisions\/602024"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/598238"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=598146"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=598146"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=598146"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}