{"id":600648,"date":"2023-12-01T14:00:02","date_gmt":"2023-12-01T13:00:02","guid":{"rendered":"https:\/\/ftmo.com\/?p=600648"},"modified":"2023-12-01T14:48:38","modified_gmt":"2023-12-01T13:48:38","slug":"how-do-we-rebuild-a-strategy-from-scratch","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/how-do-we-rebuild-a-strategy-from-scratch\/","title":{"rendered":"How do we rebuild a strategy from scratch?"},"content":{"rendered":"<p><em>A series of losing trades in Forex trading is not uncommon. It can be caused by unsuitable conditions in the markets or poor mental attitude of the trader. However, in rare cases, it can happen that an incorrectly chosen strategy is behind the losses. How do you deal with such a situation?<\/em><\/p>\n<p>Even the <a href=\"https:\/\/ftmo.com\/en\/gambling-is-not-the-right-way-to-make-money\/\">best strategy<\/a> can lead to a losing streak at certain times, but an experienced trader should have no problem surviving them. Good risk management and rigorous back-testing should give the trader confidence that following the rules of the strategy will eventually produce good results again.<\/p>\n<p>In the worst case, it can be a psychological problem of a trader whose strategy is not bad, but whose mental state is wrong for some reason at the moment. The solution may be to take a break from trading, temporarily trade on a demo account where the trader can regain lost confidence, or reduce traded positions so that the trader does not get too stressed every time his position suffers a loss.<\/p>\n<h2>Why doesn&#8217;t the strategy work?<\/h2>\n<p>The very last option should then be to change the strategy or rebuild it from scratch. Sometimes that can happen as well and in some cases, there really is no other option. There may be several reasons to change or rebuild the strategy. Very often it is the result of inconsistent testing and violation of rules in backtesting. The trader did not devote enough time to backtesting and tested his strategy on too short a period of time or with insufficient data. He may also have simply been inconsistent in evaluating the backtesting results, which he tailored to produce positive results in his strategy.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=strategyfromscratch\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546397 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p>Especially for beginners and less experienced traders, the reason a strategy doesn&#8217;t work may be that they have adopted their strategy from someone else. Despite satisfactory results in backtesting, they end up not doing well in live trading because they don&#8217;t realize that the strategy does not suit their trading style.<\/p>\n<h2>A new strategy<\/h2>\n<p>When you decide to change your strategy, you should expect to develop an entirely new strategy from scratch. At the very beginning, you should figure out where your original strategy failed (even though it could have worked for someone else) and what you should change in the first place. Sometimes it&#8217;s really just necessary to change a few things, but that&#8217;s only possible once you&#8217;ve analysed all the details.<\/p>\n<h2>The right trading style<\/h2>\n<p>You should clarify whether your current trading style suits you. If you don&#8217;t have time to look at charts during the day, you should not focus your strategy on intraday trading using 15-minute or 30-minute charts. It is definitely better to develop an approach that works on a 4-hour or daily chart so that you have enough time to analyze the charts before or after work.<\/p>\n<h2>Ideal time and timeframe<\/h2>\n<p>Some people, on the other hand, may actually prefer a more short-term approach, and although they look at charts throughout the day, the 4-hour and daily charts may be too slow for them. This could lead to them looking for signals when there are none. In both cases, in addition to the timeframe, it is important to determine the ideal interval within the day in which you will be looking at the charts. On longer timeframes, it will probably be the before and after work period mentioned above. For an intraday trader, it is advisable to determine the timeframe in which the strategy produces the best results and prefer not to do live trading of charts at all during the rest of the day (and feel free to do something else, such as analyzing the trading journal, improving the strategy, etc.).<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=strategyfromscratch\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546404 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h2>Suitable instruments<\/h2>\n<p>Next, it is a good idea to adjust the amount of instruments traded. Did your US stock indices strategy work, but you lost money trading Forex pairs? It&#8217;s probably better to avoid Forex. Are you trading at a time when liquidity in commodity markets is lower and your main instruments are <a href=\"http:\/\/e\">oil<\/a> and gold? It may be better to find a strategy that works for the <a href=\"https:\/\/ftmo.com\/en\/usdjpy-clash-of-two-cultures-east-and-west\/\">Forex pairs<\/a> that are traded most frequently at your preferred time.<\/p>\n<p>The problem may have been that you tried to &#8220;<a href=\"https:\/\/ftmo.com\/en\/how-to-utilize-investing-skills-for-trading-and-vice-versa\/\">diversify<\/a>&#8221; and apply your strategy on too many instruments. Either the strategy was not suitable for those instruments or you tried to track so many that you did not have a good overview of any of them. Sometimes it&#8217;s better to focus on one or two instruments for which a strategy works, and not overcomplicate things by spreading yourself too thin across too many instruments.<\/p>\n<h2>Technical analysis and indicators<\/h2>\n<p>Many novice traders believe that the basis of success is the use of as many <a href=\"https:\/\/ftmo.com\/en\/technical-analysis-do-you-use-indicators-when-trading\/\">indicators<\/a> as possible, the combination of which filters out all bad signals and generates only profitable entries. Disillusionment usually comes fairly quickly, but for some it may take longer. In any case, you should think about whether you really need to have five trend indicators in the chart window and three more oscillators below the main window. Limiting the aforementioned &#8220;gadgets&#8221; can simplify both backtesting and trading itself.<\/p>\n<h2>Risk management<\/h2>\n<p>Another important aspect of your strategy must be proper <a href=\"https:\/\/ftmo.com\/en\/do-you-want-to-manage-risk-seriously-use-our-calculators\/\">risk management<\/a>. If you were happy with the fact that losing trades were bigger than profitable trades, but you planned to make up for it with an 80% success rate, reality has probably shown you that it doesn&#8217;t work that way and it&#8217;s time to change that.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/scaling-plan\/?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=strategyfromscratch\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546367 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p>But the problem could be that you wanted to achieve a high RRR at all costs, but almost never reached the profit, which was five times the SL, which made you very depressed mentally. In short, it&#8217;s important to set the SL and TP levels so that the resulting <a href=\"https:\/\/ftmo.com\/en\/do-you-want-to-improve-your-long-term-results-try-a-lower-rrr\/\">RRR makes sense<\/a> for you, is realistically achievable within your strategy, and generates an interesting profit in the long run.<\/p>\n<h2>Backtesting and trading journal<\/h2>\n<p>Just because you already have some trading experience and it is not a &#8220;brand new&#8221; strategy does not mean you should forego <a href=\"https:\/\/ftmo.com\/en\/forex-backtesting\/\">backtesting<\/a> it. In order to be able to identify all the shortcomings of the previous strategy and refine all the details of the new strategy, you should invest even more time backtesting than in the first case. As already mentioned, one of the problems with the broken strategy in the past may have been neglected backtesting.<\/p>\n<p>Markets are not constant and their behaviour changes over time. It is therefore important that the period covered by backtesting is as long as possible. You can test how your strategy responds to different market conditions or how long losing periods your strategy will experience.<\/p>\n<p>The <a href=\"https:\/\/ftmo.com\/en\/want-feedback-try-the-trading-journal\/\">trading journal<\/a> is then another obvious thing that you should not underestimate. It gives you the feedback you need that can show you the weaknesses of your strategy. So sometimes you just need to adjust the details that will ultimately lead to significant improvements in your results.<\/p>\n<p>So once you&#8217;ve decided to change your strategy, you must do everything possible to avoid having to make a similar move in the future. Trade safely!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A series of losing trades in Forex trading is not uncommon. It can be caused by unsuitable conditions in the markets or poor mental attitude of the trader. However, in rare cases, it can happen that an incorrectly chosen strategy is behind the losses. How do you deal with such a situation? Even the best [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":600781,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/600648"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=600648"}],"version-history":[{"count":14,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/600648\/revisions"}],"predecessor-version":[{"id":609715,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/600648\/revisions\/609715"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/600781"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=600648"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=600648"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=600648"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}