{"id":602578,"date":"2023-12-22T15:20:24","date_gmt":"2023-12-22T14:20:24","guid":{"rendered":"https:\/\/ftmo.com\/?p=602578"},"modified":"2023-12-22T15:27:41","modified_gmt":"2023-12-22T14:27:41","slug":"why-is-the-head-our-greatest-enemy-and-how-to-fight-it","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/why-is-the-head-our-greatest-enemy-and-how-to-fight-it\/","title":{"rendered":"Why is the head our greatest enemy and how to fight it?"},"content":{"rendered":"<p><em>Many traders do not realize that their biggest enemy in the pursuit of profit is themselves, or the way they think and process information. One of the biggest enemies of every trader are the cognitive biases that unknowingly force us to make wrong conclusions and decisions, which then lead to unnecessary losses. Is it possible to fight it?<\/em><\/p>\n<p>Cognitive biases are certain tendencies in thinking, mental shortcuts, or errors in judgment and reasoning that affect traders&#8217; decision-making and cause erroneous conclusions. They lead to a distorted view of reality and are the basis of prejudices and stereotypes in everyday life.<\/p>\n<p>The biggest &#8220;danger&#8221; with cognitive biases is, that people are not aware of them, and therefore traders are not immune to them. Factors that lead to these biases include a lack of time to process information, lack of information, or too much information to process, but may also include selective memory and the influence of already processed information.<\/p>\n<p>We know of several cognitive biases that negatively affect trader behaviour and performance, and here we will describe a few of the most well-known.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge\/?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=cognitivebias\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546397 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h2>1. Confirmation bias<\/h2>\n<p>This is a bias in which traders tend to seek out information that confirms their current beliefs or conclusions, while ignoring or downplaying information that they are uncomfortable with. In trading or investing, this can lead to a trader being unable to close out a losing position because he or she does not take into account signals indicating a change in trend and hopes for a reversal that ultimately does not occur. The solution is to use a variety of sources of information and learn to seek critical feedback, accepting a different view while challenging your assumptions.<\/p>\n<h2>2. Recency bias<\/h2>\n<p>These errors stem from the tendency to give more importance to events that have happened recently and to undervalue events from the more distant past. According to this thesis, current information should influence the future more than older information that is no longer useful. This error causes traders to ignore broader context or long-term trends and focus only on current events and market trends. The solution is not to focus on current events and short-term trends, but to look at longer timeframes that allow you to see individual trades from a different perspective.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge\/?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=cognitivebias\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546404 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h2>3. Hindsight bias<\/h2>\n<p>Often referred to as the &#8220;I knew it from the beginning&#8221; phenomenon, it leads to the belief that the trader was able to predict the outcome of an event that had already happened based on their abilities alone. The trader thus overestimates his ability to predict market events, while underestimating the role of chance and uncertainty. Positive results, according to the trader, are the result of his ability to predict market events, while negative results are the result of unpredictable events. Traders then often take unnecessary risks because they &#8220;know what will happen next in the market&#8221;, resulting in unnecessary losses. The solution is to keep a detailed trading journal, evaluate your past trades and seek quality feedback.<\/p>\n<h2>4. Availability bias<\/h2>\n<p>This fault stems from the fact that traders give much more weight to information that is easily available, or they simply get caught out and neglect information that is not easily available. Thus, traders may open trades based on bad and unverified information because they neglect to analyse the market thoroughly. A good way to avoid this mistake is to analyse and monitor as much information as possible, not just the information that comes to them the easiest way.<\/p>\n<h2>5. Anchoring Bias<\/h2>\n<p>This bias is caused by traders giving too much importance to certain information, regardless of its significance, and failing to take into account the changing market conditions. This can often lead them to fixate on a particular price, support and resistance levels, analysts&#8217; recommendations or selected macro data, ignoring long-term trends and how they may change, or current information that can significantly alter market trends. The solution is to follow as many sources of information as possible, stick to a plan that is based on long-term experience and not rely on a single source of information, and have the ability to adapt to what is happening in the markets.<\/p>\n<h2>6. Loss Aversion Bias<\/h2>\n<p>While loss aversion is natural to all traders, this mistake leads traders to prioritize avoiding losses over making profits. The fear and subsequent pain of loss is simply greater than the joy of profit, leading to an inability to objectively assess the profitability of a trade. Interestingly, this behaviour often leads traders to hold their losing trades for an unnecessarily long time because they believe in a trend reversal, while closing profitable trades too early. The solution for all traders is simply to admit that you can&#8217;t trade without losses, that losing trades are a part of trading. At the same time, it is a good idea to set risk management rules along with the optimal RRR given the trader&#8217;s style and follow them.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/scaling-plan\/?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=cognitivebias\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546367 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h2>7. Overconfidence Bias<\/h2>\n<p>Overconfidence leads traders to believe that their skills and abilities are far superior to reality. Overestimating their knowledge and judgment then leads to a willingness to take unnecessary risks, open too large positions and, of course, overtrading. Clear risk management rules, keeping and evaluating a detailed trading journal, and seeking feedback that can properly &#8220;ground&#8221; the trader can help in this case as well.<\/p>\n<h2>How to fight cognitive bias<\/h2>\n<p>Recognizing and understanding cognitive biases is critical to making rational and objective decisions and can lead to significant performance improvements for traders. The key, as we have written here several times and keep repeating, is to take a responsible approach and develop a trading plan with a robust strategy. Part of the steps that will lead to improved trader performance is also learning the rules of money management and risk management and, last but not least, the discipline to make the trader follow all the rules and his strategy.<\/p>\n<p>We must not forget proper backtesting, which on the one hand will help both in fine-tuning the strategy and on the other hand will help strengthen the mental well-being in trading. The psychological aspect is one of the most important aspects in trading, but the trader must first become sufficiently aware of its influence. Last but not least, we must not forget about continuous education, which will also help the trader to make the most rational and objective decisions which will lead to long-term success in trading.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Many traders do not realize that their biggest enemy in the pursuit of profit is themselves, or the way they think and process information. One of the biggest enemies of every trader are the cognitive biases that unknowingly force us to make wrong conclusions and decisions, which then lead to unnecessary losses. Is it possible [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":602680,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[5184],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/602578"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=602578"}],"version-history":[{"count":4,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/602578\/revisions"}],"predecessor-version":[{"id":606308,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/602578\/revisions\/606308"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/602680"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=602578"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=602578"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=602578"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}