{"id":604630,"date":"2024-01-19T15:00:00","date_gmt":"2024-01-19T14:00:00","guid":{"rendered":"https:\/\/ftmo.com\/?p=604630"},"modified":"2024-01-22T09:32:19","modified_gmt":"2024-01-22T08:32:19","slug":"which-are-the-worst-backtesting-mistakes","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/which-are-the-worst-backtesting-mistakes\/","title":{"rendered":"Which are the worst backtesting mistakes?"},"content":{"rendered":"<p><em>Backtesting should be an integral part of the process of creating a functional trading strategy for every trader. Although it may seem like a simple tool that anyone can master, many traders make mistakes in backtesting that lead to distorted results and subsequent losses in real trading.<\/em><\/p>\n<p>We have written several times about<a href=\"https:\/\/ftmo.com\/en\/forex-backtesting\/\"> backtesting<\/a>, its uses, and how you can use it to improve the inputs and outputs of your existing strategy. But today we&#8217;ll look at what you should avoid when backtesting so that your strategy doesn&#8217;t become a black hole for your trading account.<\/p>\n<p>Before you even start backtesting, you should be clear on a few basic rules. Backtesting should be done on as large a sample of data as possible, you should have a defined trading plan before the actual backtesting, and you should have clear risk management rules within the strategy that you will follow.<\/p>\n<h2>Consistency pays off<\/h2>\n<p>Just like a trading journal works for trading, you should keep detailed records of your results for backtesting and after the backtesting itself you should do a proper analysis to help you determine\/improve the basic parameters of the strategy such as RRR, <a href=\"https:\/\/ftmo.com\/en\/how-can-you-improve-your-stop-loss-and-take-profit\/\">MAE, MFE<\/a>, success rate, profit and loss streaks, maximum drawdown, etc.<\/p>\n<p>Once you know what to do and get down to backtesting, you should avoid a few basic mistakes that are made by both novice traders and professional traders using sophisticated tools for backtesting.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=backtestingmistakes\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546397 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h2>Look-ahead Bias<\/h2>\n<p>One of the basic mistakes of backtesting is using data that you might not yet have in normal trading. This is the same as using tomorrow&#8217;s prices in the real market today to make your entry decisions. This can then lead to biased results and misleading conclusions.<\/p>\n<p>This error can occur when you unknowingly include an investment instrument in your strategy that has performed very well over a period of time (for example, a stock index before the bull market began or a currency pair that has been in a long and strong trend over a period of time). In reality, however, you would not have known at the beginning of the period that it would perform so well in the future and your strategy might not work in the real market. So you need to take this possibility into account when <a href=\"https:\/\/ftmo.com\/en\/how-do-we-rebuild-a-strategy-from-scratch\/\">building your strategy<\/a>, and you can avoid it by extending the period in which you test your strategy.<\/p>\n<h2>Optimization Bias<\/h2>\n<p>This is a mistake you can make when you try to optimize and refine your strategy based on past data until it works as you want it to on a given sample of data. When backtesting your strategy, you can commit this error along with the previous one. At first glance, this is a logical step to improve your strategy, but in reality it is just adapting your strategy to a given sample of data.<\/p>\n<p>The solution may be to simplify the strategy and then test it in a &#8220;basic setup&#8221; on a larger number of instruments. If you don&#8217;t want to test your strategy on different instruments, the best solution is to add a time interval in which you test the strategy. For example, if the strategy has worked in the last two years and will continue to work after extending the interval to five years or more, you have a better chance of being successful in real-world conditions.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=backtestingmistakes\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546404 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h2>Ignoring the influence of the real market<\/h2>\n<h3>Psychology<\/h3>\n<p>Many traders expect the results to be exactly the same after switching to real trading as with backtesting, but the situation is ultimately quite different. When backtesting, for example, you are not influenced by emotions at all. You have always opened and closed your test trades at the &#8220;ideal levels&#8221;, but emotions in the real market make you close profitable trades too early, or you unnecessarily adjust your stop loss.<\/p>\n<h3>Expenses<\/h3>\n<p>Another problem may be that you don&#8217;t consider fees, spreads or slippage in your backtesting. For some lower liquid instruments, spreads or slippage can be quite large and can cause a trade to end not in profit but in a loss. On a single trade, the difference between backtesting and the real market may not be apparent, but in the longer term the differences in results can be dramatic.<\/p>\n<h3>The right time to trade<\/h3>\n<p>When backtesting, you may often not realise that a large proportion of your profitable trades were made at times when you will not be present in the real markets. You also need to take into account that some of the more significant movements in the markets happen after the publication of important macro data, and these trades may not be executable in real trading either.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/en\/scaling-plan\/?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=backtestingmistakes\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546367 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<h3>The market is a living organism<\/h3>\n<p>When backtesting, you must remember that the market is like a living organism that is constantly changing and evolving. What may have worked ten years ago may not work today, so it&#8217;s a good idea to take this into account when backtesting and adjust your testing time accordingly. You should also take into account that even if you test your strategy on one instrument, it is influenced by the behaviour of other instruments in the same asset class, but also by instruments in other asset classes. When you decide to test your strategy on a larger number of instruments, you should choose instruments whose correlation is very low. This will allow you to see if the strategy is suitable for multiple instruments, or if you need to focus on only one asset class or selected investment instrument.<\/p>\n<h2>Conclusion<\/h2>\n<p>If done correctly, backtesting is a useful analytical tool that can help you find the right strategy, which you can trust and that suits your style. At the same time, however, its results should not be overestimated, and you need to remember that it is not a tool to help you predict the future. You need to give it enough time and avoid the unnecessary mistakes mentioned in the article, and then it can become what will make you a profitable trader in the long run. Trade safely!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Backtesting should be an integral part of the process of creating a functional trading strategy for every trader. Although it may seem like a simple tool that anyone can master, many traders make mistakes in backtesting that lead to distorted results and subsequent losses in real trading. We have written several times about backtesting, its [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":604694,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/604630"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=604630"}],"version-history":[{"count":6,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/604630\/revisions"}],"predecessor-version":[{"id":604815,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/604630\/revisions\/604815"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/604694"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=604630"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=604630"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=604630"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}