{"id":605841,"date":"2024-02-02T14:00:22","date_gmt":"2024-02-02T13:00:22","guid":{"rendered":"https:\/\/ftmo.com\/?p=605841"},"modified":"2024-02-03T17:09:36","modified_gmt":"2024-02-03T16:09:36","slug":"when-and-why-use-the-services-of-a-performance-coach","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/when-and-why-use-the-services-of-a-performance-coach\/","title":{"rendered":"When and why use the services of a performance coach?"},"content":{"rendered":"<p><em>Consultations with a performance coach are one of the unique and very popular extras for FTMO Traders that virtually no one else offers. Do you want to know in which situations it is appropriate to use the services of a coach? Read on to find out more.<\/em><\/p>\n<p>Having perfect technical analysis skills and a great strategy is usually not enough to succeed in trading. In fact, psychology, among many other factors, plays a huge role in traders&#8217; decision making. This can ultimately have a major impact on trading results.<\/p>\n<p>Many traders, especially those who are less experienced, overlook the importance of their psychological state in trading. This aspect can greatly impact their success. Traders often realise its significance only after it&#8217;s too late, sometimes resulting in the loss of their trading accounts or invested money.<\/p>\n<h2>A coach is not a mentor<\/h2>\n<p>Many beginners in the world of trading, after initial failures, start to wonder how they can improve their results and seek out a <a href=\"https:\/\/ftmo.com\/cs\/vyplati-se-vyzkouset-mentoringovy-program\/\">trading mentor<\/a>. This may not be a bad idea, but a mentor is not a psychologist. A mentor can help a novice trader navigate through the world of trading, guide their initial steps, and help them build a strategy. Basically, he can help a trader avoid the mistakes that everyone makes in the beginning of a trading career.<\/p>\n<p><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=performancecoach\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546397 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_2-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/p>\n<p>The <a href=\"https:\/\/ftmo.com\/en\/performance-coaches\/\">performance coach<\/a> aims to help the trader, especially with the psychological side of things. It is not a simple process, the key is cooperation. The psychologist tries to define the problems through specific questions aimed at each trader individually. However, the coach is certainly not the one who has the clear answers. It is by asking the right questions and defining goals together that he and the trader will eventually arrive at a long-term solution. This can then move the trader in the right direction and help him or her achieve the desired results.<\/p>\n<h2>What FTMO performance coaches offer<\/h2>\n<p>A performance coach doesn&#8217;t only have to help traders who are underperforming. Even a successful trader needs to work on himself and has room for improvement. In this regard, a performance coach can help in maintaining a positive attitude and optimizing results. At FTMO, traders can have up to two sessions with a coach per month for free. This is a real step up within the modern prop trading industry. Our coaches can help you in several areas, and working with them can help you achieve better results in the long run.<\/p>\n<h2>When to use a coach?<\/h2>\n<p>Every trader faces different problems and mistakes during their trading career (we wrote about them in the <a href=\"https:\/\/ftmo.com\/en\/why-is-the-head-our-greatest-enemy-and-how-to-fight-it\/\">article here<\/a>). These mistakes then do not allow the trader to achieve the expected results. Traders should seek help especially in these cases:<\/p>\n<h3>Repeating the same mistakes<\/h3>\n<p>Many traders cannot get rid of the same mistakes that lead to unnecessary losses. A coach can help you identify the trigger behind these mistakes. It may be a certain pattern of behaviour or specific thoughts that precede these mistakes. This could then help you break out of the never-ending cycle of losing.<\/p>\n<h3>Problems with emotions<\/h3>\n<p>Emotions and their influence on trading cannot be completely ruled out. A coach can help you work through the worst of them, such as fear, anxiety or greed, or help you keep their impact on trading to a minimum.<\/p>\n<p>In addition, a coach can help you increase your emotional intelligence. This will allow you to become more aware of what you are experiencing and be able to control your emotions (or identify emotions other than those mentioned above that are behind your mistakes). At the same time, you will understand their cause and be able to avoid these emotions.<\/p>\n<h3>Lack of discipline<\/h3>\n<p>Achieving long-term positive results without discipline is challenging. A performance coach can teach you techniques to enhance your self-discipline. However, it&#8217;s crucial to remember that the ultimate choice lies with you. A coach doesn&#8217;t execute trades for you or prevent you from acting at critical moments.<\/p>\n<h3>Analysis of the trading process<\/h3>\n<p>A well-defined problem is a half-solved problem. So, if you&#8217;re not quite sure where the shoe is dropping, a coach can be that external element that provides a second-person perspective and objective opinion. Just talking to someone else and getting yourself to talk about it can help.<\/p>\n<h3><a href=\"https:\/\/trader.ftmo.com\/start-challenge?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=performancecoach\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546404 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_1-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/h3>\n<h3>Overtrading<\/h3>\n<p>Overtrading leads in most cases to an increased number of losing trades. This is where a coach can assist you in creating safety mechanisms that can limit the number of your trades. This can be, for example, creating a checklist that you should follow during the trading day etc.<\/p>\n<h3>Fear of loss<\/h3>\n<p>Loss aversion leads to irrational behaviour in most traders. In some cases, this behaviour can lead to paralysis and the inability to enter a trade at all. Therefore, when working with a coach, you should focus on what losing money or executing a losing trade means to you. Traders often perceive a losing trade as a mistake, even though they were following their strategy. Other times, they perceive a losing trade as a step backwards that will move them further away from achieving their dream goal.<\/p>\n<p>In all cases, however, it is important to remember that this strong emotional reaction is based on a subjective perception of reality. In other words, if you see a losing trade as something that moves you away from your dream goal, you will perceive the losing trade as a threatening stimulus. Because of this, you will then experience a stress reaction and emotional strain. However, if you stop seeing losing trades as a threat on a conscious level, the emotional response will change.<\/p>\n<h3>Burnout and loss of motivation<\/h3>\n<p>Every trader can get to a point where he or she lacks sufficient motivation to continue trading. A coach will then help you reset and refocus on realistic goals.<\/p>\n<h3>Lack of self-confidence<\/h3>\n<p>If after a series of losses, you stop believing in your abilities or trusting your strategy, a coach can help you build back confidence and positive thinking.<\/p>\n<h3>Switching from a Free Trial account to an FTMO Challenge or FTMO Account<\/h3>\n<p>Moving to an account where a trader can already make real money can create increased pressure for many traders. Again, a psychologist can help you find solutions to achieve similar results to those of a Free Trial account.<\/p>\n<h3>Lack of a trading plan and unrealistic goals<\/h3>\n<p>For many traders, the absence of a trading plan and unrealistic goals lead to disappointment and frustration. A performance coach should be able to help you set realistic and long-term goals, for example using the SMART method. This will help you set goals that are Specific, Measurable, Attainable, Relevant\/Realistic and Time-bound.<\/p>\n<h3><a href=\"https:\/\/ftmo.com\/en\/scaling-plan\/?utm_source=blog&amp;utm_medium=banner&amp;utm_campaign=performancecoach\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-546367 size-full\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png\" alt=\"\" width=\"800\" height=\"130\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1.png 800w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-300x49.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-768x125.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-705x115.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-24x4.png 24w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-36x6.png 36w, https:\/\/ftmo.com\/wp-content\/uploads\/2023\/03\/Banner_3-1-48x8.png 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/a><\/h3>\n<h2>Conclusion<\/h2>\n<p>Remember, using a performance coach does not mean you are a bad trader or that you don&#8217;t have potential. It means that you want to continue to grow personally and professionally and are interested in eliminating mistakes because you realise that no one is perfect. Even the best traders use the services of performance coaches, and it&#8217;s clear to us that you want to be one of the best. Trade safely!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Consultations with a performance coach are one of the unique and very popular extras for FTMO Traders that virtually no one else offers. Do you want to know in which situations it is appropriate to use the services of a coach? Read on to find out more. Having perfect technical analysis skills and a great [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":606468,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[5184],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/605841"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=605841"}],"version-history":[{"count":15,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/605841\/revisions"}],"predecessor-version":[{"id":610507,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/605841\/revisions\/610507"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/606468"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=605841"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=605841"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=605841"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}