{"id":69423,"date":"2019-06-21T10:43:32","date_gmt":"2019-06-21T08:43:32","guid":{"rendered":"https:\/\/ftmo.com\/?p=69423"},"modified":"2023-09-21T10:22:08","modified_gmt":"2023-09-21T08:22:08","slug":"day-trading-for-a-living","status":"publish","type":"post","link":"https:\/\/ftmo.com\/en\/day-trading-for-a-living\/","title":{"rendered":"Can You Start Day Trading for a Living with $1000? &#8211; The Answer Might Shock You!"},"content":{"rendered":"<p><em>Day trading is a dream job for a lot of people. Unfortunately, only a few will make it. Statistics say that 90% of traders blow up their accounts in the first 3 months of trading. Because of that, being a day trader can be considered as one of the hardest jobs which are constantly testing your mental skills as you are trying to join that prestigious 10% of traders who were able to make it.<\/em><\/p>\n<p>Before we show you the ways how you can become a full-time day trader, here are some underlying pros and cons every trader should take into consideration.<\/p>\n<h2>Pros of Day Trading<\/h2>\n<h3>Day Traders are Independent<\/h3>\n<p>You are your own boss, you don&#8217;t have to wake up early and work 9-5.<\/p>\n<h3>Own schedule as a day trader<\/h3>\n<p>If you are not feeling well or want to take a day off, you don&#8217;t have to ask anyone for permission to do so.<\/p>\n<h3>Trading develops intellect<\/h3>\n<p>One of the biggest mistakes you can make as a trader is coming to the point where you think you know everything. Trading is a lifetime process and you should always seek for new pieces of information.<\/p>\n<h3>You can trade from anywhere in the world<\/h3>\n<p>These days we live in, all you need is internet access and a laptop. Thanks to this, you can travel all around the world and trade from wherever you want.<\/p>\n<h3>Trading is a prestigious job<\/h3>\n<p>Being part of those 10% profitable traders will resonate amongst the others.<\/p>\n<h3>You can make a lot of money trading<\/h3>\n<p>Once you are profitable, your trading account can turn into a money-making machine.<\/p>\n<h2>Cons of Day trading<\/h2>\n<h3>You can lose a lot of money trading<\/h3>\n<p>If you are not good at trading, you probably have no risk management and you make mistakes. You can very easily join this 90% of traders who blow up their accounts very quickly.<\/p>\n<h3>Day traders face loneliness<\/h3>\n<p>Since you are your own boss and you are alone while you are working, you can get lonely pretty fast. Because of that, you should always plan social activities during the time when markets are closed.<\/p>\n<h3>Trading will take much more time than you imagine<\/h3>\n<p>Depends on how many instruments you trade, trading can be very time-dependent. You are constantly scanning the market for new opportunities, journal your trades, manage your positions and much more.<\/p>\n<h3>Markets will test your mindset every day<\/h3>\n<p>Even if you think that you have the best strategy in the world, you are not going to win every trade and you will most likely experience series of drawdowns in your trading career. These scenarios can be mentally exhausting and you must be able to get through them without making mistakes which could cost you even more money.<\/p>\n<h3 class=\"LC20lb\">You need money to make money<\/h3>\n<p>Many people think that they can make a living with $500 or $1,000 in their trading accounts.<\/p>\n<p>The truth is, that you need much more to be able to make living as a day trader, luckily we can show you the way how you can become a full-time day trader without having tens of thousands of dollars in your trading account.<\/p>\n<h2>Day Trading with your own money<\/h2>\n<p>Most of the retail brokers will let you open a trading account with as little as $100.<\/p>\n<p>It is foolish to even think that you can make some reasonable money starting at $100.<\/p>\n<p>But how about $500 or $1,000? That&#8217;s not that small amount of money right?<\/p>\n<p>Well let&#8217;s take a look at our FTMO Equity Simulator where we put starting capital at $1000 and we performed to test for 10 different scenarios where your win rate is 55% with risk:reward ratio set at 2, risk percentage 1% per trade and 22 trades taken, so you would have to take at least 1 trade each day for a whole month.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-69463\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/06\/ezgif.com-video-to-gif.gif\" alt=\"\" width=\"600\" height=\"533\" \/><\/p>\n<p>As results show, after one month of trading, the worst-case scenario would be that you end up with $930 which equals to a loss of 7%, while the best case scenario is $1,260 which equals to a gain of 26%.<\/p>\n<p>If we are going to take a look at average and most realistic results, you are gaining around 10% of your account, which equals to $100.<\/p>\n<p>So after one month of trading on day to day basis, you have made approximately $100.<\/p>\n<p>We can all agree that this is not a viable outcome.<\/p>\n<p>Let&#8217;s take a look at how this money would compound over time if you would be able to pull out 10% every trading month.<\/p>\n<table class=\"table table-striped\" style=\"height: 656px;\" width=\"1260\">\n<thead class=\"table-head\">\n<tr>\n<th>Month<\/th>\n<th>Previous<\/th>\n<th>%<\/th>\n<th>Total<\/th>\n<\/tr>\n<\/thead>\n<tbody class=\"table-body\">\n<tr>\n<td>1<\/td>\n<td>$ 1000<\/td>\n<td>+10%<\/td>\n<td>$ 1100<\/td>\n<\/tr>\n<tr>\n<td>2<\/td>\n<td>$ 1100<\/td>\n<td>+10%<\/td>\n<td>$ 1210<\/td>\n<\/tr>\n<tr>\n<td>3<\/td>\n<td>$ 1210<\/td>\n<td>+10%<\/td>\n<td>$ 1331<\/td>\n<\/tr>\n<tr>\n<td>4<\/td>\n<td>$ 1331<\/td>\n<td>+10%<\/td>\n<td>$ 1464.1<\/td>\n<\/tr>\n<tr>\n<td>5<\/td>\n<td>$ 1464.1<\/td>\n<td>+10%<\/td>\n<td>$ 1610.51<\/td>\n<\/tr>\n<tr>\n<td>6<\/td>\n<td>$ 1610.51<\/td>\n<td>+10%<\/td>\n<td>$ 1771.56<\/td>\n<\/tr>\n<tr>\n<td>7<\/td>\n<td>$ 1771.56<\/td>\n<td>+10%<\/td>\n<td>$ 1948.72<\/td>\n<\/tr>\n<tr>\n<td>8<\/td>\n<td>$ 1948.72<\/td>\n<td>+10%<\/td>\n<td>$ 2143.59<\/td>\n<\/tr>\n<tr>\n<td>9<\/td>\n<td>$ 2143.59<\/td>\n<td>+10%<\/td>\n<td>$ 2357.95<\/td>\n<\/tr>\n<tr>\n<td>10<\/td>\n<td>$ 2357.95<\/td>\n<td>+10%<\/td>\n<td>$ 2593.74<\/td>\n<\/tr>\n<tr>\n<td>11<\/td>\n<td>$ 2593.74<\/td>\n<td>+10%<\/td>\n<td>$ 2853.12<\/td>\n<\/tr>\n<tr>\n<td>12<\/td>\n<td>$ 2853.12<\/td>\n<td>+10%<\/td>\n<td>$ 3138.43<\/td>\n<\/tr>\n<tr>\n<td>13<\/td>\n<td>$ 3138.43<\/td>\n<td>+10%<\/td>\n<td>$ 3452.27<\/td>\n<\/tr>\n<tr>\n<td>14<\/td>\n<td>$ 3452.27<\/td>\n<td>+10%<\/td>\n<td>$ 3797.5<\/td>\n<\/tr>\n<tr>\n<td>15<\/td>\n<td>$ 3797.5<\/td>\n<td>+10%<\/td>\n<td>$ 4177.25<\/td>\n<\/tr>\n<tr>\n<td>16<\/td>\n<td>$ 4177.25<\/td>\n<td>+10%<\/td>\n<td>$ 4594.97<\/td>\n<\/tr>\n<tr>\n<td>17<\/td>\n<td>$ 4594.97<\/td>\n<td>+10%<\/td>\n<td>$ 5054.47<\/td>\n<\/tr>\n<tr>\n<td>18<\/td>\n<td>$ 5054.47<\/td>\n<td>+10%<\/td>\n<td>$ 5559.92<\/td>\n<\/tr>\n<tr>\n<td>19<\/td>\n<td>$ 5559.92<\/td>\n<td>+10%<\/td>\n<td>$ 6115.91<\/td>\n<\/tr>\n<tr>\n<td>20<\/td>\n<td>$ 6115.91<\/td>\n<td>+10%<\/td>\n<td>$ 6727.5<\/td>\n<\/tr>\n<tr>\n<td>21<\/td>\n<td>$ 6727.5<\/td>\n<td>+10%<\/td>\n<td>$ 7400.25<\/td>\n<\/tr>\n<tr>\n<td>22<\/td>\n<td>$ 7400.25<\/td>\n<td>+10%<\/td>\n<td>$ 8140.27<\/td>\n<\/tr>\n<tr>\n<td>23<\/td>\n<td>$ 8140.27<\/td>\n<td>+10%<\/td>\n<td>$ 8954.3<\/td>\n<\/tr>\n<tr>\n<td>24<\/td>\n<td>$ 8954.3<\/td>\n<td>+10%<\/td>\n<td>$ 9849.73<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>What you can notice right here is that it would take you 24 months (2 years) to build your account to $10,000, also don&#8217;t forget that you would not be able to take anything from the account during those 2 years so making day trading your full-time job goes off the table.<\/p>\n<p>After 2 years, you would be able to take out $1,000 from your account every month in case you would be able to make that 10%.<\/p>\n<p>For most of the people, $1,000 per month is a bare minimum to cover rent and other living expenses.<\/p>\n<h2>Why most retail traders with small accounts fail<\/h2>\n<p>We have all seen the popular disclaimer on Forex brokers websites and banners to the effect that the majority of retail traders lose funds. While we may grow oblivious of this notice over time due to our exposure, it nonetheless does not change the fact that this is the truth in entirety. Many retail traders go through it at a point. However, the probability of experiencing this is direr when coupled with small account size.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-large wp-image-385675\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/05\/369425-PB1FWR-179-1-1030x687.jpg\" alt=\"\" width=\"1030\" height=\"687\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2020\/05\/369425-PB1FWR-179-1-1030x687.jpg 1030w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/05\/369425-PB1FWR-179-1-300x200.jpg 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/05\/369425-PB1FWR-179-1-768x512.jpg 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/05\/369425-PB1FWR-179-1-1500x1000.jpg 1500w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/05\/369425-PB1FWR-179-1-705x470.jpg 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2020\/05\/369425-PB1FWR-179-1-450x300.jpg 450w\" sizes=\"(max-width: 1030px) 100vw, 1030px\" \/><\/p>\n<p><strong>The aim of this article is to unearth the complexity surrounding why most retail traders fail.<\/strong><\/p>\n<p>Could it be greed or sheer lack of knowledge and understanding of the market dynamics? It could not be any of these reasons as one thing is for sure, that amongst these blown accounts were accounts that belonged to traders who had genuinely profitable strategies and a sound understanding of the overall market dynamics.<\/p>\n<p><strong>So what makes these retail traders fail so much?<\/strong> While others believe that greed and patience is the major cause of the mass failure of most retail traders, I believe that there is a third major factor which is often overlooked.<\/p>\n<p>It is the problem of retail traders starting with a relatively small account size\/ starting balance.<\/p>\n<p>As a retail trader who has been trading for the last 3 years in the crypto, forex and indices market and interacted with a lot of traders, I write this as a guide to all retail traders out there. It is no surprise that most retail traders come into financial markets primarily to look for an extra source of income, a new job from their normal 9-5 and sometimes a hobby.<\/p>\n<p>With this in mind, it becomes very difficult for a trader trading on a small account such as $200 account, taken from a $1,000 paycheck to acknowledge the importance of Risk Management and Risk to Reward Ratio.<\/p>\n<p>This trader with a $200 will be confronted with a daunting task to adhere to risking only a maximum of 1-2% of their total equity per trade.<\/p>\n<p>I dare you to tell that trader to risk just $2 (1% risk) per trade in order to make a modest $6 (3% profit) per trade, and they’ll think you are a joke.<\/p>\n<p>However, tell another trader with an equity of $200,000 to risk $2,000 per trade for a return of $6,000 and that trader will eagerly do so. In this scenario, the $6 seemed little, which it is, honestly, but in terms of percentage, it was the same as that of the trade taken by the trader with more equity.<\/p>\n<p>The meagre nature of most retail traders account to me is one of the major causes for the high rate of failures amongst this class of traders and not just the issue of greed and patience.<\/p>\n<p>My advice to retail traders out there is that, once you feel you are ready to trade live and have a sound backtested strategy, <strong>the next hurdle should be getting a <a href=\"https:\/\/ftmo.com\/welcome\/#funding-process\">FTMO Account<\/a>. <\/strong><\/p>\n<p>While this can be challenging and will take some time, it is worthwhile.<\/p>\n<p>Most will think they can make it trading $100 to $2,000 in a matter of weeks, that is outright overleveraging and will not help you in your trading career in the long run. Instead, find alternative means of initial balance other than yours, only when you don’t have enough capital to fund yourself.<\/p>\n<p>This will help you develop as a trader and also ensure that you do not fall prey to overleveraging\/ improper risk management.<\/p>\n<h3>Pursuit of impossible results<\/h3>\n<p>Imagine a small trading account of $1,000. When we risk 2% &#8211; $20, how big profits can we expect? If we consider the 1: 1 fixed money management rule, we can expect earnings around $20 per trade. In order to reach the average monthly salary ($1,500), you need 75 profitable trades. Moreover, the profit of $1,500 would mean a 150 % monthly return, which is totally extreme and unsustainable in the long run. Unreasonably elevated expectations and insufficient capital bring fatal losses.<\/p>\n<h3>Pressure on your psyche<\/h3>\n<p>Poor capitalization affects the trader´s psyche negatively. If we cannot afford to put more money into trading, we are constantly trading under higher pressure. Trading under unnecessary pressure is a great drawback and all traders should avoid it.<\/p>\n<h2>Day trading for a proprietary trading firm<\/h2>\n<p>If you are a profitable trader and you just don&#8217;t have enough capital, there is a way how you can become a day trader.<\/p>\n<p>In our <a href=\"https:\/\/ftmo.com\/why-to-join-the-challenge\/\">FTMO<\/a> <a href=\"https:\/\/ftmo.com\/why-to-join-the-challenge\/\">Challenge<\/a>, you can trade up to $400,000 and we require a monthly appreciation of 10% and this is being considered a borderline.<\/p>\n<p>The 10% gain was chosen because it is motivating and yet achievable.<\/p>\n<p>There is practically not a single day when an FTMO Challenge is not met across our projects.<\/p>\n<p>Some traders might consider this profit target too high, however, we&#8217;ve also set a 10% <a href=\"https:\/\/ftmo.com\/trading-objectives\/#toggle-id-4\">maximum loss<\/a>.<\/p>\n<p>Therefore, we want the trader to <strong>earn<\/strong> 10% of the initial balance within 30 days, <strong>without losing<\/strong> 10% of the initial balance.<\/p>\n<p>So both the desired profit and the maximum allowable loss are in <strong>balance<\/strong>.<\/p>\n<p>Since we are also traders, we know that sometimes there are months that don&#8217;t correspond according to our plan.<\/p>\n<p>If you do not reach the desired profit and you end up having your account balance positive with all positions being closed at the end of the trading period and do not violate any other rule, you will receive a new FTMO Challenge account from us, to try again fresh.<\/p>\n<p>Thanks to a fairly large number of traders, we have an idea of what we can expect from traders who advanced into <a href=\"https:\/\/ftmo.com\/evaluation-process\/\">FTMO Accounts<\/a>.<\/p>\n<p>Generally, more caution is exercised on the FTMO account, and as a result, the average gain is lower than in the FTMO Challenge. Profiting in tens of percent are only rare exceptions. As investors, we are happy to see a<strong> long-term<\/strong> appreciation of 4-7%.<\/p>\n<p><a href=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/01\/Money-for-trading.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter size-full wp-image-40304\" src=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/01\/Money-for-trading.png\" alt=\"\" width=\"1024\" height=\"510\" srcset=\"https:\/\/ftmo.com\/wp-content\/uploads\/2019\/01\/Money-for-trading.png 1024w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/01\/Money-for-trading-300x149.png 300w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/01\/Money-for-trading-768x383.png 768w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/01\/Money-for-trading-640x320.png 640w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/01\/Money-for-trading-705x351.png 705w, https:\/\/ftmo.com\/wp-content\/uploads\/2019\/01\/Money-for-trading-450x224.png 450w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/a><\/p>\n<p>Let&#8217;s compare two accounts, a smaller account of around $1,000, and an account sized <strong>$100,000<\/strong> that we offer to manage.<\/p>\n<p>Let&#8217;s be optimistic and count on a monthly appreciation of 7%. The final profit of the $1,000 account would be $70.<\/p>\n<p>Our FTMO account provided with $100,000 would print the profit of <strong>$7,000<\/strong>, but in this case, it is necessary to deduct our portion of the profit.<\/p>\n<p>After taking our 30% split, you will earn a net profit of <strong>$4,900<\/strong> which we are pretty sure is more than enough to cover all the living expenses and take a nice vacation.<\/p>\n<p>If this was your first trading month, we will also <strong>refund you the fee<\/strong> you initially paid for the FTMO Challenge.<\/p>\n<p>If this sound just too good to be true, take a look at interview with one of our FTMO Traders Nikita.<\/p>\n<div class='avia-iframe-wrap'><iframe loading=\"lazy\" title=\"This trader made €28,000 in one month trading forex! - Interview with FTMO Trader Nikita | FTMO\" width=\"1500\" height=\"844\" src=\"https:\/\/www.youtube.com\/embed\/_kKvGHRZEFQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen><\/iframe><\/div>\n<p>&nbsp;<\/p>\n<h2>In conclusion<\/h2>\n<p>It is safe to say that you need at least $10,000 to consider day trading a full-time job.<\/p>\n<p>This amount of money is something not everyone can afford to put in the trading account, but if you are a profitable trader and you think you can manage our FTMO Challenge, you can trade up to $400,000 for our firm.<\/p>\n<p>Start our Free Trial today and begin your journey to become the best full-time day trader you can be!<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Day trading is a dream job for a lot of people. Unfortunately, only a few will make it. Statistics say that 90% of traders blow up their accounts in the first 3 months of trading. Because of that, being a day trader can be considered as one of the hardest jobs which are constantly testing your mental [&hellip;]<\/p>\n","protected":false},"author":44,"featured_media":406460,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"categories":[670],"tags":[48308],"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/69423"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=69423"}],"version-history":[{"count":7,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/69423\/revisions"}],"predecessor-version":[{"id":603423,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/posts\/69423\/revisions\/603423"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media\/406460"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=69423"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/categories?post=69423"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/tags?post=69423"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}