{"id":588071,"date":"2023-08-21T16:22:32","date_gmt":"2023-08-21T14:22:32","guid":{"rendered":"https:\/\/ftmo.com\/?page_id=588071"},"modified":"2024-01-17T15:23:20","modified_gmt":"2024-01-17T14:23:20","slug":"affiliate-privacy-policy","status":"publish","type":"page","link":"https:\/\/ftmo.com\/en\/affiliate-privacy-policy\/","title":{"rendered":"Affiliate privacy policy"},"content":{"rendered":"<h1>Personal Data Processing<\/h1>\n<hr \/>\n<ul>\n<li><strong>Controller of personal data:<\/strong> The controller of the personal data you have provided to us in connection with the Affiliate program is FTMO Evaluation Global s.r.o., with its registered office at Purkyňova 2121\/3, Nové Město, 110 00 Prague 1, Czech Republic, Identification No.: 092 13 651 (“we” or the “Provider”).<\/li>\n<li><strong>Purposes of processing:<\/strong> The Provider is processing personal data for the purposes of (i) administration of your Affiliate profile and fulfilment of Provider’s obligations arising from the Affiliates Terms and Conditions, (ii) fulfilment of obligations arising from legal regulations, especially in the area of accounting, taxes, and international sanctions regime, (iii) fraud prevention, and (iv) resolution of any complaints, disputes, and protection of any assets and other legitimate interests of the Provider.<\/li>\n<li><strong>Extent of processed personal data:<\/strong> We process personal data in the extent necessary for the above-stated purposes, i.e., identification data (name, surname, date of birth, citizenship, business, and VAT ID), contact data (address of residence, telephone number, e-mail), account number, invoice information, the information resulting from international sanctions screening and content of mutual communication. Provision of personal data is voluntary, however, without them, it will not be possible to conclude a contractual relationship between you and the Provider.<\/li>\n<li><strong>Recipients of personal data and transfer of data to third countries:<\/strong> Personal data may be accessed or provided to our external lawyers or counsels, providers of accounting services, IT service providers, and, in accordance with legal regulations to public authorities upon individual request. In rare instances, personal data may be transferred to the so-called third countries (countries outside of the European Economic Area). In such case, the Provider proceeds in accordance with legal regulations and utilizes standard contractual clauses laid down by the European Commission or other appropriate tools for the transfer of personal data.<\/li>\n<li><strong>Duration of processing of personal data:<\/strong> The Provider processes personal data for the duration of the contractual relationship and afterward for 10 years.<\/li>\n<li><strong>Information on possible automated decision-making:<\/strong> The Provider does not carry out operations that include decision-making based exclusively on automated processing, including profiling, and which would produce legal effects for you or significantly affect you in a similar way.<\/li>\n<li><strong>Rights of the Affiliate:<\/strong> In connection with the processing of personal data, you have the following rights: (i) the right of access to the personal data that the Provider processes, (ii) right to rectification of personal data, (iii) right to erasure of personal data, (iv) right to restriction of processing of personal data, (v) right to data portability, (vi) the right to object to the processing of personal data if the processing of personal data is based on a legitimate interest or if it is processed for direct marketing purposes, (vii) the right not to be the subject of a decision based solely on automated processing, (viii) the right to withdraw consent in case the processing of personal data is based on consent, and (ix) the right to file a complaint with the Office for Personal Data Protection, with its registered seat at Pplk. Sochora 27, 170 00 Prague 7 – Holešovice. These rights can be exercised by contacting the Provider via post or at the e-mail address privacy@ftmo.com.<\/li>\n<li><strong>Changes to the document:<\/strong> This document may be changed unilaterally from time to time. We will do so only when necessary.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Personal Data Processing Controller of personal data: The controller of the personal data you have provided to us in connection with the Affiliate program is FTMO Evaluation Global s.r.o., with its registered office at Purkyňova 2121\/3, Nové Město, 110 00 Prague 1, Czech Republic, Identification No.: 092 13 651 (“we” or the “Provider”). Purposes of [&hellip;]<\/p>\n","protected":false},"author":48,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"inline_featured_image":false,"footnotes":""},"acf":[],"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/pages\/588071"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/users\/48"}],"replies":[{"embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/comments?post=588071"}],"version-history":[{"count":3,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/pages\/588071\/revisions"}],"predecessor-version":[{"id":604564,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/pages\/588071\/revisions\/604564"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=588071"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}