{"id":601951,"date":"2023-12-13T13:05:49","date_gmt":"2023-12-13T12:05:49","guid":{"rendered":"https:\/\/ftmo.com\/?post_type=ftmo_jobs&#038;p=601951"},"modified":"2023-12-13T13:05:59","modified_gmt":"2023-12-13T12:05:59","slug":"motion-graphic-designer","status":"publish","type":"ftmo_jobs","link":"https:\/\/ftmo.com\/en\/careers\/motion-graphic-designer\/","title":{"rendered":"Motion Graphic Designer"},"content":{"rendered":"","protected":false},"template":"","job_category":[89055],"acf":{"description":"<span style=\"font-weight: 400;\">We won the Deloitte Fast 50 award for the fastest-growing tech company in Central and Eastern Europe and are looking for new colleagues to join us in advancing our project! Seize the opportunity and become a part of the rapidly growing startup FTMO.com. We are searching for a new team member for our marketing department. The ideal candidate has experience in motion graphics, an interest in financial markets, and excellent English language skills.<\/span>","expectations":[{"title":"Creating interactive content for traders worldwide across online platforms, reaching millions of viewers."},{"title":"Presenting ideas or proposals to a broad audience and collaborating with team members to enhance them."},{"title":"Providing explanation and support for our product through the use of modern video content."},{"title":"Contributing to the promotion of our established brand."},{"title":"Exploring new opportunities and continuously advancing your skills."},{"title":"Preparing all animation elements for composition, including delivery in specified formats."},{"title":"With professional video, audio, and lighting setups, our multifunctional recording studio allows us to use all modern marketing techniques. There are no boundaries for your creativity."}],"knowledge":[{"title":"A sense of motion flow composition."},{"title":"Knowledge and experience with programs: Figma, Adobe After Effects, Adobe Premiere. Experience with 3D graphics is a big advantage."},{"title":"Initiative, creativity, own ideas, and independence."},{"title":"Absolute reliability and the ability to manage your own time effectively."},{"title":"Previous experience in a similar position is welcome. We would like to see your portfolio\/showreel."},{"title":"Remaining calm under pressure, being able to perform multiple tasks at once, prioritize the most important tasks first, and meet deadlines."},{"title":"Synchronizing visual elements with audio and voiceover tracks."},{"title":"Working collaboratively with another animator on extensive animation projects."},{"title":"Communicating effectively, work as part of a team. Ideally, you have a portfolio of related work across several creative projects."}],"settings":{"location":"Prague, Czech Republic","duration":"Full time","remote":false,"new":true,"enable_recruitis":true,"job_id_recruitis":420386,"work_from_home":true}},"_links":{"self":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/ftmo_jobs\/601951"}],"collection":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/ftmo_jobs"}],"about":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/types\/ftmo_jobs"}],"wp:attachment":[{"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/media?parent=601951"}],"wp:term":[{"taxonomy":"job_category","embeddable":true,"href":"https:\/\/ftmo.com\/en\/wp-json\/wp\/v2\/job_category?post=601951"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}